{"law - Can a YouTube video be submitted as prior art?": "\nYes, you can submit a YouTube Video as prior art as long as the YouTube video is publicly available. YouTube videos usually have the publication date under the video, such as \"Uploaded by X on Oct 17, 2011\". If you provide a hard copy of the video itself, it be hard to prove that the video was public  or its publication date, especially if the public version of the video gets removed at a later time. I would recommend making a \"Print Screen\" image of each second in the video that is considered prior art. Make sure that the \"Print Screen\" image shows the URL of the video as well as its publication date on YouTube. Then convert each \"Print Screen\" image into a PDF Document. Combine all the PDF pages into a single document and submit this to the USPTO.  \nI'm a patent searcher and I have done this before. \nI hope this helps! :) \n", "patentability - What constitutes an original patentable idea in software?": "\nI can only speak to the United States and actually that is somewhat all that matters as it is very difficult to get software patents in other countries.\nIn the US, 35 U.S.C. 101 states that \"Whoever invents or discovers any new and useful process, machine, manufacture, or composition of matter, or any new and useful improvement thereof, may obtain a patent therefor, subject to the conditions and requirements of this title.\"\nSo, what does that mean exactly? The attorneys at the invaluable website bitlaw.com have complied a list of relevant cases concerning software patents. There are a few take away points that can be summarized:\n\nYou can't patent algorithms in their purest sense detached from the physical world. The relevant case is Gottschalk v. Benson. They must be attached to something in the physical world.\nYou can patent software that is a part of a larger invention connected to the physical world. The first case on this issue was Diamond v. Diehr. Specifically, if what you are applying for performs a function that transforms or reduces an article to a different state or thing it generally would be afforded patent protection.\nHowever, the test mentioned in Diamond v. Diehr is not to be used as the sole test for patentability as pointed out in the recent Bilski v. Kappos case. The court in Bilski stated that the machine-or-transformation test is not to be the sole determinant for patentability.\n\nWhich brings us to the present day. It is now unclear what the particular standard is that software needs to meet to be patented. If it is connected to a machine, or is involved in transforming something else then it is probably patentable. So what you will see is patents for software that have some sort of effect in the physical world like e.g. video compression software that produces high quality video on a display screen to a user or something.\nFor a much more thorough treatment of the topic and far better insight than I can provide I highly recommend the blog Patently-O.\n", "databases - How can I perform a global patent search for free?": "\nThe Lens, started as Patent Lens 15 years ago, is open, free, no advertising (secure) and a public service.  It searches in over 90+ jurisdictions and hosts 100M patent records.  It is not just federated search, but comprehensive links, analysis, embedding and sharing of records, collections and annotations.\nIt is run by a global social enterprise, Cambia and a publicly funded University, Queensland University of Technology (QUT).\nIt also has uniquely over 15M non-patent literature citations linked to canonical sources, to seek and explore prior and enabling art.\n", "search - How long does it take a patent application to appear in the USPTO database?": "\nAccording to the USPTO FAQ:\n\nMost patent applications filed on or after November 29, 2000, will be\n  published 18 months after the filing date of the application, or any\n  earlier filing date relied upon under Title 35, United States Code.\n  Otherwise, all patent applications are maintained in the strictest\n  confidence until the patent is issued or the application is published.\n\nEmphasis mine\n(This was in response to the question, Is there any danger that the USPTO will give others information contained in my application while it is pending?)\nTitle 35 in the USC (which the above FAQ cites) has this to say:\n\nSubject to paragraph (2), each application for a patent shall be\n  published, in accordance with procedures determined by the Director,\n  promptly after the expiration of a period of 18 months from the\n  earliest filing date for which a benefit is sought under this title.\n  At the request of the applicant, an application may be published\n  earlier than the end of such 18-month period.\n\nBottom line: 18 months after you file it, unless you request that it's published sooner. \nThere are some exceptions that provide that the application isn't published, but I don't think they are really important to your question (read: they were too dry for me to get through).\n", "prior art - Is there a way to achieve protections similar to \"Copyleft\" under the patent system?": "\n\"Copyleft\" is a specific application of copyright law (restricting the license to use copyrighted material by requiring that those obtaining it must also redistribute it for free / under specified terms).\nAny work under \"copyleft\" is protected by copyright law (thanks to The Berne Convention copyright is \"automatic\" in most of the world), and those copyright protections are what allow the author to dictate the terms under which the copyrighted work is used.\nAs far as I'm aware there is no Berne Convention equivalent in patent law: in order for you to have patent protection and the ability to dictate how your invention is used (by licensing the patent for it to impose Copyleft-style requirements on those using it) you must file for (and receive) a patent.\n\nNote that the sort of \"keeping information free\" protection the Copyleft folks would seek is inherent in US Patent Law and most other patent systems -- it is known as Prior Art.\nIn its most simplistic definition (cribbed from Wikipedia):\n\nPrior art …, in most systems of patent law, constitutes all information that has been made available to the public in any form before a given date that might be relevant to a patent's claims of originality. If an invention has been described in the prior art, a patent on that invention is not valid.\n\nSo if you have designed and publicly released something patentable (and can document the date of such a release to the satisfaction of the patent authorities) you can seek to invalidate any subsequent patent claims on the grounds that prior art exists.\n", "international - Is there a specified route to convert UK patents to US patents?": "\nThe usual way to have a patent recognized outside your home country¹ is to make a PCT application. A majority of countries are PCT members (Taiwan is the most notable exception). The PCT application must be made within 12 months of the original UK application (in the general case, there are exceptions). Usually, at this stage, you have a preliminary report from the UK office but no definitive grant or rejection.\nThe PCT application leads to a search of prior art and preliminary report on patentability. There is no such thing as a “worldwide patent”: the PCT application itself does not lead to a patent.\nWithin 30 months of the original filing in the UK (priority date), you may select countries¹ in which to deposit a national patent application, for example the US. The patent application is said to enter a national phase. The national patent office will have access to the international search report, but it is in no way bound by its recommendations. It can happen that one country accepts a patent and another denies it; you may get your US patent but not your UK patent or vice versa.\nFor more information, see the official PCT website.\nNote that I am not a lawyer, I cannot guarantee that what I wrote above is true. The process is complicated; you will need a US attorney to handle the US patent application anyway (like in most countries). Your UK patent attorney should know how to advise you.\n¹  Or group of countries (EPO in Europe, ARIPO in Africa, …)  \n", "uspto - Should I file a provisional application?": "\nThe AIA is not really a first-to-file system.  It's more of a first-to-disclose system.\nThat is, after public disclosure, you have a year to file.  Publishing in a journal can beat a later-filed provisional application.\n", "patent infringement - What can I do about an infringer if I'm a small independent inventor?": "\nBecome a troll.  Or join up with one.  Or sell out to one.  Or sell to someone else who wants your patent for other reasons.\nThere are now a very large number of investors and attorneys who will help you to monetize your patent - provided they think they can make money from it.  Almost all of them would be described as patent trolls, more politely known as \"non-practicing entities\" or NPEs.  These are the guys who provide Davids with slings and stones to go up against Goliaths - for a piece of the action.\nFor some reasonably accurate background on the term \"patent troll\", check out the Wikipedia entry: http://en.wikipedia.org/wiki/Patent_troll\nBTW, you could also offer to sell your patent to practicing entities other than your suspected infringer in the appropriate technological field.  Your patent could be an arrow in the quiver of any entity who contests with the large company that you suspect is infringing your patent.\nThe principle is much the same in any case - trying to determine a net present value of the patent in the marketplace.  Making such a determination has little to do with judging whether your invention is worthy as being original and much more to do with judging how much money can be extracted from the broader world of commerce via ownership of the patent.\n", "international - Revising a poor English translation of a US national phase application based on a foreign language PCT application": "\nSince the US application is the national phase of a PCT application, the specification of the PCT application is the specification of the US application. The poor English translation is unfortunate, but the fact remains that the content set forth in the original PCT application should be the content that is represented in the US national phase application.  In this regard, correcting the poor English translation merely amounts to rephrasing or correcting an obvious error (see MPEP 2163.07).  Corrections to the specification of the US national phase application can be made in order to ensure that its content is the same as the content of the PCT application, as described below.  \nThe specification of the US application can be amended at anytime up until the issue of the patent by filing an amendment with the USPTO according to the guidance set forth in MPEP 714.\nIf the patent has already issued, then the specification may be amended by filing a reissue application in order to correct the issued patent.  A common ground for filing a reissue application is that the specification contains inaccuracies (see MPEP 1402).  During prosecution of the reissue application, an amendment may be filed with the USPTO that amends the specification according to the guidelines set forth in MPEP 1453.\n", "inventorship - What should I do if my name is missing from a patent?": "\nIf it is a United States patent see if your company's patent attorney(s) will file a \"Correction of Inventorship\" pursuant to CFR 37 Section 1.48 which reads in relevant part to your situation:\n\n§ 1.48 Correction of inventorship in a patent application, other than a reissue application, pursuant to 35 U.S.C. 116.\n(a) Nonprovisional application after oath/declaration filed. If the inventive entity is set forth in error in an executed § 1.63 oath or declaration in a nonprovisional application, and such error arose without any deceptive intention on the part of the person named as an inventor in error or on the part of the person who through error was not named as an inventor, the inventorship of the nonprovisional application may be amended to name only the actual inventor or inventors. Amendment of the inventorship requires:\n(1) A request to correct the inventorship that sets forth the desired inventorship change;\n(2) A statement from each person being added as an inventor and from each person being deleted as an inventor that the error in inventorship occurred without deceptive intention on his or her part;\n(3) An oath or declaration by the actual inventor or inventors as required by § 1.63 or as permitted by §§ 1.42, 1.43 or § 1.47;\n(4) The processing fee set forth in § 1.17(i); and\n(5) If an assignment has been executed by any of the original named inventors, the written consent of the assignee (see § 3.73(b) of this chapter).\n\n", "us7222078 - What does the term 'commodity' mean in patent 7,222,078?": "\nAbsent some definition or example in the document itself, one must fall back on the “ordinary and plain meaning” of the term, which, as with all terms, is subject to interpretation and dispute.\nThough it's tempting to say more than that, anything further would be misleading: how the “ordinary and plain meaning” of an undefined term is established will depend on the nature of the term, the context in which the term is used, the venue in which its meaning is being disputed, and the persuasiveness and expertise of the participants in the process. \n", "uspto - Can a granted patent be deeded to the public?": "\nYes, it's called a statutory disclaimer:\n\nA patentee owning the whole or any sectional interest in a patent may disclaim any complete claim or claims in a patent. In like manner any patentee may disclaim or dedicate to the public the entire term, or any terminal part of the term, of the patent granted.\n\n", "copyright - Are text and images in the patent copyrighted?": "\nI found answer on the USPTO web-site: \n\nPatents are published as part of the terms of granting the patent to the inventor. Subject to limited exceptions reflected in 37 CFR 1.71(d) & (e) and 1.84(s) , the text and drawings of a patent are typically not subject to copyright restrictions. The inventors' right to exclude others from making, using, offering for sale, or selling the invention throughout the United States or importing the invention into the United States for a limited time is not compromised by the publication of the description of the invention. In other words, the fact that a patent's description may have been published without copyright restrictions does not give you permission to manufacture or use the invention without permission from the inventor during the active life of the patent.\n\n", "patentability - Was there a landmark controversial software patent of a trivial idea before the \"XOR flashing cursor\" patent?": "\nIn 1972 the US Supreme Court decided the case of Gottschalk v. Benson, which addressed the then-controversial idea of whether or not the software implementation of an algorithm for converting decimal numbers to binary could be patented. The algorithm itself was very straightforward (simple enough that lawyers could explain the thing in its entirety in a few paragraphs in the holding), and the court rejected the patent, on the grounds that allowing the software implementation of the algorithm to be patented would \"wholly pre-empt the mathematical formula and in practical effect would be a patent on the algorithm itself.\" \nGottschalk is usually cited as the first important ruling on software patents, and it's hard to imagine a substantially earlier application - the actual application is hard to find online, but it was filed in 1963 (according to the first appellate decision). It also had significant parties supporting both sides (IBM on one side, Mobil on the other, for example). So it's probably the earliest example of a controversial software patent.\n", "software - Consequences of unwilful US patent infringment by a foreign legal entity when establishing US presence": "\nThe holder of a valid US patent has two forums in which to assert its patent rights: Federal District Court and the International Trade Commission (ITC).  In either forum, the court must have jurisdiction to try the case.  \nGenerally speaking, a Federal District Court needs some \"hook\" to assert jurisdiction over a party. In the circumstances you describe, it seems likely that the reseller or subsidiary will be subject to the jurisdiction of at least one Federal District Court because the business exists or operates or has assets somewhere in the United States.\nThe ITC has the authority to prohibit the importation of goods into the United States. So even in the first circumstance you posit, the US company has recourse to halt the infringement (in the US) by bringing suit at the ITC.\nIn the Federal District Court both parties have the full panoply of rights and defenses normally available in the forum.  At the ITC the parties face issues that are unique to that forum, such as proof of impact on a domestic industry, for example.  But again, the rights and defenses of the parties within that forum are well established and fit the circumstances you propose.\n", "uspto - Can willful patent infringement exist without prior notification?": "\nMaking the accusation of willfulness is trivial; proving it at a trial is more difficult.  Simple failure to search is not sufficient basis for a finding of willfulness.  Some showing of actual knowledge of infringement or likely infringement is required.  Notification (whether by the patent holder or any other party) is evidence of knowledge.\nAs with so many of the answers you will see on this site, even this explanation comes with a large helping of \"it depends.\"  For example, one may avoid searching because he knows (somehow) that relevant patented technology is out there.  If that can be shown, then the failure to search supports an argument for willfulness.  But even then, if the infringer was utterly ignorant of the patent claims being asserted, a jury might well find that the specific infringement was not willful.  \nThe determination of willfulness is up to the finder of fact - either the judge (in a bench trial) or a jury.  The finding will always depend on the specific set of facts presented at trial.  \"Facts\" as reported in the news or assumed by the public are not the same sort of creature as a \"fact\" admitted into evidence in a trial.  All facts are weighed by the finder of fact to arrive at a verdict.  Different juries (and judges) could well reach different conclusions based on the same sets of facts.  Litigation is very expensive, so \"slam dunk\" questions rarely make it into a trial. \nSomething else to be aware of: a jury's (or judge's) finding of willfulness is one condition under which the judge can enhance a monetary award, but the judge is not required to do so.  The willfulness premium is limited at the top end, and the lower bound is zero.  The judge has discretion to select an enhanced value that seems most appropriate in all of the circumstances - which may include mitigating factors that reduce or preclude additional compensation even when the infringer is fully aware of the patent before initiating the infringement.\n", "prior art - Is use in foreign countries a bar to patentability?": "\nIn a direct answer to the question, absolutely yes (the title is worded opposite to the question so the answer to the tile is no), up until March 16th of 2013 when the provisions of the AIA kicked in. The old law said you couldn't get a patent if it was patented or published anywhere in the world. Or if it was known or used by others in this country  - 35 USC sec 102(a). That all changed with the AIA so that the location of the known or used is worldwide. I think it was originally USA specific due to the difficulty of proving or disproving that something was known or used out of the country. A publication is in black and white.\nThat does not mean one can steal an idea you learn on a foreign trip or apply for a patent when you know you are not the first and true inventor, inventors sign an oath to that effect.\n", "patentability - Can a very basic shape of a product be patented?": "\nThis is a specific type of US patent filing.  It relates to the underlying form and style of the device.  Apple said that a 'white rectangle' with 'large borders/margins' and 'curved corners' was their 'signature' design features for a 'flat tablet' computer device.  The jury agreed (very strongly).\nI personally don't agree this type of patent should be used so broadly, or provide protection that strong.  That said, the Apple court argument does have some merit.\nThe British / Common Law approach, providing protection against \"Passing Off\", is (IMHO) a much better approach.  This protects anyone (even without specific 'design' patent filing) from a product (particular an inferior one) from being too close in exact appearance.\nI hope (in the Apple / Samsung case) the jury finding is overturned or weakened on appeal, to be closer to \"Passing Off\" protection, and simply requiring Samsung to diverge enough in their design.\n", "us20120052930 - Prior art for video games played according to a selected value system such as the claimed \"codes of honor\"": "\nThis reads to me to be more about character alignment than professions and skills. Still, there is prior art.\nFor example, the Mass Effect series allows the player to choose responses that follow one of the three moral paths - paragon (\"good\"), renegade (\"evil\"), and neutral. The other characters in the game then take the player character's alignment into account when reacting to their actions. \nA paragon and a renegade character could accomplish the same goals (such as saving all of humanity), but they would go about it in different ways and with different consequences.\nFrom the Mass Effect Wiki:\n\nParagon or Charm dialogue choices (colored blue in dialogue trees) often lead to people being more open and friendly with Shepard, and can sometimes avert entire battles that would otherwise be triggered.\n  [...]\n  Renegade or Intimidate dialogue choices (colored red in dialogue trees) generally lead to people disliking and even fearing Shepard, and occasionally \"encourage\" people to tell or give more than they otherwise would. Like with Paragon/Charm options, Shepard can sometimes avert entire battles that would otherwise be triggered.\n\n", "defensive publications - How to make an invention un-patentable easily?": "\nA publication doesn't have to be official to count as prior art against the novelty of a patent application. Defensive publication is not regulated by any particular formalism.\nYou must take care that your description is as precise as possible. Simply describing a general idea in vague terms may not be considered prior art for a patent application that describes the working of the invention in detail: the defensive publication must, like a patent application, be enabling, i.e. it must enable a person with ordinary skill in the art to reproduce the invention.\nIt is in your interest to make the defensive publication in a venue where people in that specialty may come upon it. That could be a popular blog, or better, some technical journal. That publication would then be not only prior art regarding novelty, but also would improve the chance that some trivial variation is considered unpatentable due to the non-obviousness requirement, as one skilled in the art would be considered familiar with your technique.\nIt is in your interest to make your publication known to the examiner. While you can still defend against a granted patent by establishing that you followed a preexisting publication, having the patent granted shifts the burden of proof. Again, a technical journal in the relevant field that the examiner is likely to search specifically is a good option. Examiners can use Google too, so a blog isn't out of the question.\nOne thing to take care of is that the content and the date of the publication must not be subject to controversy. A blog under your control might be cast into doubt, you would be depending on third-party archives. Again, a technical publication archived in many libraries would be ideal. A message to a mailing list as a complement of a blog post would also help spread your content.\nSome large corporations make or made their own publication, such as IBM's Technical Disclosure Bulletins. I don't know why they discontinued the practice (in 1998). It may have had to do with the rising ability to publish and be read on the web.\n“The Effect of E-Resouces on Technology Development” by Anthony Breitzman analyzes the sources of references in patents and trends from 1997 to 2006. Technical journals and conference reports make up the bulk, but Internet citations are on the rise.\nIf your invention can be considered applied science, even if you don't want to go all the way towards a refereed publication, consider writing a technical paper and publishing it on arXiv.\nIP.com maintains a database of publications that can be searched for free but \nrequires payment for inclusion. You can read their presentation of the benefits of their service for arguments against self-publication of technical disclosures.\n", "law - Can software or a block of code under the GPL or a similar license be patented?": "\nYes.\nThat's one of the reasons why version 3 of the GPL specifically states that you must grant all downstream recipients of a covered work an irrevocable, royalty free license to the patented component, or you can't distribute the software. Redhat reached the first licensing deal that complied with this requirement. That is a good step, but not a solution. Patent threats can pop up like moles in a game of whack-a-mole.\nThere are a myriad of patents that could potentially apply to any sufficiently complex piece of software, such as a file system, and no license (no matter what version or conditions implemented) can solve that problem. The problem is, parts of complex software are often already patented, but the patents are unknown to the author. It can be just a matter of time before a patent holder discovers a possible infringement and begins to take action - or the 'infringing' parts may remain undiscovered forever. \nRemember, you're not patenting code, your patenting what it implements or accomplishes. Thus, you could take that bit of code, re-write it in a completely different language and you still have the patent problem to deal with. The copyright changed because the work is your own (thus the license no longer applies), but the patent remains because the code still implements or accomplishes the same thing.\nIf no patent exists that could apply to the software, then the software itself would be prior art - but that might not stop the patent from being granted.\n", "filing - Is it practical for a novice to successfully file a patent without hiring a patent lawyer?": "\nI don't think there is a direct answer available. Your circumstances actually pose a generic strategy question for someone with an idea for something new.\nAs I have written in answer to other questions, the underlying issue is net present value of the idea/invention. How do you capture, and then accelerate, that value? You are confronted with compound questions of timing, cost, implementation, secrecy, and business partners.\n\nPatent protection, even if possible, might not be the best way to protect or exploit your idea. Patent prosecution is an arcane art with innumerable opportunities the get side-tracked or lost in the process. Pick a few patents and compare the filing date with the issue date. Ten thousand dollars can get your patent application in the door at the Patent Office, but it commonly takes many years, and tens of thousands of additional dollars, to get a patent issued, even for experienced inventors with capable legal help.  \nCan your idea be implemented into products and protected as a trade secret as you exploit it in the marketplace? Is it likely to be leap-frogged by other technology in a relatively short period?  By leap-frogged, I mean the development of alternatives that do not employ your idea to get the same or superior performance. Trade secret protection does not work if your idea is obvious or easily reproduced just by observing or examining any product in which it is used.\nThe penurious have options for obtaining patents, but the choice of 1) going it alone pro se or 2) finding a money partner is a common threshold for technical folks. Can you put together a prototype product illustrating the value of your idea? If so, you have a better chance of finding that money partner. Be aware, though, that you have only one year from the full realization of your idea to file for a patent.\nDo you really have a new idea? Do you know enough about the area of technology and the history of that technology to be reasonably (read economically) sure? There are something north of 8 million US patents already - with hundreds of thousands of applications working their way through the system. There are tens of millions of technical papers, doctoral dissertations, white papers - and physical products extant in the world. Are you saying that none of them could possibly be interpreted to encompass your idea?\n\nI am not trying to rain on your parade with respect to your possibly patentable idea, but I think the question is ill-considered because it assumes that patenting the idea is the best (or even a reasonable) approach. Alternatively, I would say that, while it is theoretically possible for a novice to prosecute a patent application successfully, the chances of that being a reasonable investment of time and effort is within epsilon of nil.\n", "usa - When patenting in the United States, what impact does patenting in other countries too have?": "\nUnlike copyright, a patent is only valid in a country where it has been filed, accepted and registered. A US patent gives you an exclusive right to use your invention (including manufacturing a product using it and selling a product manufactured using it) in the US. It doesn't constrain someone who operates entirely outside the US.\nThere are some groups of countries that have mutual patent recognition agreements (ARIPO and OAPI in Africa, EAPO around Russia, EPO in Europe). These groups of countries have agreements where a patent application is examined by only one office, but if the patent is granted the applicant must decide in which countries in the group the patent will apply (and pay each country's fee). The US isn't a member of any such organization; there's no particular agreement on patents between the US and Canada, for example.\nIn order to apply in more than one country (or group of countries), the patent must be examined in each country. A majority of countries (including the US) have ratified the Patent Cooperation Treaty. The usual way to extend a patent to many countries is to file it in your home country, then file a PCT application, then have the patent examined by national offices of PCT member states. See the PCT website for more information. See also this answer. Note that it can happen that a patent is granted in one country but rejected in another: maybe one country will find some prior art that another country won't, or maybe they'll interpret it in a different way.\nWhich countries to file your patent is depends heavily on what the logistics and market is for your product. If you only ever expect to sell your product in the US, a US patent is good enough. If you think your product can only be manufactured economically in a few countries, patent it in these countries (assuming that you trust these countries' patent enforcement). If you think your product could be manufactured and sold anywhere, it's a matter of investment: each additional country costs you money upfront but locks your competitors down more.\n", "101 - If a claimed invention can be described at a higher level of abstraction, is the claim not merely an abstract idea?": "\n“Abstract ideas” does not mean what your question assumes it means. What it does mean will only become clear over (likely quite some) time; but an abstract description of something does not make it an “abstract idea” in the sense of any probable interpretation. The desire, as expressed by the courts, appears to be to prevent the patenting of “a fundamental truth; an original cause; a motive”, but it is unclear how to achieve that, or where to draw lines. Various tests have been described and proposed, but it remains to be seen what those tests mean in practice.\nIn short, as long as an invention meets other criteria of patentability, the level of “abstraction” of its description — or of a potential other higher-level description — is unlikely to have much bearing, one way or the other.\n", "What are the possible consequences of using software developed outside of the US that infringes a software patent?": "\nThe fundamental description of infringement is given in USC 35 section 271(a) as:\n\"Except as otherwise provided in this title, whoever without authority makes, uses, offers to sell, or sells any patented invention, within the United States, or imports into the United States any patented invention during the term of the patent therefor, infringes the patent.\"\nNote that infringement is defined as occurring within the United States.  For that reason, your latter two circumstances fall outside the scope of infringement for purposes of United States law.\nUnder the circumstance you posit, and recognizing that the criteria for infringement as stated:\nUS citizens within the territory of the US may well be liable as patent infringers because they use the infringing software.  \nNon-US citizens are just as liable as patent infringers as users because US Courts have jurisdiction over anyone present in the US.\nI think this answers the question as posed, but see USC 35 section 271 \"Infringement of patent\" for more details and nuance.\n\nThe text of USC 35 section 271 is available online from\n  the Legal Information Institute\n  at \"35 USC § 271 - Infringement of patent\"\n  ,\n  from the USPTO \n  in Manual of Patent Examining Procedure Eight Edition, Revision 9 (August 2012) [MPEP]\n  at \"35 U.S.C. 271 Infringement of Patent\"\n  and from the Office of the Law Revision Counsel \n  in United States Code \n  at \"35 USC 271: Infringement of patent\". (Note that MPEP is a specific version and in the future will not be the latest. The USC from the Office of the Law Revision Counsel is a beta website, with \"beta\" in the URL. I expect that link to go stale in the future.)\n\nFinally, what you did not ask is whether you are liable as an infringer.  If it is determined that you \"sell\" your software \"within the United States,\" you are.  Further, the International Trade Commission has jurisdiction to prevent importation of infringing devices (including software devices).  So, while the ITC may not be able to haul you into a courthouse in Washington, D.C., it can issue an injunction that prohibits the importation of your software.  Were that to happen, anyone who defied the injunction by, say, directly downloading your software into the US from a foreign website, would be in much deeper doo-doo than a mere infringer.\n", "us20120223477 - Amusement Game": "\n@Gilles found these dice for sale on Amazon, which return two independent variables.  (Each is a number from 1 to 6).  (He posted his find as a comment above.)\nThis item clearly establishes that no claims can reasonably made for the novelty of a die-like invention returning two independent variables. \nThat would seem to limit the potential viability of this patent to the question of whether one of those variables being a color, rather than a number, is sufficiently useful and non-obvious.   \n\n", "us20120231838 - Microsoft have submitted a patent for a whack to silence a phone ringer. How similar does prior art have to be?": "\nI have an app called Shake2MuteCall on my Droid2 for awhile now. I hit my phone and it stops ringing.\n", "us20120226658 - Prior art for a simple versioning system on a document database": "\nThe VMS operating system - first released in 1977 - tagged each file with a version number.\nHere is a script written in 1992 called COPY_IF_NEWER which does what the patent claims, using the creation date of the file as the \"version tag\".\nThe COPY command of VMS did this automatically and by default.\n", "us20120226390 - Timeline Display for Vehicle Fleet Management": "\nI believe these could all be relevant—all written by me while at Whereonearth and Yahoo:\n\n20090018770 \n20090019182 \nUS 2005003835 and GB2402841B\n\n", "us20120226507 - Prior art for bed management in healthcare": "\nIf you read further into the patent under [0022] it says:\n\nThe examples below describe a web based computer network. Although the present examples are described and illustrated herein as being implemented in internet based system, the system described is provided as an example and not a limitation. \n\nIANAL, but I believe prior art for this patent would just be any hospital that currently manages beds. It does not even need to be a software management system.  It could be paper based, or whiteboard based, etc.\nFor instance, if you could show a hospital that has a list of vendors, a list of beds, and a list of nurses and uses those three things to manage where beds are then simply reimplementing this in software, does not add anything novel to the process. \n", "patentability - What is the window for finding prior art on a patent application?": "\nA patent application can be contested by a third party via prior art submission during a window that usually lasts more than 6 months.\nThat window opens when a patent application is published -- usually 18 months after the application is first filed. The window closes when:\na) The inventor receives a Notice of Allowance (NOA)\nOR If no NOA has been sent, the window closes at the later of the following two events:\nb) The application has been published for 6 months\nc) The USPTO has completed the first office action on the merits of that application\nIn other words:\n\nUnless a patent is issued very quickly, third parties have at least six months from publication to file a preissuance submission.\n\nSee page 83 here (pdf) for full rules.\n", "us20120222191 - Prior art for athletic gear with padded seat area": "\nTo me this seems like what motorcycle clothing has been doing forever. In jackets and pants they have padding inserts that can be removed and/or replaced. They are primarily for protection in case of a fall but to me this sounds like the exact same proposal. Just in a different area of the body. \n", "us20120226392 - Prior art for using a camera in self-driving cars": "\nThere seem to be numerous examples of this technology at play as researchers have been working on autonomous vehicles for quite some time.\nOne of the best examples I found was from the 2007 DARPA Grand Urban Challenge in which a team from Tartan Racing successfully completed an urban driving challenge using a Chevy Tahoe equipped with, among other tech, cameras used for observing road markings.\n\nThat same challenge also featured a team from Stanford Racing led by Sebastian Thrun who went on to lead Google's autonomous vehicle program and likely incorporates much of the same type of technology.\n", "us20120222429 - Prior art for Vehicle Air Conditioner": "\nI don't know the technical area, so I cannot speak to whether claim 1 identifies anything \"fundamentally different\" for pre-existing AC systems.  It is not necessary that the patent disclose a fundamental difference with prior art - the novelty may be small, even very small.\nFurthermore, claim 1 is not the be-all and end-all of the patent.  This application has three dependent claims, each of which is a separate invention.\nI have given other similar answers to similar questions. Taken together, they give a more complete overall answer to this question.\nPrior art for using a camera in self-driving cars\nMicrosoft have submitted a patent for a whack to silence a phone ringer. How similar does prior art have to be?\nCan the non-obviousness of an invention be challenged if the difference to prior art is only the mathematical-statistical approach?\nand\nPrior art for wear-focusing of non-volatile memories.\n", "us20120226962 - Prior art for wear-focusing of non-volatile memories": "\nYou quote claim 1 of the patent, and that may be (or be close to) common practice in the art.  Each claim of a patent, however, is a separate invention. In order invalidate all of the claims of a patent, it is necessary to perform prior art analysis for each claim.\nNot every element of a claim has to be novel.  Invalidating an independent claim does not necessarily invalidate any of its dependent claims. \nPlease see my answers to these question: Prior art for using a camera in self-driving cars and Microsoft have submitted a patent for a whack to silence a phone ringer. How similar does prior art have to be? and Can the non-obviousness of an invention be challenged if the difference to prior art is only the mathematical-statistical approach? for more detail on why addressing a single claim element or a single independent claim is not sufficient to invalidate all of the claims of a patent.\n", "us20120226640 - Can the non-obviousness of an invention be challenged if the difference to prior art is only the mathematical-statistical approach?": "\nA short answer to your question is that employing different statistical methods could be sufficient novelty - but it depends on whether such a switch in approach would be a natural move for \"one of ordinary skill in the art.\"  Is such a move somehow counter-intuitive, or even contra-indicated?  Is the result unexpected?\nMore significantly, though, prior art analysis does not end with the first claim of a patent.  Please see my answers at Prior art for using a camera in self-driving cars and Microsoft have submitted a patent for a whack to silence a phone ringer. How similar does prior art have to be? for some explanation of additional elements of the analysis.\n", "us20120225162 - CALL FOR PRIOR ART: “Method and System for Weight Management” (13/466,661)": "\nhttp://www.fitfaq.com/muscle-building-guide.html  Seems to be close, it doesn't have the correct percentages for carbs and fat though.\n\n\nEat 5-6 healthy, balanced meals per day.\nEach meal should be approximately 30% protein, 30% fats, 40% carbs.\nConsume 1 gram of protein per pound of bodyweight every single day.\nGood protein sources include: eggs, chicken, turkey, fish, lean beef, cottage cheese, low-fat cheese, whey protein powder, protein bars, and meal replacement powders (MRPs).\nGood sources of carbs include: vegetables, fruits, legumes, and whole grains (including oatmeal, brown rice, whole grain wheat, etc.).\nGood sources of fats include: nuts, seeds, olive oil, peanut butter, low fat cheese, fatty-fish, low-fat mayonnaise, and flax seeds.\n\n\nAnd http://www.leehayward.com/protein_part2.htm gives percentages in the correct range but doesn't appear to have the other details:\n\nThe ideal ratios may vary widely based on these factors, but as a \"baseline\" I recommend that 30% of your calories come from protein. That leaves 15% from fat and 55% from natural, unrefined complex carbohydrates.\n\nedit to show that this information is \"prior\": http://web.archive.org/web/20040225033829/http://www.fitfaq.com/muscle-building-guide.html and while not the same page has the same information http://web.archive.org/web/20040606172718/http://www.leehayward.com/howmanycal.htm\n", "us20120207901 - Prior art for ice cream maker insulated with inflatable cushion": "\nThis application got a non-final rejection at the end of Nov. based  on Mobley 5666261 and Angus 5857351. If you are interested in it you can look in USPTO public PAIR. There are several things already listed on the record by the applicant and by the examiner.\n", "law - Can we not invalidate older patents?": "\nYes, there is a process for invalidating older patents. It is called reexamination. However, the process is costly (~$16k in filing fees) and somewhat complex. Provided you have the killer prior art that is needed to invalidate a patent, you will need more skin in the game than simple indignation to go this route. \nBut you can still ask for or post prior art and potentially make a difference.\nEven thought you can't just submit that for free on a granted patent, you make it a bit easier for the folks that do have skin in the game by sharing what you have on the problematic patent(s).  That way, if someone is sued for infringing, they'll be armed with what they need to defend themselves.\n", "us20120016857 - Prior art for SEO": "\nThe claim is as follows:\n\n\nA computer-readable medium comprising computer-readable instructions for providing search engine optimization analysis, wherein execution of said computer-readable instructions by one or more processors causes said one or more processors to carry out steps comprising: obtaining a starting uniform resource locator identifying a network location for a starting web resource; analyzing said starting uniform resource locator, wherein said analyzing comprises obtaining a text-based portion of said starting web resource comprising data and metadata, processing said data and said metadata to determine a plurality of potential target terms, and performing a relevancy test of said text-based portion of said starting web resource based on said plurality of potential target terms; determining any referred uniform resource locators in said text-based portion of said starting web resource, wherein said referred uniform resource locators each identify a referred web resource sharing a domain with said starting web resource; recursively analyzing said referred uniform resource locators, said recursive analysis comprising obtaining an additional text-based portion of a referred web resource; processing additional data and additional metadata in said additional text-based portion of said referred web resource to determine additional potential target terms for each referred web resource, and performing an additional relevancy test of said additional text-based portion of each referred web resource based on said additional potential target terms for each referred web resource; analyzing a link index of a network comprising said starting uniform resource locator to determine web resources linking to said web resources associated with said starting uniform resource locator and said referred uniform resource locators; calculating an internal search engine optimization score based on said analysis and said recursive analysis; calculating an external search engine optimization score based on said link index; providing a graphical report comprising a visualization of statistical information related to search engine optimization; and providing a domain visualization map comprising a graphical network representation of said statistical information for said starting uniform resource locator and said referred uniform resource locators. \n\n\nI will attemp a translation:\n\ncode for doing seo analysis by a) getting a starting webpage and figuring out the relevancy of the text on that page b) getting all the outgoing urls on the same domain, and doing the same thing recursively (so spider the website) c) looking at other web sites linking into this site d) giving the text an SEO score e) giving the links an SEO score f) showing the SEO results in picture form and g) showing the network links visually as a graph\n\n\nPrior Art for section A: Data harvesting method apparatus and system Patent application US20050192948 http://appft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PG01&p=1&u=/netahtml/PTO/srchnum.html&r=1&f=G&l=50&s1=20050192948.PGNR.\nPrior Art for section B:\nPrior Art for section C:\nPrior Art for section D: \nPrior Art for section E: Definitely PageRank, in Patent number 6,285,999\nPrior Art for section F: \nPrior Art for section G: Method and system for visualizing multivariate statistics in Patent number US8013864 http://patft.uspto.gov/netacgi/nph-Parser?Sect2=PTO1&Sect2=HITOFF&p=1&u=/netahtml/PTO/search-bool.html&r=1&f=G&l=50&d=PALL&RefSrch=yes&Query=PN/8013864\n\nAll the pieces of this exist as prior art. The question is whether putting it together is patentable.  (In certain cases, this can happen, in others it cannot - it depends on how obvious that is to a skilled practitioner in that area). \nI think the best initial approach is to show prior art for all the clauses of the independent claim I quoted above, so I'm making my answer community wiki and anyone should feel free to edit it.\n", "us20120110437 - Prior art for \"Style and layout caching of web content\"": "\nClaim 1 doesn't seem novel, everything seems to be described in an article from October 2009 (before the October 2010 filing date of this patent):\n\n\"parsing the Web page file to create a document object model (DOM) tree comprising DOM tree nodes;\" http://taligarsiel.com/Projects/howbrowserswork1.htm#DOM\n\"constructing a style caching tree comprising structure information of the DOM tree;\" http://taligarsiel.com/Projects/howbrowserswork1.htm#Firefox_rule_tree\n\"storing the style caching tree in a memory;\" Where else you gonna put it?!?\n\"constructing a render tree comprising render objects based at least in part on the structure information of the DOM tree;\" http://taligarsiel.com/Projects/howbrowserswork1.htm#Render_tree_construction\n\"performing a layout calculation for render objects;\" http://taligarsiel.com/Projects/howbrowserswork1.htm#Layout\n\"and storing the layout calculation results in the memory.\" Where else you gonna put it?!?\n\n", "us7311526 - Prior art for Apple's Magsafe": "\nAs John Daniel has commented, they reference those very examples of prior art you cite. Even though there is prior art it doesn't invalidate the patent because Apple have substantially improved on it. The novel parts are:\n\nA symmetrical connector that can can be coupled in two or more orientations (claims 1-33)\nThe magnets within a connector are arranged in opposing polarities for improved coupling strength (claims 34-57)\nThe connector is decoupled without being damaged when driven by a non-axial (e.g., perpendicular) force. (claims 46, 51-54)\n\n", "us8082501 - Enabling Users to Interact in a Virtual Space (Worlds Inc)": "\nProviding prior art around the concept (as opposed to alternative implementations) would include the book Snow Crash, published by Neil Stephenson in 1992 - that goes into incredible detail describing several interactions related to a Virtual Space.\n", "patentability - Are Software Development Methods patentable?": "\nFrom my experience as a software developer I don't see how something like agile can be patented and if it was patented how that could be enforced. Any money you would make from that would likely be more in the form of selling publications and certifications. So that falls more in the copyright and trademark arenas. \n", "patentability - Can game mechanics be patented?": "\nBoard game mechanics (the process for playing the game) are patentable.  A Google Patent search for \"board game\" turns up lots of results.  So no, just changing the artwork is not enough to avoid infringement if the game mechanics are patented.  (See the article Patenting Board Games 101 for more information.)\nIn the legal battle surrounding Scrabble, the game mechanics did play a part.  Hasbro dropped their lawsuit against the makers of Scrabulous after they agreed to change the name and the rules of the game, by increasing the number of letter tiles that each player receives from 7 to 8.\nAn additional note regarding copyrights of board games:\n\nCopyright does not protect the idea for a game, its name or title, or the method or methods for playing it. Nor does copyright protect any idea, system, method, device, or trademark material involved in developing, merchandising, or playing a game.\n\nReference: Can I copyright my game? Are game rules protected by copyright?\n", "computer graphics - Prior art on Microsoft patents asserted against Barnes & Noble and Motorola": "\nIt would appear that any virtual keyboard would qualify under #7,411,582: \"Soft input panel system and method.\", and as the wikipedia article shows, even the general idea of intelligent work surfaces has been around since at least 1993, although if Microsoft's version is an improvement on that, it will not be relevant.\n", "us20120227028 - Prior art for Graphical Instance Instantiation": "\nSounds like Naked Objects. Apache Isis is mentioned in the Wikipedia article. I remember running something similar for C++ in the late 90's.\n", "invalidation - Does prior art need to cover all claims in a patent application in order to invalidate it?": "\nOne reason for having dependent claims in the first place is that they can potentially stand on their own even if the claim that they depend from is deemed invalid. So no, if a particular claim has prior art it doesn't necessarily mean that its dependent claims will also be invalidated. However, depending on the particular prior art they could very well be rejected for obviousness.\n", "software - Can I patent my logic for a pantry management system?": "\nA quick google search for warehouse management systems with logic for tracking expiration dates brought back this system. While it's not a pantry system and is in fact intended for much larger operations, it does track products and locations, includes \"Tracking for Expiration Dated Food\", and is mobile. I've never used it so I can't attest to the truth in the advertising.\nRelevant search terms in this case would be 'warehouse management' or 'asset management' software. I don't have the ability to look up if there's a specific patent on the subject currently.\nEDIT\nThese patents and applications seem to cover what you're looking for:\n\n2010179881 - System for Making Product Purchases (application)\n6,982,740 (2006) - RFID system and method for tracking food freshness (patent)\n20120101876 - Method of Managing Household Product Inventory (application)\n\nThe first one consists of web-based software plus an in-house terminal; the second is an RFID system; the third is \"virtual\" on an \"electronic device\". Of them I think the first is the best fit (and kind of cool.)\n", "What is the layman's definition of 'prior art' in the US and other countries?": "\nPrior art is not limited to the US, and is at the core of all patent prosecution (the steps taken to get a patent) that I am aware of (Europe, Eastern Asia, and the US). In the simplest terms, \"prior art\" is simply evidence that something has been done before a person applies for a patent. For example, if I file a patent today, and somebody wrote an article, or had a patent, or sold a product, that did the same exact thing (or something close) before I filed my patent, that is prior art.\nOne way to look at it is that prior art is the \"flip side\" of patent infringement.  Take Apple v. Samsung for example. If the Samsung device came out before Apple filed for a patent, the Samsung device would be prior art. Since the Samsung device(s) came out after Apple received a patent the devices are not prior art and (allegedly) infringe Apple's patents.\nAs you can see, the key question is one of timing. \nA few notes...The exact rules for the timing of prior art is a subject much to detailed for AP. Additionally, under US law, the type of prior art (publication, sale of goods, etc) will affect how the art is classified. Additionally, the \"filing date\" of a patent may not actually be the day the inventor puts the application in the mail, it may be earlier if the inventor claims \"priority\" to another filing.Here's a link with some brief descriptions of types of prior art in the US (subject to AIA changes). For more information on US law, try googling for \"35 USC 102 prior art\" (35 USC 102 is the section of the US Code relating to prior art).\n", "us8118911 - Prior art for Dual Air Drying Arrangement": "\nI do not see the word desiccant in those references. Take a look at\nPatent number us4673420 from 1987. I do not see it listed in the face of the patent in question so it is likely something the examiner didn't look at.  It may not be seen as teaching the \"inner chamber\" of claim 1.\n", "us8082501 - How specific must prior art be to invalidate a patent?": "\nThe linking you describe in point 1 is very important.  The patent you cited claims priority to previous patents/applications.  These are all \"continuations\" which means they have the same specification and cover the same subject matter (as opposed to a \"continuation-in-part\" or \"divisional\" which may have different subject matter).  Since they have this priority chain, you would actually have to find prior art from 1995.\nThis set of cases is also being discussed here: Enabling Users to Interact in a Virtual Space (Worlds Inc) - Issued Patent - PRIOR ART REQUEST\n", "us7864163 - Prior art for double-tap to zoom in a structured document / web browser": "\nThis seems an obvious development to stuff that opera were doing with their mini browser in 2007.  In their version, you zoom to parts of the screen by tapping them.  \nEvolving the Internet on your phone: Designing web sites with Opera Mini 4 in mind\n", "patentability - Can a system for wirelessly charging a mouse battery be patented?": "\nAs I understand it, your invention would used the fixed magnetic field generated by the magnets to induce a current in the moving mouse.  That strikes me as fundamentally different than this patent publication http://www.google.com/patents/US20090096413, which involves fixed  neodymium magnets in a pad (paragraph [0504]) for charging mobile devices, but only uses the magnets for alligning the receiving coil with the power supply coil.  The device described is a powered charging pad, not a device that generates power only through the motion of the mouse.\n", "patentability - General primer on what's patentable in the United States?": "\nSince you are in the US, I would suggest you start by reading the United States Code, specifically 35 U.S.C. 100-103. You can find the law and some explanations, as well as the upcoming changes, on the website BitLaw, or the website for The United States Patent and Trademark Office.\nThat said the answer will almost always be it depends. You can't patent laws of nature, abstract ideas, physical phenomena, or things that are not useful, or impossible, or even possibly offensive to public morality.\nSo whatever you are trying to patent must be: useful, novel, not obvious, and not anticipated by the prior art. Each of these criteria have been interpreted by US courts over the years to mean particular things, but knowing that those are the general criteria is a good starting point for you.\n", "prior art - How do we check if a patent already exists for our idea?": "\nMost countries provide a search engine for their patent data. Additionally there are third-party search engines for patent data. Most of these will (all the big ones do) search the text of the patents for the supplied terms. Below are some links for the most popular tools. If you are looking for US patents, I would start with Google Patents first to get a sense of what's out there. From there you can get more detailed with the USPTO's site (which has a fairly weighty searching syntax). I don't search for European assets that much, but I generally used Espacenet.\nOfficial:\n\nUnited States Patent Office \nEspacenet (Europe)\nJapan Patent Office\nA few others, just search for \"[country] patent office\"\n\nUnofficial:\n\nGoogle Patents\nGoogle Scholar (combines Google Patents with non-patent literature, e.g., prior art)\nPatent Lens\nFresh Patents\nFreepatentsonline\nBoliven (note: Boliven is somewhat limited for free searching. The last time I used it I was capped at a small amount of searches. Their s\n\nUnofficial (paid):\n\nDelphion\nLexis and Westlaw (subscription based)\n\n", "software - Is it worth patenting something before submitting to the W3C?": "\nThe basic answer to your question is that all parties who submit ideas to a W3C specifications development process agree to license those patents to anyone who creates or uses an implementation of the specification. (The full license is here.) This is simplified a bit, and will depend on how you submit the idea, but that is the basic goal of the policy. \nSo you will not get much (if any) revenue from patenting an idea that you then submit to W3C. If you do file the patent, you can still use it against people who are not implementing the relevant W3C specification, so depending on the nature of the patent you could perhaps use it against competitors to the specification. But that is highly speculative at that point.\nIf your goal is to protect the specification (i.e., you want to support W3C), your best bet is not to file a patent, but rather to provide very good detail on the patentable idea to relevant, public W3C forums as quickly as possible.  Publishing it in this way makes it prior art for future patents as quickly as possible, and would help W3C or supporters of W3C should someone try to later patent the same idea. This is also much cheaper and easier than filing a patent, which is an expensive, multi-year process.\nThis process is known as defensive publication. There are tips for writing good defensive publications at defensivepublications.org (though that site is down right now - I'll update this with better links when I have a chance.)\nNote that this is not the case for all specifications or standards bodies; they all have different rules about this sort of thing. For example some allow for royalties, or some have compliance rules; i.e., only compliant implementations get licenses, so anyone who embraces/extends the specification might be sued.\n", "law - Are examination and re-examination proceedings publicly available?": "\nProsecution and re-exam proceedings (often referred to as \"file wrappers\") are selectively available on Public Pair. There you can search by patent number (e.g., 1,234,567) or publication number (e.g., 20130143080). If the file is available online you'll be able to view the transaction history (e.g, the titles of documents sent back and forth). If the file is newer you'll be able to view the Image File Wrapper (PDFs of all correspondence except for non-patent prior art cited). \nSome patent applications can be held in confidence and not open to inspection. See MPEP §103. The MPEP describes in detail all of the situations where a file wrapper may not be available, but in general, many recent patents/applications are available for free online. Some common situations where you won't be able to view the documents online are if the patent/application is older (usually patent numbers lower than 6,400,000 do not have the full images), the patent is new (is not published yet), or the patent is pending and subject to a secrecy request (not that common, but occurs enough to warrant mention).\nNote that this only discusses methods to get file wrappers for free online. You can always travel to the patent office archives, although I've not met anyone who's done that. \nThere are also some paid services that will get file wrappers that are not available online. I can't speak to the exact cost, but some are rather costly and some are based on the number of pages (which can easily run past 500):\n\nLandon IP\nThomson Reuters\nReedFax\n\n", "Benefits of Software Patents for the software developer (freelancer, companies...)": "\nIf you are a lone software developer, you probably don't need patent rights in order to operate in your business.  In your daily life, the patent won't help in any way. And you may even believe that software patents should be eliminated.  However, since we live in a world where software is largely patentable, there are some reasons why you might want to file for patent rights.  \nLets say that you have a good idea for an interesting solution that you reasonably believe would be really useful and valuable in the marketplace.  Getting a patent on that solution will be something like a stock-option for you.   If it turns out that the market goes in other directions then you have lost your option price (the cost of getting a patent). If, on the other hand, the market goes in your direction then the patent may become much more valuable.  Further, as a lone software developer, you qualify for 50% reduction of most patent fees and in 2013 may qualify for a 75% reduction.   \n", "patentability - Should I patent my idea before posting it on the internet?": "\nGetting a patent is an expensive process that takes several years.  If you wait to get a patent first, then it's likely to be old and irrelevant by the time you post it.  If you're planning on patenting an idea, it's best to not disclose anything about it in public.  Aside from the potential of someone stealing your idea, you risk limiting your ability to patent it later.\nThe U.S. is a 'first to file' system, meaning that someone can steal your idea and file an application before you.  There is a thing called a \"provisional patent application\" that lets you \"lock in\" a submission date for an idea and use the term \"patent pending\".  If you decide to file a full patent application, the date you submitted the provisional application is used as the submission date for the patent.  This can give you more time to put together a full patent application without worrying about someone jumping in and beating you to it.\n", "patentability - Prior art for new treatment for anxiety disorder": "\nThe US reviewer for this patent hasn't actually reviewed it yet - all he's done is issue a notice that the formalities are deficient.  Until you see an office action on this one, you have no idea what the examiner is going to do with it.  It's about due for an action, though - average pendency to first action is usually 2-3 years and this one is right around the 2 year marker.  It may be worth figuring out the new procedures for providing the PTO with prior art, if you're really worried the US examiner won't look at the UK results (they may or may not, depends on the examiner).\n", "patentability - What does \"patent pending\" mean?": "\nPatent pending means that a patent has been filed but not issued.  Filing a patent is expensive serious business and not a flim flam. The notice is there to put potential infringers on notice, like a no trespassing sign.  There isn't any real security in it for the maker because if the patent is rejected it means nothing.\n", "Is there a plan to enable preissuance submissions of prior art directly through this site?": "\nWe are working with the USPTO to enable submission directly from this site. We don't have official commitment yet, but we've been told by the patent office that it will be free. In general I think that the fee is in place mainly to dissuade \"spam\", and that if the USPTO thinks that there's high quality submissions coming from Stack Exchange, they will not charge for them.\nThis is not final, and we will update this answer as the site develops.\n", "search - Should certain concepts be avoided/included when searching for fluid dynamics patents?": "\nI wouldn't consider myself a highly proficient patent-searcher, though I do have some experience. On some patent searches you can explicitly exclude results containing a certain keyword and this can be very useful.\nAnother trick is to deliberately try some more general searches (which may well return 1000's of results) and just have a browse at the first 10 (or a handful of the first 100) and see if you can begin to spot patterns of keywords that start cropping up. This may give you clues to effectively narrow your search.\nHave you already exhausted searches based on the application you have in mind? I'm guessing you may be deliberately looking outside your immediate field?\nAnother line of attack (if you've got a bit of patience) may be to ask your question on an active internet discussion forum on the subject of fluid dynamics, and see if a specialist in the field can give you some hints.\n", "software - How much does US patent law affect international development?": "\nIf a patent is global, how can a company like Apple defend their patents in one country but not in another?\nCurrently, there are no global patents. Apple defends its patents in countries where those patents are granted.\nIf a developer like me lives outside the US but a service I operate has code existing on servers in the US, can I be sued?\nIn terms of copyright if your code (on the US servers) infringes some other code that is protected in the US, then you can be sued. As for software patents, a software patent is not the code as such, it is on how the whole method of computation that goes about on a microprocessor or in other words, the process of  - the algorithm being worked out in the CPU. An example software patent is this.\nHow the US patent system impacts development in a global world, where code moves in and out of US borders as a matter of course.\nAs such, it does not impact (I will abstain from speculating on any bureaucratic issues). One important thing about patents is - they are enforceable only in the country where they are granted. MNCs obtain patents in individual countries. Having said that, I should also point to the unitary patent system being developed in the EU. More about that here. In my opinion it will be very interesting to see how this goes about.\n", "patentability - How patentable are Fine Art products?": "\n\nDoes this fall under the category of a design patent (on a specific rendering / likeness)? Does this instead come under the level of copyright?\n\nIt depends, the work can be protected as a design patent or under copyrights.\n\nDesign patents are for the visual appearance of a product and are intended to be applied for industrial products. More information here. You can apply for a design patent but the disadvantage is, design patents have a limited term.\nAdvantage of copyright protection is, copyright duration in US is 70 years.\n\nSo the author of the work has to choose which one suits him/her best. Another interesting information I came across, thanks to this question, is that, in the US there is a separate provision for design protection it can be found here. I am not much educated on this one, so you will have to check it out.\n", "usd604305 - Which patents were involved in Apple v. Samsung?": "\nList of Patents\nThis appears to be the guts of the billion dollar suite:\n\nPatent Application #US20080168404 \"rubber-banding\" patent: Yes for all devices.\nPatent Application #US20080168384 \n\"pinch-to-zoom\" patent: Yes for all devices except for Intercept\nand Replenish smartphones.\nPatent Application #US20080094368 \"tap-to-zoom\" patent: Yes for Droid Charge, Epic 4G, Exhibit 4G,\nFascinate, Ace, Prevail, Galaxy S, Galaxy S 4G, S II AT&T, i9100, S\nII T-Mobile, Galaxy Tab, Tab 10.1, Infuse 4G, Mesmerize and\nReplenish. No for Captivate, Continuum, Gem, Indulge, Intercept,\nNexus S 4G, Transform, and Vibrant.\nD'667 iPhone design patent: Yes for SEC's Fascinate, Galaxy S, Galaxy\nS 4G, Galaxy S II for AT&T, Galaxy S II i9100, Galaxy S II for\nT-Mobile, Galaxy S II Epic 4G Touch, Skyrocket, Showcase, Infuse 4G,\nMesmerize and Vibrant. No for Ace. Yes for STA's Galaxy S 4G, Galaxy\nS II for T-Mobile, Galaxy S II Epic 4G Touch, Skyrocket, Showcase,\nInfuse 4G, Mesmerize, and Vibrant.\nD'087 iPhone design patent: Yes for SEC's S i9000, Galaxy S 4G, and\nVibrant.  No for Galaxy S II ATT, S II i9100, Epic 4G Touch,\nSkyrocket and Infuse 4G. Yes for STA's S 4G and Vibrant only.\nD'305 iPhone home screen design patent: Yes for SEC's Captivate,\nContinuum, Droid Charge, Epic 4G, Fascinate, Galaxy S i9000, Galaxy S\n4G, Showcase, Gem, Indulge, Infuse 4G, Mesmerize and Vibrant. Yes for\nSTA's Captivate, Continuum, Chrarge, Epic 4G, Fascinate, Galaxy S 4G,\nGem, Indulge, Infuse 4G, Mesmerize and Vibrant.\nD'889 iPad design patent: No for all devices\n\nReferences\n\nApple Insider: Samsung guilty of patent infringement, Apple awarded nearly $1.05B \n\nComment\nGoogle index's US Patents but I couldn't find one for the rounded corners:\nhttps://www.google.com/search?tbo=p&tbm=pts&hl=en&q=inassignee:%22Apple+Inc.%22\n\nIt would depend on how broadly the Patent is written. The main job\n  of a Patent Attorney is to write the application to encompass as much as\n  possible. However I highly doubt it could embody 'any rounded corner\n  on a phone'. It has to be technology, a manufacturing process, a\n  formula & etc - rounded corners would come under a registered design.\n\nIts D '305 patent:\n\nJumping to the user interface, the D '305 patent centers on a grid of\n  rounded square icons against a black background.\n\n", "patentability - To what extent is a Java Off-Heap management patent applicable?": "\nC++ has long supported overriding allocation and deallocation by overriding the 'new' and 'delete' operators -- since 1997 at least (ANSI/ISO C++ 1997/8).\nTo quote from the linked article:\n\noverriding new and delete is a very powerful feature: it gives you tighter control over the language's memory management policy and enables you to extend its functionality in various ways.\n\nSee also link to an 1996 C++ ANSI draft document, specifically to the\nsection 5.3.4 (and bullets therein) describing 'new' statement semantics.\nPersonally, between the years 2008 and 2010 I've been involved with a project that had to manage large amounts of domain objects encoded in specialized data structures on the heap, and kept running into 32-bit limitations.\nThough we couldn't implement it at the time due to unrelated business constraints, it was easy for us to come up on paper with a scheme similar to that described in claim #7: since the encoded domain objects were accessible via domain interfaces, it was possible to store the objects off-heap and still access them transparently via interfaces with slight modifications. At the time I used to equate that concept with overriding 'malloc()' in C -- a common practice.\nClaim #8 describes one way of doing dynamic memory allocation. It's only claim to fame here is in conjunction with claim #7, and by the use of NIO buffers.\nGranted, Java makes it exceedingly difficult to override memory allocation mechanisms for objects. Terracotta's product (BigMemory) was innovative in circumventing those difficulties. However, the underlying concepts here have prior art outside Java.\n", "How long are patent valid? - Ak Patent": "\nOne problem with our patent system is that it is actually somewhat difficult to figure out whether a patent is still in force.  There are a few steps that get usually you to the answer:\n\nIf it is a design patent, then the patent remains in force for 14-years from the patent issue date. Case closed. Edit: Since May 13, 2015, the term for a design patent is 15 years from the issue date. Here is the requisite USPTO page.\n\nThe following steps apply to Utility Patents in the US.  The same rules apply to all utility patents regardless of whether the subject is a software patent or something else. \n\nIf the patent application was filed on or after June 8, 1995, the starting patent term is 20 years. This accounts for the vast majority of patents in force today.  The 20 year term is calculated based upon the priority filing date, not counting provisional application or the original filing in a foreign country.  Patents that issued before the 1995 changeover have a term of 17 years from the patent issuance date.  Patents that were filed before the 1995 date but issued afterwards get the longer of the two terms.\nMost patents issued in the past decade have an added term adjustment (PTA) due to delays in examination at the USPTO.  This adjustment can be found on the face of the patent in terms of the number of days that should be added to the patent term. \nTo stay in force for the entire 20 year term, utility patent owners must pay three maintenance fees.  If one of those fees is not paid then the patent will be seen as expired and no longer enforceable.  Most patentees do not pay all three fees - thus most patents expire before completion of the 20 year term. \nWhen a patent owner has a family of related patents, the USPTO often requires that the patentee file a \"terminal disclaimer\" that (partially) ensures that the patents all expire at the same time.  These terminal disclaimers sometimes impact the patent term, but they can only be found by digging through the file history. \nThere are a few other ways to extend the effective patent term, but most of these are related to pharmaceutical and other medical related patents rather than software. \n\nIf you follow these steps then you'll get to the right answer in the vast majority of cases. \n", "patentability - Are US software patents enforceable in the UK?": "\nBasically patents are territorial grants, that is to say a patent granted in the US is enforceable in the US and cannot be enforced in other countries. To answer your question US entities cannot enforce US software patents or for that matter any US patents in the UK. \nI am certain about this, but back-up and constructive criticism is welcome.\n", "software - How are damages calculated if found guilty of infringement?": "\nThe recent $1 billion verdict in Apple v. Samsung offers a contrast to ordinary patent infringement damages.  In that case, a number of Apple's patents were \"design patent.\" Design patents protection ornamentation (i.e., the interesting shape) of a device rather than technological development that is the province of utility patents. \nBy quirk of history, the design patent law allows a patentee to recover a defendant's profits.  This law is codified at 35 U.S.C. 289 reproduced below.  Thus, in that case, the jury looked to see how much the infringer (Samsung) had made in profits on the infringing devices and then awarded that to Apple.\nIn the case of technology (utility) patents, the patentee may be able to prove its own lost profits caused by the infringement. However, in the vast majority of cases courts (would) rule that lost profit calculations are too speculative and thus the patentee must fall back on proving what would have been a \"reasonable royalty.\"  To calculate a reasonable royalty, the jury is supposed to walk through a \"hypothetical negotiation\" between the patentee and the infringer and predict, at the time when infringement began, what would have been a reasonable payment at that time for a license?\nDamages calculations is extremely inexact.  However, in recent years courts have been pushing parties to provide better evidentiary support to prove their case. \n\n35 U.S.C. 289 Additional remedy for infringement of design patent.\nWhoever during the term of a patent for a design, without license of\n  the owner, (1) applies the patented design, or any colorable imitation\n  thereof, to any article of manufacture for the purpose of sale, or (2)\n  sells or exposes for sale any article of manufacture to which such\n  design or colorable imitation has been applied shall be liable to the\n  owner to the extent of his total profit, but not less than $250,\n  recoverable in any United States district court having jurisdiction of\n  the parties.\nNothing in this section shall prevent, lessen, or impeach any other\n  remedy which an owner of an infringed patent has under the provisions\n  of this title, but he shall not twice recover the profit made from the\n  infringement.\n\n", "patentability - How to torpedo a bad patent my former large employer is filing?": "\nThis is a great question.  First off, patent rights are initially owned by the inventor and are normally only assignable by a written agreement.  In tech companies, developers are normally required to sign such a written agreement when they start their jobs. If that didn't happen, then you still co-own the patent rights.  If you are a co-owner, one thing that you can do is simply announce to the world (perhaps here on this site) that you hereby give a free and open license to use this particular invention.  In patent law, any owner has full rights to give away (or sell) licenses without any recourse to the other parties. You can also cause lots of trouble at the USPTO if you have rights. \nMost likely you signed away your rights in the initial contract. However, it would be important to see the exact language of the contract.  In particular, did you \"promise to assign\" your rights or did you \"hereby assign all rights.\"  The courts have interpreted these two phrases differently, and, with a \"promise to assign\" they still need to obtain a written assignment of rights from you (or a court order) in order to have legal title. \nNow, most of the time the employment agreements also include a promise that the inventor will assist with the filing and prosecution of the patent.  You will be contractually bound to this even after your employment and challenging the patent will be a violation of that promise.  This may be why you use the term \"torpedo\" which suggests some amount of subterfuge. \nCompanies have always had a mechanism for filing patents even when the inventors refused.  Elements of the America Invents Act (AIA) became effective on the 16th of September 2012 make this process even easier.  Thus, the USPTO will not care whether you sign the documents or not.  It is probably worth $1k to the company to get you to sign (rather than just $250) but that is far from $10m. \n[More after a while]\n", "Would software written in a country without software patents constitute prior art in the USA?": "\n\nFirst, there are software patents in Europe. In fact with the new US cases on patentable subject matter issues, patent attorneys have told me that in many cases it is easier to get a software patent in Europe than in the US. \nTo answer your question - prior art can come from anywhere around the world and be used to invalidate a US patent or prevent issuance of a US patent application.  We have a change in the law in the US to make non-US information easier to use to invalidate US patents.  However, this change will only apply to patents and patent applications originally filed on or after March 16, 2013. \nUnder both the old and new law, if you write some software but then keep that software totally secret and hidden within your corporate (or home) walls then it will not count as prior art. This is because the usual touchstone for defining prior art is its public accessibility. \n\nCurrent U.S. law codified in 35 U.S.C. 102 identifies the available foreign sources of prior art as items \"patented or described in a printed publication in this or a foreign country.\"  Under the new law being implemented in 2013, US patents will also be invalidated by prior foreign public uses, sales, and offers for sale.\nSo, lets say you have an unpatented computer algorithm developed in Germany and the question is whether that program can be used as prior art against a US patent.  The answer is maybe, depending upon what has been done with the algorithm.  \n\nHas the alogorithm (or a write-up of how it works) been published in some way? (internet counts, as does a video, as does a poster at an academic conference, ...)\nHas the alogorithm been sold or transferred to folks in the US or publicly used in the US?\nDid the US patentee get the idea from you? \n\nIf the answer to any of these questions is \"yes\" then the algorithm [or publication] can work as prior art against the US application.  Otherwise, the answer is probably no. Under the new law, it might also count as prior art if publicly used or sold anywhere in the world. \n", "filing - USPTO examiner/staff financial background check and disclaimers": "\nThe patent examiners are required to adhere to strict ethics codes (PDF warning) put forth by the Department of Commerce.\nAs a part of this examiner's of a particular grade must supply the following (page 12 of the PDF):\n\nIf you are designated as required to file such a report, please keep in mind that the \n  information you disclose is used to provide advice to you to help ensure that you do not \n  inadvertently engage in prohibited activities.  To provide this advice (and to certify that \n  the report includes all necessary information), it is important that the information you \n  provide be as complete as possible.  Specifically, please be sure to include:\n  - the full name of any mutual fund (not just the generic name of the company managing \n  the fund);\n  - specific holdings in any IRA, 401(k) account, trust, or investment account (other than \n  broadly-diversified mutual funds, if you file a confidential report (OGE Form 450));\n  - short description of the activities or industry sector of any privately-held company or \n  limited partnership; and\n  - assets and sources of income of your spouse and dependent children\n\nMore specific details from page 10:\n\nYou cannot participate as a Government official in a matter that will have \n  a direct and predictable effect on your financial interests; on the financial interests of \n  your spouse, minor children, household members, general partners, outside employers, \n  or prospective employers; or on the financial interests of an organization in which you \n  serve as a trustee, officer, or board member.  This includes a matter that affects a \n  company in which you own stock.  Note that for patent examiners, the disqualification \n  applies not only if you own stock in a company seeking a patent, but if you own stock in \n  a company making devices similar to those for which a patent is sought.  Thus, you \n  should not own stock in any company making devices covered by your Art Unit, unless \n  you restrict your interests to those that will be covered by the exceptions listed below.\n  Exceptions to the General Rule: Exceptions permit you to participate in matters \n  affecting a financial interest if the financial interest is:\n  -  in a publicly-traded diversified mutual fund; \n  -  less than $50,000 in a publicly-traded \n  “sector-specific fund” (a fund that focuses on a \n  specific industry, foreign country, or state);\n  -  a publicly-traded stock or bond holding of $15,000 \n  or less in a company;\n  -  a publicly-traded stock or bond holding of $25,000 \n  or less in a company (which allows participation in \n  broad policy matters affecting the company as a \n  member of a group or industry sector (if total \n  investments in the group/industry sector are \n  $50,000 or less), but not matters affecting the \n  company individually); or\n  -  covered by a conflict of interest waiver (which are generally available only for \n  employees serving overseas or in unusual circumstances—contact the Ethics Law and \n  Programs Division at 202-482-5384 for information on waivers).\n\n", "patentability - Can software be patented after being made public?": "\nIn the United States, for any invention you have 1 year to file:\n\n35 U.S.C. 102   Conditions for patentability; novelty and loss of right to patent.\n  A person shall be entitled to a patent unless —\n(b) the invention was patented or described in a printed publication in this or a foreign country or in public use or on sale in this country, more than one year prior to the date of the application for patent in the United States\n\n", "law - How can I best aid in keeping the patents system at bay?": "\nThere are a few organizations out there whose goal it is to prevent some of the potential abuses you mention. You could get involved with those organizations by donating time and/or money. For example, see the following links:\nElectronic Frontier Foundation\nPublic Patent Foundation\nOther organizations use crowdsourcing to uncover prior art, including the website you're on right now (i.e., Ask Patents), as well as Article One Partners.  You can donate time in the form of research and submissions to further the projects on these websites.  While the goal of these websites is not necessarily to curb patent abuses, these types of crowdsourcing websites certainly have the potential, through the collective action of numerous individuals, to have a collateral impact on reining in patent abuses.\nMoreover, provisions of the America Invents Act (AIA) allows third parties to submit prior art in pending patent applications (see 35 USC 122(e)).  This way you can submit prior art and a concise explanation of its relevance to the patent office, thus aiding the examiner in doing his/her job.  \nAdditionally, under the AIA a third party may also initiate Inter Partes Review or Post Grant Review proceedings (see here) with respect to a patent, which proceedings allow the third party to challenge the validity of the patent.\n", "patentability - The SPDY protocol is not patented. Could it have been? Is there prior art?": "\nWe wanted to make sure the protocol was as widely deployable as possible.  We knew that patents are encumbrances on technology adoption, so of course we didn't want patents at all.  Further, we knew the rules of the standards bodies, and that if the protocol ever were to be adopted, patents are just a headache and a barrier.\nGiven these goals - patenting SPDY or holding back the IP would have been a horrific mistake.\nAs an example, consider the FAST TCP Congestion Avoidance protocol for TCP .  It's generally well regarded as a promising and potentially better algorithm than what is used today.  But it's patented.  So nobody uses it.  It's not \"better enough\" to overcome the obstacles of the restricted IP.\n", "prior art - Here is what I see as an invalid patent. US6563040": "\nFor the moment, I'm going to ignore the possibility that their patent actually covers something significantly different than your tracker, and just deal with the matter of dates.\nThey have 1 year following the invention within which to file the patent, so your invention would need to predate the patent by at least 1 year to qualify as statutory prior art.\nAs it stands right now, your invention might be prior art, but then again, it might not be. The question would come down to who actually invented it first. In most cases, that's translated as \"who actually reduced it to practice first\". For example if you had lab notes (or similar) showing when you'd first gotten your invention to work, that would be the crucial date. Obviously it must have worked for at least some short period of time before you demonstrated it. If you could show that it was more than 8 months before you demonstrated it (i.e., more than one year before they filed for their patent) then it would clearly invalidate their patent.\nJust for the sake of argument, let's assume you had your device working 2 months before you showed it, so it predated their filing by six months. To show their patent was valid, they'd have to show that they invented it during the (approximately) six month period starting from a year before they filed, and ending the day you invented your tracker. Their patent could/would be valid if and only if they could show it was invented during that window.\nIn other words, what you've shown isn't necessarily enough to prove their patent is invalid. Without knowing the exact history of their claimed invention, and how long before filing they invented it, it's impossible to say whether the patent is valid or not.\n", "law - Patent agreements, over-charging & consumer protection (Microsoft \"Android tax\")": "\nLet me summarize what I see as your contentions to support this case.\nYou contend:\n\n... that cell phone vendors are paying Microsoft\n... how much that is\n... that it's affecting the price you pay for a phone\n... that it's to license patents\n... that those patents are invalid\n\nThe US Federal (civil) courts operate under the Federal Rules of Civil Procedure. Rule 11 states (in part):\n\n(3) the factual contentions have evidentiary support or, if specifically so identified, will likely have evidentiary support after a reasonable opportunity for further  investigation or discovery;\n\nNow, as far as I can see, you don't have factual support for any of those contentions, nor do you have some sort of indirect/circumstantial evidence that a court would be likely to accept as reason to give you an opportunity for further investigation or discovery.\nWorse, even if you had factual support for all those contentions, I'm not sure you'd really have a case. Even if the patents really are invalid, if they've been issued, Microsoft has a right to presume that they are valid -- and, in fact, courts are legally required to give any issued patent a presumption of validity as well.\nLikewise, the cell phone vendors presuming those patents are valid is perfectly reasonable (since the courts are required to grant that presumption, it would be pretty ridiculous for them to blame companies for doing the same).\nAs such, it appears to me that to have any real case, you'd have to also contend that Microsoft knew their patents were invalid before they negotiated the contract, but decided to carry forward anyway. Unless you could show something on the order of evidence that Microsoft had bribed a patent examiner to get a patent approved, I can hardly imagine how you'd be able to support such a contention.\nThe problem here is that validity of a patent is a legal question, so essentially the only opinion that can possibly carry any weight in the matter is that of a court or at least an attorney. First of all, I can hardly imagine an attorney being stupid enough to say such a thing, even if it reflected his honest opinion. Second, if one of Microsoft's attorney's had told them such a thing, it would almost certainly fall under attorney-client privilege, so getting it admitted as evidence would be next to impossible anyway.\nAs such, essentially the only way I can see that you could show wrong-doing on anybody's part would be if you could show something like Microsoft having litigated the patent(s) in question previously, and either the claims based on those patents had been dismissed with prejudice, or else the jury in the previous case had found the patents invalid.\nRight now, however, it seems to me that:\n\nyou don't have evidence to support your allegations\neven if you did, it's unlikely they would support a law suit\nallegations to support a suit can't be supported\n\nBottom line: Unless you have a lot more than you've posted, I can hardly imagine how even the best, brightest, most skillful attorney in the world could turn this into a real case that should really succeed in court.\n", "software - What should I know before using \"Patent Pending\" in my products/ website?": "\n\nDoes this still stand?\n\nYes. Deceptive use of 'patent pending' is an offense.\n\nMore here from USPTO\nAnd more here from UK IP Office\n\n\nIf I put a Patent Pending notice in a product do I have to describe it in the product?\n\nNot required. But you have to mention the patent application number and the country where the patent is applied for. UK information here.\n\nCan I just have a link to a description?\n\nIf you have already applied for a patent, yes you can have a webpage with a small description (use discretion).\n\nWhat care do I need?\n\nAfter going through web-resources especially Patent Office websites you can seek professional advice if you have further queries or you just want to be that extra sure.\n"}