{"air traffic control - What does it mean when the controller uses the word \"request\"?": "\nIn civil aviation the ICAO standard phraseology should be used. This phraseology is described in ICAO document 9432.\nAccording to the definition in Doc 9432, Chapter 2, section 6, the word request means: \"I should like to know ...\" or \"I wish to obtain ...\".\nIt is used for example by pilots to ask for a clearance to climb to an altitude (e.g. request flight level 360).\nThe standard ICAO phraseology is to use the word report in the first example in your question.\nAccording to the definition in Doc 9432, it means: \"Pass me the following information ...\"\n\n[callsign] report heading\n\nThe second phrase quoted in your question is even stranger. QNE is the standard pressure altimetry setting of 1013.25 Hectopascal (29.92 inches of mercury in the US). When an altimeter is set to standard pressure, the normal way of reporting the altitude is in Flight Levels. So in this case the standard phraseology should have been\n\n[callsign] report Flight Level.\n\n", "air traffic control - Should you wait to switch to the ground frequency until after crossing a runway?": "\nRemember that active runways are always the jurisdiction of the local (tower) controller. Even if a ground controller tells you to cross a runway, they have to clear it with the local controller next to them. So generally you switch frequencies when you have finished crossing the runway unless told otherwise.\nI can tell you this is exactly how it works in Boise, Idaho where there are the parallels 10/28 L/R.\nHowever, if you are unsure of any instructions a controller gives you, the basic rule is: ask. The tower controller won't mind, and will typically appreciate the clarification. Just read back the crossing instruction as normal, then ask.\n\nRight on E, cross 27 R, contact ground .9, N12345, and should I contact ground on the other side of 27R or immediately?\n\n", "air traffic control - How do I \"sightsee\" in a class Bravo airspace?": "\nJust call up ATC on the approach frequency and request flight following to see the location you're interested in.  They'll assign you a transponder code and any restrictions.  For example:\n\nN12345: \"Houston approach, VFR request for Cessna 12345\"\nHouston TRACON: \"Cessna 345, say request\"\nN12345: \"Cessna 12345 is at 1200 ft, 3 miles south of Houston Executive, requesting flight following to overfly the Greenway Plaza area for sightseeing, aircraft type is a Charlie 172 slant Golf.\"\nHouston TRACON: \"Cessna 345, squawk 4123.\"\nN12345: \"squawk 4123 for Cessna 345\"\nHouston TRACON: \"Cessna 345, radar contact. Cleared into Bravo, maintain at or below 3,500, remain north of the University, advise when your sightseeing is complete.\"\nN12345: \"Cessna 345 is cleared into Bravo. Will remain at or below 3,500 and north of the University. Will advise when complete.\"\n\nNotice that it is preferred that you don't give your entire VFR request in the initial callup to avoid overwhelming the controllers if they're busy or not yet prepared to copy your entire request.\nJust ask for \"VFR request\" with your callsign and wait for them to ask for the details.\n", "cg - Why would a Cessna 182T not enter a stall?": "\nI think this is more common than you might think in a C182. The 182 is much more nose-heavy than a 172 (which is particularly noticeable in the flare) and this seems to limit the amount of upward pitch authority the elevator has at low speeds. The only stalls I've done in a 182 are much as you described - you can hold full back-elevator and you just sort of sit there sinking.\nSpinning could be an issue if it becomes uncoordinated, but a 182 is a very stable airplane and unlikely to enter a flat spin unless the CG is beyond the aft limit or severely uncoordinated. Perhaps someone else can weigh in further on that possibility, though.\n", "faa regulations - I just flew into class B airspace without a clearance, what should I do now?": "\nWhile still in the airspace, you should contact the controller if you can, since it may be important to safety.\nAfter landing, you may get the dreaded phone number from a controller (probably tower or ground) which you're supposed to call and speak with someone from the FAA. You should not volunteer any information about the incident during this call without talking to a lawyer or AOPA legal services first.\nThen, most importantly, fill out a report in the Aviation Safety Reporting System. Any information you submit will not be used against you in an enforcement action by the FAA, and in many cases, people who volunteer information through the system receive much softer treatment, and sometimes forgo enforcement all together.\nThe reason the FAA incentivizes this self-reporting is so they can better collect information about accidents which inevitably happen. If they know why you accidentally strayed into the bravo, maybe they can improve procedures or charts to help keep other pilots from making the same mistakes.\n", "logging - Should I log flight time as a passenger?": "\nNo, you should not*. \nIn my opinion, you should limit your logbook to records of your own flight experience. This would include any time spent training, as PIC, or as required crew.\nThe time you can log as PIC is that which you spend as the sole manipulator of the controls, the sole occupant, or as the pilot in command when the required crew is >1. Here's an article from an FAA FSDO describing the logging of PIC time in more detail. Rod Machado has some good coverage of this as well.\nIf you're just hanging out in the airplane, it doesn't matter if you're in the front seat or the back seat. If you're receiving instruction, you should get an entry and a logbook endorsement from the instructor you're flying with. Most General Aviation aircraft don't require a type rating, so I'm unsure what the context of your final question is.\n \n* It's worth noting that you can technically put whatever you want in your logbook, though it's not a great idea; when it comes time to fill out an FAA 8710 form for later ratings, it can get confusing. In my opinion, you still shouldn't log any time, but if you're just wanting to record flights that you took with friends, that's fine. As an instructor who's had to slog through some weird logbooks, I'd really, really encourage you to track that elsewhere, though. Your logbook is exactly that - it's your logbook, for the logging of your flight time, and a record of your flight experience and training.\n", "faa regulations - Is collaring a circuit breaker considered deactivation by the FAA?": "\nBased on this Advisory Circular, the answer is yes.\n\ng. Deactivation means to make a piece of equipment or an instrument unusable to the pilot/crew by preventing its operation\n\nCollaring the circuit breaker prevents it from being pushed in, and therefore prevents its operation.\n", "What can I do as a bystander on the ground if I see an aircraft above me that appears to be failing?": "\nHonestly, very little.\nFirst, be clear as to whether you are actually see something failing. If you see flames, or a wing has broken off, then yes, it's a problem. However, if you see someone doing a slow spiral towards an empty field with the power idling, they're more likely to be practicing engine out procedures (something that's required for all US pilots to practice and demonstrate during their checkride for their certificate). \nIn the event that you actually see an impact, fire, off-airport landing and so on, call 911 and give them your location. They'll send the appropriate crews. \nOtherwise, if the aircraft is still flying, there's a strong chance the pilot(s) are already talking to ATC about their problem, if it actually exists. There's nothing you really can or need to do in this case.\nQuick Anecdote: I've been told the story of a local police department who gets phone calls virtually every time a citizen lands his small airplane in his private field. Fire/police/medics/etc are summoned, when absolutely nothing bad has happened. This is why you should make an attempt to verify that a problem actually exists before reporting it.\n", "faa regulations - What are the FAA sport-pilot self-certification standards?": "\nUnless the pilot has had their certificate revoked or suspended by the FAA for their medical condition or has failed an application for a medical certificate1, they would probably be fine after seeing a physician. FAR 61.23(c)(2) states that sport pilots using a driver's license to satisfy medical requirements must:\n\n(ii) Have been found eligible for the issuance of at least a third-class airman medical certificate at the time of his or her most recent application (if the person has applied for a medical certificate);\n(iii) Not have had his or her most recently issued medical certificate (if the person has held a medical certificate) suspended or revoked or most recent Authorization for a Special Issuance of a Medical Certificate withdrawn; and\n(iv) Not know or have reason to know of any medical condition that would make that person unable to operate a light-sport aircraft in a safe manner.\n\nIf the holder has a valid US driver's license, it would (presumably) be taken upon the certificate holder to have \"reason to know\" by virtue of having a checkup with a physician to check that this condition does not affect their ability to fly safely, especially if the person involved was in any sort of doubt as to their medical condition.\nHowever, if they have had a checkup with a physician that finds no particular issues, and that condition does not affect the validity of their driver's license, they should be fine.\n1: By section (ii), the pilot must still have a medical test and pass for at least a Class 3 medical certificate, if the FAA has revoked or found unsatisfactory their previous medical under a Class 1 or Class 2 certificate.\n", "faa regulations - What does a sport pilot have to do to get a private pilot certificate in the US?": "\nIf you hold a Sport Pilot certificate and are looking to upgrade it to a Private Pilot certificate, your best bet is to use the requirements of Part 61 Subpart E. All of the flight time you logged earning a Sport Pilot certificate applies towards Private, but additional hours and types of flight time need to be logged.  The training you received in the same category and class (eg Airplane, Single Engine) applies per §61.109(l) because you hold a Sport Pilot certificate.\nThe requirements for each are paraphrased below. You'd have to log the difference, which is a minimum of 20 hours, including another 5 hours of dual and 5 hours of solo. There's a lot more to it than what I reference below, but this is the basics.\nHow much of the training will have to be re-done? This should vary wildly from pilot to pilot. You'll need to redo training as required to meet standards. If you're transitioning right away, theoretically none, but it's likely that some retraining will be required.\nDoes it depend on the type of your flight instructor's certificate? Yes, in concert with your accomplishment level.  If the instructor has only a CFI-S (Sport) certificate, none of the dual instruction hours are able to be counted for the private pilot dual hours criteria unless you have your Sport Pilot certificate. If the instructor had a CFI-A (Airplane) certificate, the dual hours earned for your sport pilot certificate will also count toward the dual hour requirements of the private pilot certificate.\nSee the Kern INK Interpretation\nRequired for Sport (citation)\n\n20 hours of flight time, including at least:\n15 hours of flight training from an authorized instructor and at least:\n5 hours of solo flight training in the areas of operation listed in §61.311\n\nRequired for Private (citation)\n\n40 hours of flight time that includes at least:\n20 hours of flight training from an authorized instructor and:\n10 hours of solo flight training in the areas of operation listed in §61.107(b)(1)\n\nIf you've chosen a flight school that operates a Part 141 program, you get to do it all over. Hooray!\n", "unpowered - How can I estimate the minimum runway needed to take off with a hang glider?": "\nWhat you need is enough lift to remain in the air. For that, the maximum lift of your hang glider needs to exceed the total weight. \nWhen you know the total weight of the glider (you included), you can derive the theoretical minimum airspeed from the lift formula:\n$$L_{max}=\\frac12{\\rho}V^2C_{max}S$$\n$$V_{min}=\\sqrt{\\frac{2W}{{\\rho}C_{max}S}}$$\nWhere:\n\n$L$ = lift\n$\\rho$ = air density\n$V$ = air speed\n$C_{max}$ = maximum lift coefficient\n$S$ = wing surface\n$W$ = weight\n\n\nNow you have to know your maximum lift coefficient. Suppose this is 1.2, and for safety and initial manoeuvring, let's add a margin of 40% to the weight.\nLet's say your mass is 85 kg, and the glider has a mass of 35 kg. The total weight would be 120 kg — that is about 1,177N weight, which for the sake of safety margin is increased to 1,650N.\nI'll estimate the surface of the wing to be $16m^2$. Assume a normal day, the air density will be about $1.225kg/m^3$.\nFilling in the numbers is the formula:\n$$V_{min}=\\sqrt{\\frac{2\\times1650}{1.225\\times1.2\\times16}}\\approx 12 \\textrm{ m/s}$$\nAny wind speed you get you can subtract from this figure: what is left you have to achieve by pushing, running or diving.\n", "faa regulations - What's the difference between FAA Part 61 and Part 141 training?": "\nThere's no singular right answer, it's up to the individual and how he or she learns best. The biggest difference between the two you'll find is that part 141 schools are always very structured in their training regiment. That is not to say part 61 isn't (nor does it imply that it's better for everyone), it's just that part 61 does things according to what they wish with less FAA oversight.\nYou might know that under part 141, the earliest you can get your ticket is 35 hours, while part 61 requires a minimum of 40 hours. Don't let that red herring influence you; almost everyone takes more than 40 hours regardless of the school type.\n", "Where can I find regulations in different countries for flight level rules based on direction of flight?": "\nEvery country's Civil Aviation Authority issues an Aeronautical Information Publication (AIP) as part of their Aeronautical Information Services (AIS) which contains the information you are looking for. Most likely the information about Flight Level rules will be contained in the GEN (General) or ENR (En-Route) section. For Europe, most information from the AIP's can be found through the European AIS Database\n", "faa regulations - What are the requirements to convert an FAA certificate to EASA/JAA?": "\nAs @Pondlife states, this will depend on each member state's implementation of the EASA rules but I would expect that the implementations would be similar -- otherwise what is the point of EASA?  (That would be a good question except it would no doubt be closed as being too \"opinion based\".)\nI've added a link to the relevant UK documentation and marked this as a Community Wiki answer so that hopefully others can expand on this for other states and perhaps add personal experiences.\nUK\nCAP 804 Section 4, Part Q deals with \"Validation and Conversion of Non-EASA licences issued by States other than the UK\".\n", "faa regulations - How do FAR 23 takeoff requirements compare to FAR 25 requirements?": "\nThe single biggest difference is that FAR 25 has rules that pertain to wet runways. Aside from that, FAR 25.113(a) uses the greater of two tests to determine accelerate-stop distance:\n\n(1) Accelerate to $V_{EF}$, then reject the takeoff\n(2) Accelerate to the highest speed required for takeoff (somewhat unclear?), then reject the takeoff\n\n...while 23.55(a) is more or less equivalent to 25.113(a)(1).\nComparing the three methods, the rules are mostly comparable. The only major difference is that under Part 25 \"a distance equivalent to 2 seconds at the $V_1$ for takeoff from a dry runway\" (25.113a.1.iv and 25.113a.2.iii) must be added to the other factors. \nBecause aircraft certified under Part 25 must use the greater of two different tests and add a distance equivalent to 2 seconds at $V_1$, accelerate-stop distances will likely be greater than for Part 23-certified designs that are otherwise similar.\n\nFor reference:\n\nFAR 23.55(a)\nFAR 25.113(a)\n\n", "air traffic control - What is the cause of unusually strong wake turbulence from the 757?": "\nMy understanding, primarily based on this archived NASA document (also linked to on the B757 Wikipedia article), is that there were several issues leading to the decision to make the 757 a special case.\nFirst, there were some notable accidents where witnesses seemed to indicate the cause was 757 wake turbulence.\nCessna Citation - December 18, 1992 - Billings, Montana\n\nWitnesses reported that the airplane suddenly and rapidly rolled left and then contacted the ground while in a near-vertical dive. Recorded ATC radar data showed that, at the point of upset, the Citation was about 2.8 nmi behind a Boeing 757 and on a flight path that was about 300 ft below the flight path of the 757.\n\nIAI Westwind - December 15, 1993 - Santa Ana, California\n\nwitnesses reported that the airplane rolled abruptly and that the onset of the event was sudden. The Westwind was about 2.1 nmi behind a Boeing 757 and on a flight path that was about 400 ft below the flight path of the 757.\n\nAdditional accidents were noted with a Cessna 182, MD-88, and a Boeing 737.\nSecond, there were some controversial NOAA flyby tests which showed:\n\nfor a peculiar set of weather conditions that lasted about 0.5 hour, the vortex velocity of the 757 was approximately 50 percent higher than that of the 767 at similar vortex ages (younger than 60 sec) measured in less favorable weather conditions. However, the results also showed that overall the wake of the 757 decayed faster than that of the 767; in fact, the wake behaved as would be expected for an aircraft of the size and weight of the 757.\n\nThird, they felt the slower approach speed of the 757 (vs. similar aircraft) made it more likely that trailing aircraft would inadvertently close the separation gap during approach.\n\nUltimately, I believe the correct answer to your question is actually that there is nothing particularly special about the B757 in regards to wake turbulence. This Air&Space Magazine Article indicates that\n\nBoeing maintains that there is nothing about the wing design that would cause wake turbulence.\n\nand\n\n\"The wake from the 757 is no stronger or weaker than you would predict from the weight, span, and speed of the airplane,\" agrees NASA's David Hinton, who has taken wake measurements at airports around the country and is principal investigator of NASA's NextGen Airportal Project.\n\nThe decision to put the 757 in its own category was controversial at the time and not based on particularly strong evidence. It was done out of precaution due to anecdotal evidence and possibly flawed test results. On the other hand, you could argue that ATC erring on the side of caution is best if there is any doubt. To be fair, a 757 is on the larger side of the small category.\n", "e6b - What is the difference between planned true airspeed and actual true airspeed?": "\nFrom the manual for an electronic E6B which seems to be similar to yours:\n\nPLANNED TRUE AIRSPEED\nThis function is used to calculate true airspeed for preflight \n  planning. It will compute the true airspeed in knots and Mach  number\n  and density altitude, given the pressure altitude,  temperature, and\n  calibrated airspeed in knots.\n\nand \n\nACTUAL TRUE AIRSPEED \nThis function calculates true airspeed, Mach number and  density\n  altitude given pressure altitude, indicated temperature  in Celsius\n  and calibrated airspeed.\n\nThe manual doesn't give any more information on the difference between the two calculations so we can only guess...\nBoth methods use pressure altitude and calibrated airspeed. One clue is that the \"planned\" version uses \"temperature\", while the \"actual\" version uses \"indicated temperature\".\nSo my guess is:\n\nyou use the \"actual\" version in flight, and it expects you to input Total Air Temperature (TAT), read from the gauge in the airplane, which it then converts to Outside Air Temperature (OAT) to do the density altitude and true airspeed calculation. \nYou use the \"planned\" version for flight planning, where the temperature you have available is the OAT.\n\nThe TAT is the OAT plus the rise in temperature due to the air being brought to rest relative to the airplane. \nSince the TAT is a bit higher than the OAT, the \"actual\" version should give slightly lower density altitude and a slightly lower true airspeed.\n", "safety - Are there benefits to opening a flight plan if I'm flying over populated areas?": "\nAccording to the AIM section 5-1-4, the main reason is search and rescue:\n\nb. It is strongly recommended that a flight plan (for a VFR flight) be\n  filed with an FAA FSS. This will ensure that you receive VFR Search\n  and Rescue Protection.\n\nSo the question becomes, does search and rescue have value in populated areas? I would say that - excluding large cities - populated areas are actually not very densely populated at all (relatively speaking), and there is a very good chance that no one will see your aircraft come down or even react if they do. You might be flying at night, or no one may be looking in the right direction, or they may assume you're landing at a private strip or doing cropdusting or whatever.\nAnd even when an aircraft is known to be down in a specific area, it's often very hard to find it - especially if you land in trees - so anything you can do to narrow down the search area is important. An AOPA safety video (I forget which one) mentioned an incident where a helicopter went down less than a mile from a runway threshold at a class B airport and it still took 24 hours to locate it (the details may be different, but you get the idea).\n", "asos - What is the difference between the various automated airport weather observing systems?": "\nASOS is basically a replacement for AWOS with more reporting parameters, and the first units were installed in 1991.  According to the Automated airport weather station Wikipedia page, each different type has the following parameters:\nAWOS \n\n\nAWOS A: barometric pressure and altimeter setting (in inches of    Mercury). \nAWOS I: wind speed and wind gusts (in knots), wind    direction (from which the wind is blowing) and variable wind    direction (in\n  degrees of the compass), temperature and dew point (in    degrees\n  Celsius), altimeter setting and density altitude. \nAWOS II:    all AWOS I parameters, plus visibility and variable visibility (in    miles). \nAWOS III: all AWOS II parameters, plus sky condition (in    oktas), cloud ceiling height (in feet), and liquid precipitation\n  accumulation (in inches). \nAWOS III P: all AWOS III parameters, plus    precipitation type (rain, snow and sometimes drizzle) identification.\nAWOS III T: all AWOS III parameters, plus thunderstorm detection (via    a cloud-to-ground lightning detector). \nAWOS III P/T: all AWOS III    parameters, plus precipitation type identification and thunderstorm    detection. \nAWOS IV Z: all AWOS III P/T parameters, plus freezing rain    detection via a freezing rain sensor (Note: this configuration used\n  to be called AWOS III PTZ). \nAWOS IV R: all AWOS III P/T parameters,    plus runway surface condition. \nAWOS IV Z/R: all AWOS III P/T    parameters, plus freezing rain detection and runway surface    condition.\n\n\nASOS \n\nThey generally report all the parameters of the AWOS-III, while also\n  having the additional capabilities of reporting temperature and dew\n  point in degrees Fahrenheit, present weather, icing, lightning, sea\n  level pressure and precipitation accumulation.\n\n", "us cbp - What is the difference between a private and a commercial flight according to the US Customs and Border Protection?": "\nAccording to the CBP eAPIS FAQ, this definition is in 19 CFR 122.1:\n\n(d) Commercial aircraft. A “commercial aircraft” is any aircraft\n  transporting passengers and/or cargo for some payment or other\n  consideration, including money or services rendered.\n[...]\n(h) Private aircraft. A “private aircraft” is any aircraft engaged in\n  a personal or business flight to or from the U.S. which is not:\n(1) Carrying passengers and/or cargo for commercial purposes;\n(2) Leaving the U.S. carrying neither passengers nor cargo in order to\n  lade passengers and/or cargo in a foreign area for commercial\n  purposes; or\n(3) Returning to the U.S. carrying neither passengers nor cargo in\n  ballast after leaving with passengers and/or cargo for commercial\n  purposes;\n\n", "aerodynamics - Is a rotary wing craft capable of supersonic flight?": "\nCurrently there is no rotary wing craft capable of supersonic flight. \nCombined with the forward motion through the air, the rotating blades attack the air on one side and retreat backwards on the other.  As the aircraft moves faster this poses 2 problems:\n\nThe retreating blade has a point of zero air speed, starting from the axis at hover and moving to the tip with forward speed, an effect known as P-factor.  Eventually a large portion of the blade has negative airflow (backwards to what it had when hovering) causing loss of lift control on that side (there may still be lift, but the pitch of the blade has little influence). The craft will roll (and I believe gyro forces will bring the pitch up, and the craft will recover)\nThe advancing blade will go supersonic, starting from the tip. Aerodynamics change.\n\nThere are ideas of new blade actuators that can change the blade for 1) reverse airspeed and 2) supersonic aerodynamics.  As you have noticed, nothing has panned out so far...\n", "iacc - What is required to fly over Cuba enroute to another country?": "\nThe IACC navigation fees are approximately $170 for a small jet, plus there is a service fee to issue. There is a full list at World Air Operations and you can in fact order the permit for Cuba online there too. \n", "us cbp - How does a US registered pilot obtain approval to fly to Cuba?": "\nTo obtain approval to fly to Cuba you must first sumbit an application for an OFAC (Office of Foreign Assets Control) License through their Cuba Travel website or by mail:\n\nOffice of Foreign Assets Control\nU.S. Department of the Treasury\nTreasury Annex\n1500 Pennsylvania Avenue, NW\nWashington, DC 20220\n\nOnce you have your OFAC license, that completes your US legal requirements, as far as I'm aware.* There are other requirements that you have to fulfill to receive a Cuban visa upon entering, but since you have asked about obtaining US approval I haven't looked into that in detail.\nFor the record, this is the same method that anyone would use to travel to Cuba. Pilots flying to Cuba must ensure that all their passengers also have their own individual OFAC license.\n\n* I am not a lawyer. Please do not consider this to be legal advice. I would recommend calling OFAC and inquiring for further help with the process.\n\nSources:\n\nCuba: What You Need To Know About U.S. Sanctions Against Cuba - OFAC\nOFAC Contact Info\n\n", "us cbp - What are the US Customs requirements upon returning to the US after pre-clearing customs in the US Virgin Islands?": "\nYou're required to notify and clear customs if you land in the 50 U.S. states or Puerto Rico from the U.S. Virgin Islands, even though the U.S. Virgin Islands is part of the U.S.\n\"All private aircraft arriving in the United States via the Gulf of Mexico or the Atlantic\nCoast from a foreign location in the Western Hemisphere south of 30 degrees north\nlatitude, or from any place in Mexico or from the U.S. Virgin Islands, shall also furnish a\nnotice of intended arrival. Such aircraft must then land for inspection at the nearest\ndesignated airport unless an overflight exemption has been granted under Section\n122.25 of the Customs Regulations.\"\n", "iaps - What is a Simultaneous Offset Instrument Approach (SOIA)?": "\nSOIA (Simultaneous Offset Instrument Approaches) allow airports with parallel runways that are 750 to 3000 feet apart to conduct (almost) simultaneous approaches to the two runways. At an airport, one runway uses the ILS PRM approach, while the other runway uses an offset LDA PRM approach (with glideslope). SOIA refers to the LDA PRM approach, where another aircraft is flying the ILS PRM approach ahead. PRM stands for Precision Runway Monitor, which is a high-update radar system allowing for \"equivalent\" safety with reduced margins.\nFor a PRM approach is conducted, there must be two frequencies per runway:\n\na primary frequency for both the transmission and receipt of instructions\na \"monitor\" frequency, only for ATC to transmit on\n\nThe reason for the \"monitor\" frequency is just in case the primary frequency is blocked and breakout instructions have to be provided. The tower controller will communicate to aircraft on both frequencies, both in normal PRM operations and when providing breakout instructions.\nThere is also a \"monitor\" controller that ensures that the two aircraft never get dangerously close together -- if such a situation occurs, the \"monitor\" controller overrides the tower controller on both frequencies to allow for immediate breakout instructions to be given.\nOf the two approaches, the more interesting of the two is the offset LDA PRM approach. In the LDA PRM approach, aircraft fly an approach course that is 2.5 to 3 degrees offset from the runway heading, following the glideslope until the MAP (this course does not meet up with the runway threshold), at which point the pilot should proceed visually to the runway.\n\nThe MAP on a LDA PRM approach is 3000 feet away from the ILS approach course, meaning aircraft have to manoeuvre towards the extended runway centreline to be stable by 500 feet -- the less spacing between the two runways, the more aircraft will have to turn. This does mean that it is less suitable to larger aircraft, due to the manoeuvring required at higher speeds (than other aircraft), though most SOIA approaches are designed for larger aircraft as well. Before reaching the MAP, the pilot must have have:\n\nthe runway in sight;\nthe aircraft on the adjacent ILS PRM approach in sight; and\nnotified ATC that traffic is in sight.\n\nThis means that the aircraft on the ILS PRM approach should be ahead of the other aircraft. To allow time for visual contact, aircraft should be clear of cloud before the MAP, which is taken into account when deciding on the minimum cloud ceiling allowed for the approach.\nThe NTZ (No Transgression Zone) is a 2000 foot wide area between the two approach courses which aircraft must not enter at any time. ATC would immediately issue breakout instructions to both aircraft if an aircraft breaches the NTZ, as there would be very little horizontal separation between the two aircraft. [The FAA AIM][3] states that:\n\nIn the unlikely event that an aircraft \"blunders\" off its course and makes a worst case turn of 30 degrees toward the adjacent final approach course, closing speeds of 135 feet per second could occur that constitute the need for quick reaction.\n\nSpecial training requirements vary from country to country. In the US, SOIA special training requirements are:\n\nParts 121/129/135: operator training as agreed to by FAA and educational video\nPart 91 transport category: read about PRM approaches in AIM, video\nPart 91 other: read about PRM and SOIA approaches in AIM, video\n\nAn example of a SOIA approach is the SFO runway 28R LDA PRM approach:\n\n", "When are winds given with respect to true vs. magnetic north?": "\nThe general rule is:\nIf you read it, it's true. If you hear it, it's magnetic.\nAll charts and textual sources (METAR, TAF, winds aloft, surface analysis charts, etc) use true north as the reference.\nATIS/AWOS/ASOS broadcasts, or any information a controller gives you over the radio, is magnetic.\n\nWind direction broadcast over FAA radios is in reference to magnetic north.\n\nAIM Section 7-1-11 (page 7-1-26 in the 5/26/16 edition)\nOne exception to the \"if you hear it\" rule is that a FSS briefer will read you the winds referenced to true north, since they're just reading you the charts/textual information.\n(This is at least true in the United States... other countries may vary in some instances)\n", "faa regulations - What to do if the captain smells like alcohol?": "\nUnfortunately, at least in the US, the regulations don't stipulate that you do anything. Airline policy is a different matter, and one which I cannot speak to, as it will be different in every case.\nI can provide some background and my own take on this, but it's hard to have one exact answer (what if you're wrong?).\nFAA regulations rely on pilots self-regulating. If a pilot drinks within an 8 hour (or, as is often policy for airlines, 12 hour) window prior to the flight, they are required to remove themselves from that flight. If they do not take this action, somebody else must. Often, this person is the First Officer, a junior pilot who has years of flying with pilots who might come to view them as untrustworthy. Perhaps this can help explain why it's such a difficult action to take.\n\nThis is a difficult topic, and one which regularly comes up during airline flight training. That said, the courses I took that discussed this scenario essentially landed on a couple of steps (this was years ago, this is probably a bit rusty):\n\nConfront the pilot. Ask them if they've been drinking in the last X hours. If they claim they have not been, or they push back:\nAttempt to explain to them the situation they're putting their career (and you) in;\nTry to get them to remove themselves from the flight and contact a union representative.\n\nBeyond that, I don't want to make suggestions. Getting them to talk to the union they are a member of is probably a wise idea, as they can offer possible solutions or arrange treatment if the pilot has alcohol abuse problems (which is not a huge stretch, if they're showing up to work reeking of booze). AOPA Flight Training has a blog post that discusses some similar scenarios.\n", "faa regulations - When to use beacon, anti-collision, strobe, logo, and navigation lights?": "\nThe Aeronautical Information Manual (AIM) is a great place to look for questions like this, and has this on the subject:\n\n4-3-23. Use of Aircraft Lights\na. Aircraft position lights are required to be lighted on aircraft\n  operated on the surface and in flight from sunset to sunrise. In\n  addition, aircraft equipped with an anti-collision light system are\n  required to operate that light system during all types of operations\n  (day and night). However, during any adverse meteorological\n  conditions, the pilot-in-command may determine that the anti-collision\n  lights should be turned off when their light output would constitute a\n  hazard to safety (14 CFR Section 91.209). Supplementary strobe lights\n  should be turned off on the ground when they adversely affect ground\n  personnel or other pilots, and in flight when there are adverse\n  reflection from clouds.\nb. An aircraft anti-collision light system can use one or more\n  rotating beacons and/or strobe lights, be colored either red or white,\n  and have different (higher than minimum) intensities when compared to\n  other aircraft. Many aircraft have both a rotating beacon and a strobe\n  light system.\nc. The FAA has a voluntary pilot safety program, Operation Lights On,\n  to enhance the see-and-avoid concept. Pilots are encouraged to turn on\n  their landing lights during takeoff; i.e., either after takeoff\n  clearance has been received or when beginning takeoff roll. Pilots are\n  further encouraged to turn on their landing lights when operating\n  below 10,000 feet, day or night, especially when operating within 10\n  miles of any airport, or in conditions of reduced visibility and in\n  areas where flocks of birds may be expected, i.e., coastal areas, lake\n  areas, around refuse dumps, etc. Although turning on aircraft lights\n  does enhance the see-and-avoid concept, pilots should not become\n  complacent about keeping a sharp lookout for other aircraft. Not all\n  aircraft are equipped with lights and some pilots may not have their\n  lights turned on. Aircraft manufacturer's recommendations for\n  operation of landing lights and electrical systems should be observed.\nd. Prop and jet blast forces generated by large aircraft have\n  overturned or damaged several smaller aircraft taxiing behind them. To\n  avoid similar results, and in the interest of preventing upsets and\n  injuries to ground personnel from such forces, the FAA recommends that\n  air carriers and commercial operators turn on their rotating beacons\n  anytime their aircraft engines are in operation. General aviation\n  pilots using rotating beacon equipped aircraft are also encouraged to\n  participate in this program which is designed to alert others to the\n  potential hazard. Since this is a voluntary program, exercise caution\n  and do not rely solely on the rotating beacon as an indication that\n  aircraft engines are in operation.\ne. Prior to commencing taxi, it is recommended to turn on navigation,\n  position, anti­collision, and logo lights (if equipped). To signal\n  intent to other pilots, consider turning on the taxi light when the\n  aircraft is moving or intending to move on the ground, and turning it\n  off when stopped or yielding to other ground traffic. Strobe lights\n  should not be illuminated during taxi if they will adversely affect\n  the vision of other pilots or ground personnel.\nf. At the discretion of the pilot­in­command, all exterior lights\n  should be illuminated when taxiing on or across any runway. This\n  increases the conspicuousness of the aircraft to controllers and other\n  pilots approaching to land, taxiing, or crossing the runway. Pilots\n  should comply with any equipment operating limitations and consider\n  the effects of landing and strobe lights on other aircraft in their\n  vicinity.\ng. When entering the departure runway for takeoff or to “line up and\n  wait,” all lights, except for landing lights, should be illuminated to\n  make the aircraft conspicuous to ATC and other aircraft on approach.\n  Landing lights should be turned on when takeoff clearance is received\n  or when commencing takeoff roll at an airport without an operating\n  control tower.\n\n", "airport - How are runways numbered?": "\nRunways are usually numbered according to their direction, more precisely called runway magnetic bearing or QFU (see Q codes).\nConsider a plane flying toward the runway on final approach in a day without any wind. Divide its magnetic heading by 10, round it to the nearest whole number and you'll usually get the runway number. For example, if the magnetic heading is 345° then 345/10=34,5, so the runway number will be 35 which will be a runway used for landings (and takeoffs) to the north.\nOpposite ends of the same runway have different numbers, 18 (which represents 180 degrees) apart. A runway with 35  for landings to the north will have runway 17 for landings to the south. Even though these are the same strip of concrete, they are treated as separate runways by pilots and controllers.\nIf there are two airports near one another with runways at the same angle, sometimes one of the airports will add or subtract one from the runway number to help planes differentiate between the airports.\nOccasionally a runway number will change when the magnetic declination angle changes in such amount, making the runway magnetic bearing divided by 10 and rounded to the nearest whole number increase or decrease.\nSome runways in areas of large magnetic declination use true instead of magnetic headings for the runway numbers. This is not unusual in northern Canada and Greenland.\nWhen there is more than one parallel runway at an airport, L, R, or C may be appended to the runway number for Left, Right, or Center. These are based on the approach direction, so, for example, the runway 35L would be called 17R from the opposite direction.\n", "pilot certification - How do I renew/revalidate my lapsed JAR PPL?": "\nI'll have a go at answering this.  It's confused by the UK's transition from the JAA to EASA licensing.\nMy JAR-PPL(A), issued in 2011, is valid for 5 years so yes, I assume yours will have expired.  My FRTOL is valid for 10 years so presumably yours will have expired too.\nThe requirements are hidden in CAP 804 ([Deep breath] Section 7, Part B (Schedule 7) Part C, Section 2, Paragraph 9-(1)(c)).  Renewing an expired licence (single-engined/single pilot aeroplane) seems to require meeting FCL.740.A of Part-FCL (type rating) and Appendix 9 to Part–FCL (skills test).\nI believe this effectively means you'll have to undertake training to ensure you can pass the skills test, pass it and pay to have your licence reissued.  (Not forgetting the medical.)   You will end-up with a part-FCL PPL (which do not expire).\nI'm not sure about having to retake the FRTOL tests, I think you may just have to re-sit the theory (PPL comms), fill out a form and pay but the answer is probably in CAP 804 somewhere!\nThe easiest/best thing to do would be to pop-in to your local friendly FTO and discuss with them...\n", "Who decides an aircraft's maintenance schedule?": "\nThe manufacturer lists all maintenance that should be done, and when. This is the first document you found, from Boeing. Some of this maintenance may be required, other things might be recommended.\nThe operator can use that plan, while following maintenance laws (e.g. the required annual inspection). Or, they can submit a new rolling maintenance plan to their National Aviation Authority (e.g. FAA) for approval, which is usually done to prevent large downtime events for the aircraft. (This \"rolling inspection\" is done so that all of the necessary things are inspected at the proper intervals, but not all at the same time.)\nThere's a bit more, too: the Aviation Authorities can create Airworthiness Directives that can add additional required maintenance that must be done within certain limits (usually hourly, but can be situation dependent) for the aircraft to be airworthy.\n", "Are task cards still used in aircraft maintenance?": "\nI just watched Engineering Giants - Jumbo Jet Strip-Down, following a British Airways 747 on its D-Check in 2012.\nAt least for BA, it would seem that paper task/job cards are still heavily used. Apparently there are over 12,000 individual jobs.\nI've taken a short (7 secs) clip from the episode, showing walls full of task cards:\n\n\n\n\n", "commercial operations - What is the usage ratio of the An-225 Mriya?": "\nAs a privately-operated aircraft, this is probably not going to be a question which is completely answerable. All that is available is best guesses and incomplete information!\nThat said, the An-225's last tracked flight on FlightAware – as of today – was March 15, 2012 between Bangor, Maine (KBGR) and Port Harcourt, Nigeria (DNPO). That suggests that the An-225 is either being excluded from flight tracks, or simply hasn't visited the US since early 2012.\nAside from that, the only other likely place for flight information is photo sharing websites like airliners.net and flickr, or on youtube. Browsing through flickr, I tried to track down dates of recent photos in unique locations (which is a guess at best):\nMay 21 2013\nJune 24 2013\nSeptember 25 2013\nSeptember 26 2013\nNovember 12 2013\nNovember 17 2013\nDecember 10 2013\n\nI'm sure there are more, but I stopped searching. It looks like it's probably doing charter cargo trips at most a couple of times a month, which is honestly more frequently than I expected! If you're interested, I'd encourage you to track down more on the sources I mentioned.\n", "What are the typical facets of ownership costs, for a single engine aircraft?": "\nI've heard it said that the break-even point for owning vs renting is 200 hours/year. I fly a lot less than that, but I don't like sharing my toys, so I own anyway.\nI make it a point to not actually count my cost of ownership, because it wouldn't be fun any more, but I'll give you some rough numbers.\nI bought a 1962 Mooney for \\$30,000. That's about as cheap as it gets, and this was reflected in the condition of the plane and the high-time engine.\nIn the first year had it, I spent \\$18,000 on an engine rebuild, new prop, new carb, new magnetos, new oil pump, and all the other firewall-forward upgrades that were required when I got the new engine. Five years later, I spent \\$14,000 on new paint. It still needs a new interior, but that can wait. I spent about \\$3000 at West Texas Aero installing speed upgrades.\nBudget \\$10/hour for your next engine rebuild.\nAnnual inspection typically runs \\$3000 to \\$6000 depending on what they find wrong. I'm getting a tank resealed this year, so it's going to be an expensive one.\nParking runs typically \\$50-\\$100/month, depending on where you are.\nInsurance for my old crate runs \\$750/year. Expect to pay more for a nicer plane or if you have less experience. Note: get a commercial license; it will pay for itself in reduced insurance in the long run.\nI think gas will typically run \\$5-6/gallon, depending on a lot of factors. My Mooney burns around 9.5gph, and flies 142 kts so it's really economical in that respect (and the main reason I don't upgrade).\nLight twins are cheap to buy, but that's because their cost of ownership is through the roof. A low-time pilot can expect to pay \\$12,000/year for insurance and the annual inspection will also be a back-breaker.\nI used to have money. Now I have an airplane.\n", "weather - Why would ASOS have a caution for Low Density Altitude?": "\n\nLow density altitudes mean your engine generates more power, and your wings generate more lift. Everything is better with low density altitudes, right?\n\nThe potential danger in low density altitudes is that your engine generates more power than it can handle. Even without exceeding the maximum rated RPM and manifold pressure, you can exceed the rated power of an engine under low density altitude conditions. \nAt low temperatures the air becomes denser. At standard sea level conditions air has a temperature of 15 degrees Celcius and a density of 1.225 kg per cubic meter. \nWhen the temperature is -30 degrees Celcius, the density increases to 1.452 kg per cubic meter. The equivalent altitude where this density is found under standard atmosphere conditions would be about -5900 ft. This is called the density altitude.\nWhen air with these properties enters the combustion chamber of your engine and is combusted to the normal exhaust temperature it expands (increases in pressure) far more that air normally would, resulting in excessive power. \nThis FAA paper on Winter Flying Tips says the following about the risks associated with low density altitudes:\n\nDo not overboost supercharged engines. This is easy to do because at very low density altitude, the engine \"thinks\" it is operating as much as 8,000 feet below sea level in certain situations. Care should be exercised in operating normally aspirated engines. Power output increases at about 1% for each ten degrees of temperature below that of standard air. At -40 degree F, an engine will develop 10 percent more than rated power even though RPM and MP limits are not exceeded. \n\n", "flight instruments - What's the difference between True vs Magnetic headings?": "\nThe \"heading\" refers to the direction an aircraft is pointing. For a Magnetic Heading, this is in relation to Magnetic North. For a True Heading, this is in relation to True North.\nTrue North is directly over the earth's axis.\nMagnetic North is somewhere over Canada, moving towards Russia.\n\nTo get the Magnetic Heading, you just read it off the magnetic compass.\nTo get the True Heading, you need to first read the magnetic compass, then either add an Easterly, or subtract a Westerly, magnetic variation; based upon the isogonic lines on your sectional (the purple dashed lines labeled 5°W, 3°E, etc).  \nExample 1: Magnetic Heading 177 w/ 3 degrees East Magnetic deviation = true course 180. \nExample 2: Magnetic Heading 177 w/ 3 degrees West Magnetic deviation = true course 174. \n\nBecause of this, in the past, magnetic headings were used because a simple compass could be used. Finding reliable true headings was difficult until the era of things like the gyrocompass (patented in 1906 (Germany) and 1908 (USA)) and more recently, GPS.\n", "air traffic control - Do controllers take wind into account when giving headings?": "\nWhen the controller says heading, he means heading. \nSo if he wants you to go into a specific direction, he will take wind into account. The reason for issuing heading are:\n\nEvery aircraft can fly it, because a compass is fitted on every aircraft. Track keeping requires more sophisticated avionics. \nIf two aircraft fly adjacent to each other, the wind will offset them by the same amount and therefore separation is assured. \n\nQuite often a controller will ask you to report your present heading prior to instructing a one so he can make more accurate adjustments to your course, especially if you were under own navigation before being vectored. \nWith Mode S radars and the right equipment in the aircraft, the current heading can be downloaded from the avionics without the pilot being aware of it. \n", "logging - What is the best way to keep logbook entries backed up?": "\nThe FAA requirements are for the information to be logged, without specifying the details of how it is logged. \nIt's OK to use electronic log books, and multiple log books. Scanned images are as good as photocopies. Just print them if you ever need them on paper. Some items are required to be signed, so scanned signatures and endorsements may be necessary in an electronic logbook.\nThe older the information, the less its importance. Log books are normally examined to see if what you're doing is legal, checking ratings, currency, training and reviews, etc. If you are flying without required night or IFR currency, for example, it is conceivable that they'd want to check previous flights to see how often that has happened in the past. \nAn insurance company might want to make sure you've got the hours you claim, but the FAA's interest is to see if you are legal.\n", "faa regulations - Can I attach a camera to the outside of my aircraft in the USA?": "\nThe NTSB actually recommended the use of exterior cameras to the FAA in 2012.\nIt appears to be something of a grey area, but it looks like you should contact your local FSDO for approval of an external load if you're permanently fixing a camera to a plane.\nThe grey area comes in that if the camera is temporarily attached, you shouldn't need special approval, but in practicality it could come loose and damage the plane.\nGoPro says this about affixing their cameras to planes:\n\nIndustrial strength suction cup. Strong enough to pull dents out of a car door or stay attached to an airplane at 200mph+, proven though not endorsed by GoPro per FAA rules.\n\nThere's a forum thread where someone asked the FSDO to sign it off as a Minor Alteration, and it was determined that a short logbook entry would suffice:\n\nTemporarily installed a GoPro camera mounted to a standard inspection panel on (Left/Right) lower wing in place of the standard inspection panel. There are no electrical connections associated with this installation. This is a minor alteration as it has no appreciable effect on performance, flight characteristics, or other qualities affecting airworthiness (refer to FAR 1.1 Major Alteration and FAR 21.93). A net weight change of 9 oz is incurred with the temporary installation; therefore, the weight and balance change is negligible (refer to AC 43.13 1B, 10-2 (c)).\n\n", "cost - Can I save money on becoming a helicopter pilot in the US if I do flight hours in Mexico?": "\nAs far as I can tell from the FARs as long as your training is performed by an FAA-certificated flight instructor and complies with the appropriate requirements of part 61 of the FARs you could theoretically do parts of your (primary/private) training anywhere you want, get all your endorsements, then come back to the USA to take your checkride and get a regular US (FAA) pilot's license for the appropriate category/class of aircraft.\nFrom a practical standpoint I think this may be more work than the money you save.\nIf you do your pre-solo training in Mexico any instructor you come to in the US is going to want to fly with you a bit before they endorse you to solo.\nIf you try to do the whole thing in Mexico you would have to comply with Mexico's flight training requirements (Medical, student pilot certification, solo endorsements, etc. - about which I know basically nothing) as well the US FAA's requirements (like holding a US student pilot certificate with appropriate endorsements prior to taking your checkride). \n\nNote that the procedure is a little different if you want to get a Mexican pilot's certificate and then convert it to a US/FAA certificate (that's all detailed in FAR 61.75 if you're interested. It doesn't sound like that's what you want to do, but at least as far as the regulations go that seems to be a more well-traveled path and something your local FSDO could probably advise you on - at the very least it would involve paperwork, possibly also a checkride).\n\nI'd like to say a couple of words on Primacy since we're talking about training: Where you learn and the procedures you learn first will form the foundation of your aviation knowledge.\nWhat that ultimately means for you depends on how different the regulations are where you do your training versus where you will do most of your flying. The FAA has been moving to standardize our procedures to be more in line with ICAO standards for a number of years now, but there are still differences and you may have to re-learn some of the regulatory bits of aviation if you did the bulk of your training elsewhere. \nIt makes sense to me to learn to fly where you intend to fly -- ideally in the same region (a sleepy corner of the midwest versus lower New York's airspace can be a culture shock!) but if cost is a factor find the best bang for your training buck in the airspace system you'll be spending most of your time in.\n", "faa regulations - What are the weather requirements to log an instrument approach?": "\nUpdate with relevant info from InFO 15012 (I'm skipping the FTD portions as not relevant to the question, and including the simulated parts but italicizing them as they're useful but also not relevant). Translated, you can log an approach when:\n\nit is flown solely by reference to instruments, and\n\n\nit is flown in IMC, and Actual Instrument time is logged, or\nthe PF is using a view-limiting device, and Simulated Instrument time is logged;\n\nyou must fly the complete approach from a feeder or the IAP (or Vectors to Final) and remain established the whole time. This means you fly initial, intermediate, and final segments, unless you're on vectors.\n\n\nif flying the approach in IMC, you may log an approach that:\n\n\ncontinues to DA/DH or MDA in actual, or \nbecomes VMC before DA/DH or MDA, provided you are inside the FAF.\n\nif simulating the approach, you must continue to the DA/DH or MDA under the hood (or other VLD);\n\n\nThat's pretty much it. Here's the source text:\n\nA pilot may log an IAP for currency or training when the pilot\n  accomplishes the IAP in accordance with the following conditions:\n\nWhen conducted in an aircraft, flight simulator, flight training device, or aviation training device, the pilot must operate that\n  aircraft or authorized training device solely by reference to\n  instruments [§ 61.51(g)(1)];\nWhen conducted in an aircraft, flight simulator, flight training device, or aviation training device, the pilot must be established on\n  each required segment of the IAP to the minimum descent altitude (MDA)\n  or decision altitude/decision height (DA/DH);\nWhen conducted in an aircraft simulating instrument flight conditions, a flight simulator, a flight training device, or an\n  aviation training device, the simulated instrument meteorological\n  conditions (IMC) must continue to MDA or DA/DH; and\nWhen conducted in an aircraft, the flight must be conducted under actual or simulated instrument flight conditions [§ 61.51(g)(1)].\nWhen conducted in an aircraft maneuvering in IMC, and the aircraft transitions from IMC to visual flight conditions on the final approach\n  segment of the IAP prior to or upon reaching MDA or DA/DH.\n\n\n\nPreviously, I linked to Rod Machado, who cites the FAA in an answer to this that I quite like, and which was pretty frequently referred to when I was instructing at a flight school:\n\nOnce you have been cleared for and have initiated an instrument approach in IMC, you may log that approach for instrument currency, regardless of the altitude at which you break out of the clouds.\n\n...but this is not the latest knowledge anymore. It's functionally pretty close to the InFo rules for IMC approaches, though!\n", "Flight Level Change or Vertical Speed": "\nFLC mode maintains airspeed during a climb or descent, while VS mode maintains a specific vertical speed.\nOften air traffic controllers will request that you \"maintain 250 knots in the descent\" or something to that effect, which is much easier to achieve when using Flight Level Change. As another answer points out, by maintaining airspeed, climbs are made safer as the autopilot will not attempt to maintain a rate of climb regardless of whether or not the airspeed is safe.\nFLC mode is typically only available in advanced autopilots, and as far as I know they need to connect to an Air Data Computer to get the necessary information.\nHow to use FLC would depend on the equipment available to you: \n\naircraft with auto throttle will maintain speed and an appropriate rate of descent automatically. \nfor aircraft without auto throttle you'd set your target altitude, enable FLC, adjust your target speed if needed, and set your throttle for climb or descent to maintain the desired altitude change rate.\n\nI'm referencing the Garmin GFC700 as it's the only autopilot I've used with FLC mode, but I imagine the same steps and rules would apply.\n", "How does aircraft navigation work?": "\nHow do you navigate in your car?\nBefore you depart, you have a general understanding of which direction you're going.\n(the supermarket is to the east of my house, about 3 miles.  I believe it will take me about 5 minutes to get there).\nWhen you start driving, you keep your eyes open looking for information and clues.\n(The yellow lines on the road denote a two-way street.  Certain landmarks are familiar and expected.)\nAs you proceed, you may refer to your car dashboard to make sure things are as expected\n(My speed is 43MPH.   I had planned for 45MPH... pretty close.  My engine is running at 2,500 RPM, which is appropriate)\nYou may have advanced instruments as well\n(The GPS in my car is telling me to take the next right turn, and go 1/2 mile)\n\nIts very much the same with flying.\nPilots have pre-flight preparation where they go over a general plan.(we're going to fly north, on a heading of about 025 for 3 hours.  We'll be passing over a large lake, and landing at our destination with a city off to our left)\nAs they move towards the runway, they look for other airplanes, read the signs around the  runway, and refer to their maps.\n(I see a sign indicating I'm on taxi-way Bravo, approaching Runway 31.  I see yellow markings on the pavement indicating I should get permission before I cross)\nOnce they take off, they look at their instruments to verify they're going at the expected speed, altitude and direction.\n(Altitude is 35,000 feet, as planned.  Engines are at the right pressure, and speed is 440 knots, as expected)\nThey can look out the window for large landmarks, lakes, mountains, cities, etc.\n(I'm passing by the mountain I saw on the map.  I see the river valley below me, and a large city ahead of me, just like I planned)\nThey may use advanced services like GPS Navigation, Radar and radio signals to help navigate.\n(My GPS is showing my position and direction.  It says to turn a little to the right to stay on course.   The navigation radio says I'm 25 Nautical Miles away from the radio transmitter)\nAnd they can talk to Air Traffic Control who can observe them on radar, and advise them to make adjustments to their course for navigation, and to stay separated from other airplanes.\n\nIf they cannot see out the window, navigation does become a bit more complicated, and reliant on Instruments, GPS, Radar and Radio.But given a very careful plan of \"Fly for exactly 31 minutes, at exactly a heading of 027, at exactly a speed of 130Kts\", it is pretty remarkable how close the airplane will end up to the intended destination.\nThat process is called Dead Reckoning.  It requires some detailed advanced planning, but isn't that difficult.   Combining Dead Reckoning with Instrument flying, and pilots can go through zero-visibility and still come out at the intended location.\n", "faa regulations - How is drone (UAS) traffic regulated in the US?": "\nRegulations regarding UAVs are very restrictive in controlled airspace. Whenever a company wants to test out a UAS, they have to request a block of airspace from the FAA (or local ATC body). This block is restricted to UAS traffic. No manned aircraft are allowed in that area for the duration of the test.\nCurrently companies are working with the FAA to integrate UAVs into the regular airspace system. Recently, the FAA designated 6 states as test sites for the FAA to test UAVs.\n", "air traffic control - What is the range and accuracy of ATC radar systems?": "\nThis is a general answer, not specific applicable to the situation in the USA. \nThere are several types of radars in use to monitor airspace. \nBasically you can distinguish two classes of radar:\n\nPrimary radar does not require the aircraft to carry a transponder, it is a form of non-cooperative surveillance.\nSecondary radar on the other hand requires the aircraft to carry a transponder; the transponder replies to interrogations from the radar. This is called cooperative surveillance.\n\n\nRadars operate basically by line-of-sight, however due to atmospheric effects the radio waves follow the curvature of the earth to some degree. Aircraft flying low are quickly below the horizon, but aircraft at FL450 can be detected on secondary radar at ranges up to 300NM if the radar is operated for such range. Typically the range is less. \nIn general, the further the range that a radar needs to look, the slower it rotates. An airport surface radar may rotate as fast as twice per second, long range en-route radars can go as slow as once per 12 seconds. For typical TMA / TRACON use, 5 seconds would be in the right ballpark, for en-route 8 seconds will be about right. \n\nThe accuracy depends on the type of antenna, whether it is primary or secondary radar, and the distance of the aircraft from the radar head. The accuracy of the distance measurement are not so much affected by the range, and varies from about 5 meters to 300 meters. However, atmospheric circumstances can degrade these figures, especially at long range. The across beam accuracy is very much dependent on the distance from the antenna due to limited angular accuracy of the radar. The further you get, the worse the across beam accuracy becomes.\n", "air traffic control - How will radar systems be used in FAA's NextGen ATC plans?": "\nUnder the ADS-B rule of the FAA aircraft operating in Classes A, B, and C airspace, as well as certain other specified classes of airspace\nwithin the U.S. National Airspace System are required to operate ADS-B Out avionics. \nThis means that these aircraft can be tracked without the use of radar. These ADS-B tracks will be more accurate than radar tracks and have a higher update rate. However for reasons of integrity, continuity of service and security, radar will continue to provide coverage. Currently a lot of airspace is covered by multiple radar layers, the introduction of ADS-B allows for a reduction in redundant radar coverage.\nAircraft not equipped with ADS-B (operating outside of class A,B, or C airspace) will be tracked using radar. The radar tracks will be broadcast on TIS-B (Traffic Information Service - Broadcast) so that aircraft with ADS-B In receivers detect these aircraft as well. \n", "boeing - With the upgrade of the 737 to the Max model, what major changes are incorporated?": "\nThere are of course a lot of tiny changes that Boeing would have done to the aircraft that most of us wouldn't notice, but for brevity I've just included the major changes between the 737NG series and the upcoming 737MAX.\n\nThe CFM LEAP-1B engine replaces the current CFM56 engines. Some of the significant improvements in fuel efficiency (15% savings minus drag from larger engine touted by CFM) come from a much higher bypass ratio (from 5.3:1 to approximately 9:1) and materials that can tolerate higher temperatures. Chevrons (saw-toothed tips at the end of the nacelle) have also been included to reduce engine noise on takeoff.\nThe engine change required changes to the nose landing gear to allow enough clearance from the ground, extending the nose gear by about 8 inches (20cm) and modifying the nose gear bay to allow it to fit into the existing space.\nThe AT (Advanced Technology) winglets replace the 737NG's blended winglets. The AT winglet incorporates two portions, done to reduce the weight required (compared to a larger blended wingtip) while still reducing block fuel burn by about 1.5%.\nFly-by-wire spoiler system reduces the need for long cabling between the cockpit and the spoiler hydraulic actuators, saving weight, reducing stopping distance by quicker actuation and increasing the accuracy of the controls.\nRedesigned tailcone and modifications to elevator to improve aerodynamics, removing the requirement for vortex generators (VGs), which improves predictability and control by making the air turbulent, but as a result increasing drag.\n\n", "faa regulations - Is there any size of tethered kite that is regulated by the FAA?": "\nAs one of my instructors was fond of pointing out, there's pretty much a regulation for everything -- in the US kites and balloons would be covered under FAR part 101 which is pretty short and to the point as far as government regulations go.\nThe big rules regarding kites/balloons kick in for a kite \"over 5 pounds\" or a balloon \"over 6 feet in diameter / 115 cubic feet of gas capacity\", and are:\n\nYou have to keep them at least 500 feet below any clouds.\nYou have to keep them less than 500 feet above the ground.\nYou must be at least 5 miles from the boundary of any airport.\n\nIf your kite/balloon is going to be more than 150 feet above the surface you're also supposed to coordinate with the closest ATC facility (who would theoretically put out a NOTAM saying \"John Doe is going to be flying a kite/balloon/thingy here, between these hours. Please try not to hit it.\")\nThere are also some lighting requirements (if you fly the balloon/kite at night), and visibility requirements (but really, who wants to fly a kite in less than 3 miles visibility? That seems like pretty lousy kite weather.)\n\nAs a favor to your local pilot community (and to prevent having your wayward kite dragged off by a Cessna on short final) it's probably best to observe the three \"big rules\" above regardless of the size of your kite - a 6-ounce piece of balsa and cellophane can still make a lot of people's days more interesting if it appears in an unexpected location.\n", "Are there standard ground-tether systems for unpowered aircraft?": "\nIn the United States moored balloons (or kites) are governed under Part 101 of the FARs (a much neglected and very short corner of the regulations that also covers amateur rocketry and \"unmanned free balloons\" -- looking at your profile it's probably a section you'd find very interesting!). \nIn this particular case you're probably looking for Subpart B - Moored Balloons and Kites.\n\nThe FAA is mum on the specific engineering requirements of mooring systems - I expect they anticipate you will work with structural and mechanical engineers to design a tethering system that can safely hold the loads your moored object will place on it (or just tie it to the biggest, most structurally secure thing you can find, with a nice heavy rope and a proper knot).  \nThere are a few things they ARE pretty specific about though.\n\nSome operating limitations (altitude, size, location, visibility).\nThe fact that you have to tell them about it in advance\n(At least if it's more than 150 feet AGL, per 14CFR101.15)\nLighting and marking requirements for the tether(s)\n(14CFR101.17, which basically says the mooring line must have pennants (daytime) and/or lights (nighttime) to ensure visibility)\nWhat happens to Balloons if the tether breaks\n(14CFR101.19, which basically says if the balloon breaks free of its moorings you need a \"rapid deflation device\" that gets it down in a hurry so it's not just wandering around up there).  \n\nInterestingly they don't seem to care so much if a kite escapes its moorings.\n", "wind - What's a quick way to determine which runway to use?": "\nThis might take a few seconds longer, but it's math-free: On your kneeboard, draw a quadrant (like this: +). Draw a line through it for your runway(s). Draw an arrow to represent the wind. The answer will be apparent. Do it enough times, and you'll be able to visualize the drawing without actually doing it.\nIt's also a great technique for calculating holds.\n", "takeoff - How can a hang glider take off from flat ground?": "\nIf you were an avid hang glider pilot at the time you posted your question, you no doubt have long since connected into the local hang gliding community and found the answers to your questions, and have spent many joyful hours soaring under the beautiful cumulus clouds over the Texas flatlands.\nAerotow (towing up behind a slow-flying ultralight or lightsport aircraft) is one way to launch hang gliders from flat ground.  A typical tow will be to around 2500' or 3000' up.  You'll start with the glider on a three-wheeled dolly so your own legs don't have to be involved.  If you've never done it before you'll get training in a \"tandem\" hang glider, flying with an instructor.  There is an active hang gliding business very near Houston that offers aerotow launches, and I hope you have made contact with them since you posted your question.  (Google \"Cowboy Up Hang Gliding\".)\nAnother method is called \"platform launch\".  The glider is placed on a platform on the bed of a pick-up truck.  The truck has a reel of line that pays out under constant pressure, regulated by a disk brake.  The truck starts driving down a long little-used road or on a dry lakebed or an airport runway.  When sufficient airspeed is reached to ensure a strong positive launch with a strong vertical climb rate, the  pilot pulls a trigger to release the glider from the truck and the line starts spooling out.  I've gained as much as 4000' of altitude during this type of launch, using a reel of lightweight spectra line, and a 3-mile-long road.  \nThis type of launch is a very technical procedure and unless you are a willing to take high risks as a test pilot, you must use the exact equipment that other experienced flyers have carefully developed over the years.  You must get training in the techniques, use a  detailed checklist, etc.  I'm not sure if this is currently being done anywhere near you.  Aerotow would be the easier route in most cases.\nYet another method uses a stationary winch that reels the line in.  Often such a winch is made from a motor scooter, mounted on a trailer, with the back wheel replaced by a drum (reel).  This method can be good for beginner training via ground-skimming flights, but also can be used to launch to several thousand feet of altitude.\nIt is also possible to tow a hang glider from a car or truck using a fixed length of rope.  This is not as simple as it sounds-- for example a line tension gauge is essential.  Read on for more safety tips.\nTo safely tow a hang glider, you must avail yourself of community knowledge and training.  With many methods, it is vital to have some way to actively control the towline tension, and with all methods, a weak link of appropriate strength is essential.  Reliable release mechanisms that route the towline's pull to the appropriate points on the pilot's harness (and sometimes to a point on the glider as well) are also essential.  Simply tying one end of a strong rope to the glider and the other end to a fixed point on the ground and trying to launch yourself like a kite on a windy day would be extremely dangerous.  Several fatalities occurred this way back in the early days of hang gliding, before the community gained expertise in safer methods, and also developed a strong culture of safety-consciousness.  A phenomenon called a \"lockout\" is waiting to bite you if things go wrong.  If you've ever seen a tethered kite dive into the ground at high speed with the string under high tension, you'll have some idea of what this might be.  \nGenerally speaking, hang gliders have less control authority than sailplanes, especially in the roll axis, so towing hang gliders is more complicated than towing sailplanes, and more care is needed to maximize the odds of a safe outcome.  However, if due caution is taken, towing can be a very effective way to get a hang glider up into the sky.\nThere are also motor units available for hang gliders.  The modern method is to incorporate the motor into the pilot's harness, not to attach it to the glider itself.  Using your own feet as landing gear while launching with a motor can be somewhat challenging and also dilutes the joy of pure soaring flight; you'll probably have a more enjoyable experience if you go the aerotow route.  But google \"mosquito harness\" or \"hang glider powered harness\" for more on the motor option.  \nA related concept is the \"light trike\", where there are wheels and a seat as well as a motor, all connected to a hang glider wing, but everything is kept light enough in relation to the wing size to allow a low sink rate in unpowered flight.  The motor is used to get some altitude, and then you shut it off and have a nice soaring flight.  The control \"feel\" may be a little awkward compared to a pure hang glider flown from a prone position-- most hang glider pilots would prefer to let the motor fly away with the towplane at the end of the tow, as long as the soaring conditions are good and a towplane is available.\nI can't answer a question about hang gliding in Texas without referencing the famous flights originating from Zapata TX on July 8 2012-- one pilot flew 764 km (475 miles), and a second pilot flew just a few miles short of that distance.  Read more about it -- and see video of their aerotow launches-- here: https://xcmag.com/news/dustin-martin-and-jonny-durand-break-hang-gliding-world-record-in-zapata-4/\nAnd yes of course it is also possible to run into the wind as fast as you can and then increase the angle of attack of the wing to do a little hop.  In terms of peak altitude gain, this is particularly effective on a beach, where the wind gradient tends to be especially pronounced-- the wind gradient will help you out as you start to climb-- but then will work against you as you come back down.  You'll never get more than a few seconds of flight time this way, but it can be a fun thing to  do a few times after you touch down on the beach after a nice long ridge-soaring or dune-soaring flight on a windy day.\n", "symbology - What are those thin magenta lines on the Sectional / Terminal Area Chart near Death Valley?": "\nThose lines denote areas of the MOA which have altitude exclusions different from what is listed on the chart's MOA table. In this case:\n\nMOA Excludes Airspace 3000' AGL & Below\n\nNotice the same style magenta lines are drawn in circles around airports in the MOA which also have the same style remark excluding a specific portion of the airspace.\n", "Are there any serious plans for a new supersonic civilian aircraft?": "\nAerion is planning a supersonic business jet which has a projected completion year of 2021:\n\nHere's an article Forbes have written about it.\n", "easa regulations - What are the different steps to certify a new aircraft in Europe?": "\nThe EASA certification requirements are all publicly available online. Actually proving that an aircraft meets those criteria will certainly include all the steps you mentioned although exactly what happens probably depends a lot on the specific aircraft and manufacturer.\n", "passenger - What is this sound from Airbus aircraft before take off?": "\nAccording to Ask the Pilot:\n\nAlmost every frequent flyer has encountered this sound at one time or\n  another. [...]\nIt happens on twin-engine Airbus models: the A320 series (includes the\n  subvariants A319 and A321) and the larger A330. [...]\nWhat you hear is a device called the power transfer unit, or PTU,\n  which is designed to ensure adequate hydraulic pressures during\n  single-engine operations. [...] Since it is activated only when the\n  pressure falls below a certain level, the PTU cycles on and off, on\n  and off, on and off.\n[...]\nSome Boeing aircraft also employ a PTU, but the operation is slightly\n  different and it doesn’t bark like a dog.\nAnother noise peculiar to Airbus models is a shrill, prolonged whine\n  heard at the gate prior to departure and again after landing. This is\n  an electric hydraulic pump used to open and close the cargo doors.\n\n"}