{"karma - Is there an equivalent of heaven and hell in Buddhism?": "\nThere is no sense of accumulating sins, per se; your karma (actions) change who you are; there is also no sense that it can ever be too much to recover from (eventually). Eventually, your karma will catch up with you, sending you to heaven or hell, and making it more difficult to accumulate further good or bad karma, until you usually wind up right back where you started, somewhere in the middle. Something like the law of diminishing returns; the better or worse your rebirth, the harder it is to make further corresponding karma.\nAt any rate, given the infinitude of samsara, there is no such thing as too late; if there is time to accumulate good or evil, there is also time for its effects to wear off.\nSee the Assu Sutta, SN XV.03:\n\nFrom an inconstruable beginning comes transmigration. A beginning\n  point is not evident, though beings hindered by ignorance and fettered\n  by craving are transmigrating & wandering on.\n\n", "karma - Role of belief in Buddhism": "\nYou don't need to believe anything in Buddhism, but a little faith can give you a boost in your practice. It would certainly be difficult to progress if you had no sense that the people teaching you knew what they were talking about.\nBut in the end, a good teacher will just tell you \"This is the path to enlightenment\", rather than \"I am enlightened\", and leave it up to you to discover the veracity of their claim.  \nCertainly, once you practice according to the Buddha's teaching, you will gain understanding about reality that will allow you to verify that karma and enlightenment are very real.\n", "theravada - How to combine Orthodox Christianity and Buddhism?": "\nOkay, for the purpose of providing an answer, I've gone to this site:\nhttp://www.antiochian.org/whatorthodoxbelieve\nwhich, correct me if I'm wrong, seems to present the views of the Eastern Orthodox church, from their POV.\nThe only thing I can see as being a problem, would be the phrase, taken a bit out of context from Timothy:\n\n\"From such withdraw yourself' (1 Timothy 6:5). \n\nsaid to refer to cults. The actual passage (KJV) is:\n\nPerverse disputings of men of corrupt minds, and destitute of the truth, supposing that gain is godliness: from such withdraw thyself. \n\nObviously, it is up to the person doing the interpreting as to whether or not Buddhism is \"destitute of the truth\", and whether that would then be enough to require you to \"withdraw thyself\".\nEither way, your question is actually about strategy, so, given the assumption that you don't really care what the church has to say as long as you aren't subject to their censure, I imagine it would be enough to just not speak about it to them. I don't assume you'd be found out otherwise.\nIt's really the best, I think; speech that is unpleasant, e.g. telling a devout Christian that you are participating in what they view as a cult, should only be delivered with care. (See the Abhaya Sutta, MN 58, for a discussion of unpleasant speech).\nSo, td;lr: unless you think you can convince your fellow Christians that you are not really committing sin by participating in Buddhism, best would be to just avoid mentioning it. Or, you know, leave Christianity and become Buddhist ;)\n", "history - When were women first welcomed into Buddhist orders?": "\nAccording to the texts (Cv 10), after the Buddha returned to visit his father in Kapilavatthu, his aunt and step-mother, Mahapajapati Gotami, followed him back to Vesali and eventually ordained her using the eight garu dhammas as her higher ordination. He then gave the injunction that the male monks were to ordain the female monks, which was the beginning of the bhikkhuni sangha.\n\n1. Now Mahā-pajāpatī the Gotamī went up to the place where the Blessed One was, and bowed down before him, and stood respectfully on one side. And, so standing, Mahā-pajāpatī the Gotamī spake thus to the Blessed One: 'What course, Lord, should I pursue towards these women of the Sākya clan?'\nThen the Blessed One taught Mahā-pajāpatī the Gotamī and incited her, and aroused her, and gladdened her with religious discourse; and she, so taught, incited, aroused, and gladdened, bowed down before the Blessed One, and keeping him on net right hand as she passed him, she departed thence.\nThen the Blessed One, in that connexion, delivered a religious discourse, and said to the Bhikkhus, 'I allow Bhikkhunīs, O Bhikkhus, to receive the upasampadā initiation from Bhikkhus.'\n2. Now those Bhikkhunīs said to Mahā-pajāpatī the Gotamī: 'Neither have you received the upasampadā initiation, nor have we; for it has thus been laid down by the Blessed One: \"Bhikkhunīs are to be initiated by Bhikkhus.\"'\nThen Mahā-pajāpatī the Gotamī went to the venerable Ānanda, and [repeated their words to him]. And the venerable Ānanda went to the Blessed One, and [repeated them to him].\n'In that moment, Ānanda, when Mahā-pajāpatī the Gotamī took upon herself the Eight Chief Rules, that was to her as the upasampadā initiation.'\n-- Cv 10.2 (Rhys-Davids, trans)\n\n", "enlightenment - What exactly is Jhana?": "\nOriginally in Hindu yoga and Jainism, Jhana/Dhyana was deliberate thinking on a given topic.\nThe word seems to share its root with Sanskrit verb \"dhyayati\" (pronounced JAH-YA-TEE), that supposedly means \"to think over\", \"to imagine\", \"to visualize\".\nJains, the primary contenders for a honorary title of \"precursors to Buddhism\", used to recognize four types of Dhyana:\n\nArtta Dhyana -- serious mulling over problems and issues coming from one's duties and responsibilities\nRudra Dhyana -- cruel mulling over evil plans\nDharma Dhyana -- rightful mulling over virtuous subjects\nShukla Dhyana --  pure mulling, non-conceptual concentration.\n\nApparently, Buddha's first teacher, Arada Kalama, taught Shukla Dhyana through visualizing oneself in the center of progressively empty context (village --> empty field --> empty sky --> nothingness), culminating in a state of thoughtless concentration with no content.\nWhile Buddha's second teacher, Udraka Ramaputta, supposedly taught him a different practice, that of deliberately thinking the opposite thoughts (so-called \"antidotes\") to the ones the mind was dominated by, the target state being one of perfect ambiguity.\nBuddha famously mastered and then rejected both target states, instead proposing his own progression of dhyana themes, targeted at achieving first a disgust of this body with its lowly interests, then, once the poisons of worldly desires were destroyed by the antidote of disgust, at generating a joyful mind (first with discursive support, then directly), followed by a calm-and-positive mind, and finally an unfettered mind that sees things as they are (tatha). He subsequently replaced disgust of this body with mindfulness of breathing as the object of meditation he recommended to entry-level students.\nA state of having mastered an ability to freely enter into and maintain the first of these states (joyful mind with discursive support) is called \"the first jhana\".\nA state of having mastered an ability to freely enter into and maintain the second state (joyful mind without discursive support) is called \"the second jhana\" and so on.\nIn this case the word \"jhana\" has a more specialized meaning of \"level of mastery of Buddhist meditation\" rather than \"meditation\" in general.\n", "pratityasamutpada - What exactly is the logical relation between the links in the twelvefold chain of Pratītyasamutpāda?": "\nAs I understand, the relationship is that of mutual implication. This meaning is reflected in the name pratitya-samutpada, that is often translated as \"dependent co-arising\" and such.\nMutual implication means one of the categories serves as context for the other and the other way around. Top is defined against bottom and vice verse. Life is defined against death and vice verse. This (upclose) is defined against That (far). Subjective is defined against Objective.\nThe twelve nidanas are meant to explain the emergence of the notion of Death by implication from Birth, of Birth by implication from Identifying with Separate Being, of Identifying with Separate Being by implication from Goal-making, of Goal-making by implication from Temporal Projection, of Temporal Projection by implication from Sensation as Result, of Sensation as Result by implication from Contact, of Contact by implication from Doors onto the world, of Doors onto the world by implication from Objects, of Objects by implication from Recognition, of Recognition by implication from Imprints, of Imprints by implication from Ignorance.\n", "reference request - Where is the Buddha originally quoted as saying \"On heaven and earth, I alone am honored\"?": "\nThe Pali version isn't quite as strong. According to Malalasekera:\n\nImmediately after birth the Bodhisatta stands firmly on his feet, and having taken seven strides to the north, while a white canopy, is held over his head, looks round and utters in fearless voice the lion's roar: \"Aggo 'ham asmi lokassa, jettho 'ham asmi lokassa, settho 'ham asmi lokassa, ayam antimā jāti, natthi dāni punabbhavo” (D.ii.15).\nhttp://www.palikanon.com/english/pali_names/b/buddha.htm\n\nThe meaning of the phrase is \"I am the highest in this world; I am foremost in this world; I am the best in this world; this is the last birth; there is no further becoming here.\"\nNothing I've found specifying heaven and earth; it also doesn't seem proper for the Bodhisatta to have said \"I alone am honoured\", since it is patently untrue.\n", "Do you have to follow a monastic lifestyle to attain enlightenment?": "\nDo you have to follow a monastic lifestyle to attain enlightenment? At first approximation, the answer is: yes in Theravada, no in Mahayana.\nSince probably as early as Milindapanha (~100 BCE) and most certainly by the time of Vissudhimagga (~430CE), the orthodox (~Theravada) position was, you must be a monk to attain Nirvana.\nBut since you asked about Enlightenment, I should point out that Enlightenment is the goal of Mahayana, while in Theravada, the final goal is usually called Nirvana (Nibbana in Pali), not Enlightenment (Bodhi in Pali). In Mahayana, Enlightenment can be attained by a layperson.\nThese are \"official\" positions (as much as we can talk about official positions in such a heterogeneous conglomerate of teachings as Buddhism). Informally, in my own understanding, what some Mahayana schools call \"Enlightenment\" is what Theravada schools call mere \"stream-entry\". Other Mahayana schools however have this notion of multiple levels (bhumi), in which what Theravada calls \"stream-entry\" is level 1 of 10, with Final Enlightenment counted as 11th. It kinda gets complicated from \"stream-entry\" onward, because the boundaries of \"self\" no longer apply, so it is difficult to talk about Enlightenment with no subject to tie it to.\nAnyway, from practical perspective, the point is, it is extremely difficult to make any meaningful progress towards Enlightenment/Nirvana if most of your focus is on pursuing material ends (success, wealth, entertainment, helping your relatives achieve the same). In order to get pretty close to X while leading a semi-normal life, one's top priority must be spiritual practice, followed by family and everything else. This basically means, squeezing study of Buddhist philosophy here and there, making meditation part of your daily routine, and, most importantly, deliberately utilizing your family & work situations as shootingrange for Dharma practice.\n", "anatta - If there is no soul, how can there be rebirth?": "\nWhen most people think of \"self\" they think of some abstract core that is the subject of all experience and the agent of all actions. Buddha taught (and modern cognitive science tends to agree) that upon careful examination there is no such single core. Instead experiences result from interactions of multiple perceptory functions. Similarly, our actions are performed by a conglomerate of functions, without a single agent responsible for all choices.\nWhen the notion of individual rebirth exists as an unexamined belief, it depends on this unexamined notion of \"self\" as its necessary foundation. Once practitioner is free from illusion of self (in practice, not just conceptually), the notion of individual birth/death/rebirth no longer applies. From this perspective, rebirth is a byproduct of attachment to a (substantial) self.\nBut because karma at large still continues to function, the infinitely forking/joining threads of causation that once were the subject of attachment continue to participate in activity and serve as causes for subsequent effects. In this sense, rebirth as principle goes on continuously whether we posit an individual or not.\nTo give this a more practical spin, instead of worrying about rebirth, we practitioners should focus on working towards deconstruction of self by reducing the strength of the illusion through practice of altruism and non-attachment, first and foremost at the microscopic level of thought-to-thought intention and reaction.\n", "philosophy - How do we sense the flow of time?": "\nPast is a conceptual construct that only seems solid in the absence of careful examination. But if you look closely you will see that Past is assembled by the mind from multiple cues (as is Present by the way).\nThe experience of second-to-second flow of time is a byproduct of chitta-vrtti, the associative cycle, when each subsequent dharma (~thought) comes by association with the previous one. The sense of relatedness of the two dharmas is what creates the illusion of flow.\nDisclaimer: this answer represents my own experience and understanding and is not meant to reflect an official position or to be consistent with views of any Buddhist school.\n", "belief - Are there formal mechanisms in any Buddhist institutions that explicitly reconcile Buddhist principles with science?": "\nThe general claim in Buddhism, or at least in Theravada Buddhism, is that a Buddha is omniscient. That makes it difficult to question what the texts claim the Buddha himself said. In a couple of places this seems to put science and Buddhism at odds (e.g. causes of earthquakes).\nThe closest we have to what you are suggesting is an act of the sangha; after the Buddha passed away, we have record of a Buddhist council where they discussed whether to revoke the minor monastic rules as the Buddha had allowed them to do, and they decided as a group not to. Later sangha councils edited the canonical texts but would never have redacted something that they thought the Buddha had said in error.\nI think, at the very least, unlike faith-based religions, Buddhism doesn't rely on absolute statements of truth, but rather practices that lead to self-realization; so it doesn't matter as much if statements in the canon like the causes of earthquakes and the size of the universe, etc., are accurate. What matters is if the path leads to the goal, and that is to be verified by oneself.\nAs a result, you find more marginalizing of problematic teachings, rather than striking them out. First of all, because the Buddha was said to be infallible, but second of all because we know that we are not. The fear of wrongly striking a teaching out of ignorance is too great. But, we can always ignore troubling passages, I guess similar to how Jewish people ignore Leviticus for the most part.\nSo, no, there isn't really such a mechanism, afaics.\n", "history - What is the role of relics in Buddhism?": "\nAfter The Buddha's death, his ashes are said to have been divided into eight portions. Source:Wikipedia\n\nThe cause of arising of the Buddha’s relics was from the desire of our Lord Buddha before his Parinibbāna (the Great Decease of the Buddha).\nNormally, the Buddha who lived a long life to settle the Buddhist Legend, had his own relics in a piece of natural golden bar, which could not be shared among the people in their Buddha period and could not be placed anywhere. Hence the construction of the Buddhist sanctuary was required to be done in one place only. Our present Lord Buddha (Sakyamuni Buddha) considered that his teaching period was only 45 years which he thought not too much compared with the previous Buddhas. He also thought that his instructions were not expanded enough and taught to those who were not yet born on time in his legend. Anyone who received his relics for respecting would get a lot of Puñña (the accumulation of good blessing, fortune or well-being) so he wished that his relics be scattered to all directions except 7 pieces (1 frontal bone, 4 teeth and 2 collarbones).\nAll of the above mentioned information was presented identically such as in the Sumaṅgalavilāsinī, Paṭhama Sambodhi Kathā by the Supreme Patriarch Kromphra Paramānujitajinorasa, Mulasāsanā Scripture, Jinakalamalipakaranam by Ven. Ratanapañña Thera and Phrachaolieplok Scripture.\n\nSource:The history of the arising of Buddha’s relics\nIf you want to know more depth details, Please read Maha-parinibbana Sutta: Last Days of the Buddha\n\nEight portions there were of the relics of him, The All-Seeing One, the greatest of men. Seven in Jambudipa are honored, and one In Ramagama, by kings of the Naga race. One tooth is honored in the Tavatimsa heaven, One in the realm of Kalinga, and one by the Naga kings. Through their brightness this bountiful earth With its most excellent gifts is endowed; For thus the relics of the All-Seeing One are best honored By those who are worthy of honor — by gods and Nagas And lords of men, yea, by the highest of mankind. Pay homage with clasped hands! For hard indeed it is Through hundreds of ages to meet with an All-Enlightened One!\n\n", "Are Vajrayana and Tibetan Buddhism the same thing?": "\nNo they are not the same, Tibetan Buddhism is a broader concept that subsumes Tibetan Vajrayana. Also, there's non-Tibetan Vajrayana, some still practiced in e.g. Japan. \nTo some degree all schools of Tibetan Buddhism, and particularly Karma Kagyu, recognize three yanas (Hinayana, Mahayana and Vajrayana) as subsequent stages on an individual's path to complete enlightenment. These days many teachers tend to have their student jump straight into tantra right after Ngondro (preliminary stage of Vajrayana training), but traditionally, the student is supposed to master the foundational theory, discipline, and meditation of Hinayana before proceeding to Mahayana, then master Mahayana's practice of subverting one's ego, and attain realization of nonconceptual emptiness, and only then proceed to tantric practices of working with Yidams (generation/completion), the Vajrayana proper.\n", "doctrine - Buddhism, mothers and earthworms": "\nI'm pretty sure the belief is not that earthworms become mothers, it's that every earthworm has most likely been your mother at some point in the past, as per the mata sutta (SN 15.14-19):\n\nAt Savatthi. There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. A being who has not been your mother at one time in the past is not easy to find... A being who has not been your father... your brother... your sister... your son... your daughter at one time in the past is not easy to find.\n\"Why is that? From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. Long have you thus experienced stress, experienced pain, experienced loss, swelling the cemeteries — enough to become disenchanted with all fabricated things, enough to become dispassionate, enough to be released.\"\n\nSo, the point is that the love and care we have for our mothers should really extend to all beings, since we are all intimately related - a corollary is that your boy/girlfriend has also probably been both your mother and your father at one point :)\n", "belief - What is the starting of Samsara?": "\nIs there a starting point to a circle? Just like that, there's no starting life to Sansara. But you can break this circle at 2 points. \n\nIgnorance.\nCraving.\n\nThat is when you attain Nibbana.\n", "pratityasamutpada - Learning materials for Dependent Origination (Paṭiccasamuppāda) in Theravada Buddhism": "\nHere's a few of resources from our tradition:\nhttp://www.aimwell.org/dependentorigination.html - a book by the Mahasi Sayadaw, one of Burma's greatest meditation teachers\nhttps://www.youtube.com/watch?v=n_llBSCXt6c - a video by me, some monk from the Internet\nhttp://www.sirimangalo.org/teachings/lessons-in-practical-buddhism/practical-dependent-origination/ - a written piece based on the above video.\nYou'll find a lot of stuff centring on the debate over three-life/one-life, which is terribly unhelpful, IMO. Here's a piece I appreciated from one of Thailand's top scholar monks:\nhttp://www.dhammatalks.net/Books3/Payutto_Bhikkhu_Dependent_Origination.htm\nEdit: here's something I wrote about practical application of PS:\nhttp://yuttadhammo.sirimangalo.org/2009/07/three-teachers-or-buddhist-addiction.html\n", "What's the value or harm of a literal belief in rebirth?": "\nI think you're right to question the importance of rebirth; the Buddha himself didn't seem to dwell on the concept, though remembering one's past lives does have obvious practical benefits - lots more experience to draw upon :)\nBhikkhu Bodhi wrote a couple of things about the subject you might find interesting:\n\nDhamma Without Rebirth?\nDoes Rebirth Make Sense?\n\nAs he says in the first link,\n\nIf we suspend our own predilections for the moment and instead go directly to our sources, we come upon the indisputable fact that the Buddha himself taught rebirth and taught it as a basic tenet of his teaching. Viewed in their totality, the Buddha's discourses show us that far from being a mere concession to the outlook prevalent in his time or an Asiatic cultural contrivance, the doctrine of rebirth has tremendous implications for the entire course of Dhamma practice, affecting both the aim with which the practice is taken up and the motivation with which it is followed through to completion.\n\nI've talked about the subject before myself, and the conclusion I make is that it's not that Buddhists believe in rebirth, it's that we don't believe in death - the latter being merely a concept referring to the change from one set of experiences to another. True death only occurs either at every moment or at the experience of nibbana.\nIn any case, as useful as rebirth may be in reminding us of what's really at stake in our dhamma practice, far more useful is an understanding of the present moment, something that really has little to do with past or future lives.\n", "What is required to achieve Nirvana in Buddhism?": "\nTo answer your question let me draw an analogy. What is required to become a professor?\nAccording to Wikipedia, \"A professor is a highly accomplished and recognized academic, and the title is in most cases awarded only after decades of scholarly work to senior academics\". Being a professor is not a concrete state, it is a label they put on years of hard work, culminating in professional realization.\nSimilarly, Nirvana is not a concrete state, it is a common name for the condition of a highly accomplished spiritual practitioner. This condition is not something you can contrive knowing the requirements, it is a result of years of personal transformation.\nNirvana can be characterized as condition of having transcended suffering & death. The requirement for this is said to be a complete cessation of Attraction (obsessing over something as desirable), Rejection (obsessing over something as undesirable), and Ignorance (mistaken understanding of how everything works). One of the key components of Ignorance is a deeply lying conviction in existence of substantial self and a tangle of reflexes that grow around that. Much of Mahayana practice is targeted at destroying this belief, not just at conceptual level, but at the level of basic day-to-day instincts.\nIf we could simplify the requirement for becoming a professor to \"complete cessation of ignorance in the field of study one specializes in\", we could perhaps make a stretch and define Nirvana as \"complete cessation of ego complex, along with negative experiences and behavioral tendencies it generates\". As any simplification, this is not entirely accurate: just as becoming a professor requires tons of practical skill and experience outside of the primary field of study, attaining Nirvana requires cessation of all mental and emotional obscurations, a tendency to get stuck on anything, not just on self.\nNow, for the purposes of this discussion I'm equating Nirvana with Enlightenment, which depending on a school may or may not be the right thing to do. Specifically in Mahayana, Nirvana is considered a conceptual projection (a shadow of ego so to speak) that has to be transcended as part of awakening to Self-Existing Buddha Nature (=Enlightenment).\n", "What are the main differences between the Theravada, Mahayana and Vajrayana branches of Buddhism?": "\nThis question, indeed, requires a whole book in order to be answered completely. Let me address only Theravada and Mahayana here.\nIn two words:\n\nThe most important aspect is that Theravada is focused on your own liberation from suffering, while Mahayana is targeted to all sentient creatures;\nThere are many consequences here:\n\nTheravada assumes that you have to practice for yourself, while others can only suggest you. Mahayana says that you can (and have to) share your experience and accomplishments with others, thus making followers for yourself;\nTheravada suggests to seek enlightenment for yourself first; Mahayana is up to delaying breaking off Samsara in order to help others;\nTheravada practices are mostly silent and very personal while in Mahayana it is more often \"wrapped\" in some collective rituals like chanting;\n\nIn Theravada, the final goal for a Bodhisattva is nirvana. In Mahayana, prominence is important by itself;\nEach teaching is more or less localized, e.g. at a certain country/territory there's usually only one;\nIf you'd like to read scriptures in original language, you should be aware that Theravada is written in Pali (Pali Cannon) while Mahayana is written in Sanskrit (Sutras);\n\nOf course, there are also big differences in texts, ritual, etiquette, and so on.\nThis Comparative Study between two traditions provide with greater details.\n", "Does rebirth or reincarnation occur in Buddhism?": "\nDisclaimer: My answer to this will be non-exhaustive. My answer will be scoped as close to that of the question as possible. (General). I will also answer your question (which is actually 4) piece by piece.\n\nYou asked:\n\nDoes reincarnation/rebirth occur in Buddhism?\n\nYes it does. The concept of rebirth and reincarnation in Buddhism is complex and can differ slightly or largely from tradition to tradition however.\nYou asked:\n\nWill everyone be reborn?\n\nEvery sentient being (people, animals, etc) is in a cycle of rebirth. They will all be reborn after death. The only exclusion to this will depend on the tradition. Most traditions, in a general sense, state that one may leave the cycle of rebirth if they attain enlightenment or nirvana. This is only possible when you are a human, though. \nYou asked:\n\nAre people always reborn as people?\n\nThe answer is no. Please see next section of this answer for elaboration.\nYou asked:\n\nHow is rebirth/reincarnation handled in Buddhism?\n\nIn Buddhism, there exists the concept of Samsara. This is the continuous cycle of rebirth throughout six different realms. These realms include the realm of Gods, Titans, Hungry Ghosts, Hell, Animals, and Humans. One may be considered more preferable to another, for example Gods to Hell, yet all are imperfect and involve some level of suffering. Depending on past lives and karma, one will move from realm to realm during each rebirth. The Human realm is generally considered to be the best because it is the only one in which one may obtain enlightenment and exit from this wheel of Samsara and therefore end the cycle of rebirth and suffering.\nFor more information, you may find this article to be useful.\n\nSide Note: My professor of Eastern Religions once told me that being in this cycle of rebirth can be a great source of anxiety, hence one source of motivation to exit from it.\n", "learning materials - Introductory books to Buddhism": "\nFirst off, I wouldn't recommend Tibetan Book of the Dead, since it's not exactly a primer in Buddhism, I don't think. There are lots of introductions from various traditions; the perennial favourite is What the Buddha Taught by Walpola Rahula. He's also written pieces on the difference (or lack thereof) between the various schools, so he's pretty unbiased that way.\nIndian Buddhism by A.K. Warder is a great in-depth look at how Buddhism evolved, though like everything by the author it is terribly dense.\nBhikkhu Bodhi is another modern author who has some good resources; his introductions to the nikayas, e.g. in The Middle Length Discourses of the Buddha, are well-done. He also has an audio series on-line about the same that seems well-received.\nI guess I'd be careful about modern sources either from the West or East as an introduction, since without a solid background, it will be easy to become swayed by skewed teachings. Reading the words of the historical Buddha himself would most likely help to provide such a background. Again Bodhi's translations are a good choice.\n", "The spiritual significance of the sand mandala in Tibetan Buddhism": "\nAccording to The Tibetan Monks of Drepung Gomang Monastery\n\n\n\nWhen finished, to symbolize the impermanence of all that exists, the colored sands are swept up and poured into a nearby river or stream where the waters carry healing energies throughout the world.\n\n\nIn general, all mandalas have outer, inner, and secret meaning.  On the outer level they represent the world in its divine form; on the inner level, they represent a map by which the ordinary human mind is transformed into the enlightened mind; and on the secret level, they predict the primordially perfect balance of the subtle energies of the body and the clear light dimension of the mind.  The creation of a sand painting is said to affect purification and healing on these three levels.\n\n\n\n", "What is the purpose of using a wand to hit a monk in Zen meditation?": "\nSupposedly it is used to help meditator fight drowsiness. It is said that drowsiness comes from stiffness, from meditator trying to artificially restrict their micro-movements and to severely narrow their scope of attention. While right concentration is said to feel open and flexible, with body actively balancing in meditation posture and attention wide open (but not engaged nor scattered). When supervising monk sees somebody nodding, he reminds meditator of the need to expand their awareness, by gently \"massaging\" the shoulder with the stick :)\n", "What is the difference between rebirth and reincarnation?": "\nReincarnation implies a soul that takes a body; rebirth does not, so it is preferred.\nNote that neither term has a widely used cognate in the Pali texts, perhaps because the concept of \"re-\" anything implies the continuation of an entity. Buddhism tends to talk about birth and death in a more linear fashion; rather than being reborn, it's \"being born again\" (e.g. dukkhā jāti punappunaṃ).\nFurther, the focus in Buddhism is on individual mind states and ultimate reality rather than the conceptual reality of birth and death, so it's not really a core teaching. Death is a concept; at the moment of a being's death, one body/mind experience ceases and the next one arises, just as it did through the entire life.\n", "terminology - What, precisely, is kamma/karma?": "\nThere are two main interpretations of how karma is accumulated.\nIn Sarvastivada branch of philosophy, past actions can be directly related to new consequences, because fundamentally \"everything exists\" and only the modus of time changes. As things aren't losing the status of existence, they can cause new things. There is a special additional property (called prapti) to relate or un-relate action to the stream of consciousness. So when you perform an action it doesn't need anything else to be able to cause karmical fruit. (Of course it requires other conditions to work.)\nIn Sautrantika branch of philosophies, actions are accumulated by means of traces (bija-vasanas) in some sort of storehouse consciousness (alaya-vijnana). It works similarly to when you plant the seed of a tree into the ground; the seed disappears but the tree still contains the ability to ripen into certain fruits. Thus, action could be accumulated in something completely different from the action itself. So when you act, you actually change yourself as a whole in a way that accumulates the potential to acquire karmic fruit.\nYes, intention is kamma, but there are two types of kamma (SN 35.145) old kamma and new kamma. Where new kamma is intention (as thinking) and what-is-after-intention (actions of speech and body), while old kamma is your body as whole (i.e. the totality of all organs). In that way you have your old kamma always with yourself in your body (including all organs of perception and intellect).\n", "nirvana - Is it harmful to the Buddha when we request he or she to continue teaching instead of entering parinirvana?": "\nAs I pointed out in my answer to \"are earthworms our mothers?\"  these kind of questions often assume incorrect frame of reference. The reason we request Buddha (or our local teacher as Buddha's substitute) to continue teaching instead of entering parinirvana, is not because it can literally make Buddha (or teacher) change their mind and stay. The idea is to create a mental context in which A) the teacher feels motivated to continue teaching because he sees the teaching is in demand, B) the students stay aware of the fact that existence of the teaching in this world depends solely on Buddha and then generations of teachers passing it to one another, and now to the students, and C) the student clearly realizes that the teacher could very well leave this place but is instead making effort to stay and teach solely out of compassion for the students. When this context is established the teaching can happen effectively, because both the sides will engage actively and with no resistance.\nGranted these are entry-level practices, but they are very important to establish as foundation. Otherwise what happens if you skip straight to advanced teaching, the student may get as arrogant as to metaphorically grab the teacher by the hair and swing around. Needless to say, it hurts the student first and foremost.\n", "Do Arhats slp? - Buddhism Stack Exchang": "\nAccording to the teachings I received, once the practitioner attains certain level of mastery in meditation, their sleep acquires a character of meditation. It's not like they don't sleep at all, but they do retain certain level of deep awareness during their sleep.\nSpecifically, when they see a dream, they know it's a dream. They remain aware of their body lying down on the bed. They remain aware of the content of their consciousness no matter how disjointed it gets during a deep sleep. If something happens around them, they wake up easily to provide their help if needed.\n", "What are the major sects of Buddhism?": "\nMahayana is not a sect at all; it is a vehicle.\nMajor traditions in Buddhism are usually country or region related. We can distinguish three major branches of Buddhism in the World by what they keep as canon.\n\nTibetan, Mongolian, and Russian Buddhism share Tibetan canon.\nChinese, Japanese, and Korean Buddhism share Chinese canon.\nSri Lanka, Burma, Thailand, etc share Pali canon.\n\nSome countries mix several aforementioned branches.\n", "sects - Is there an Orthodox Buddhism?": "\nWell, Theravada is often argued to hew most closely to the original teachings of the Buddha. See, e.g. \"Two Main Schools of Buddhism\" for a very brief overview of this. \nAs I understand it, this has much to do with the fact that Theravada is the oldest of the extant Buddhist schools of thought, predating Mahayana by a few centuries. Theravada practice is also more localized to geographic regions nearer the birthplace of Buddhism (that is, Sri Lanka and Southeast Asia), and never strayed far from it; this is thought to have contributed to the \"orthodoxy\" of the school - it mixed less with other intellectual and spiritual traditions.\nAdditionally, Theravada Buddhists draw primarily on the Pali Canon (the Tripitaka), whereas Mahayana Buddhists draw primarily on Chinese sources. These Chinese sources are relatively more distant from the original teachings of the Buddha in terms of both time and language. As a byproduct of this, the Pali texts are often more \"authentic\".1\nThat said, the term \"Orthodox\" has no specific meaning in the context of Buddhism, i.e. there is no such school as \"Orthodox Buddhism\". There are only lowercase-o \"orthodox schools of Buddhism\", and what counts as \"orthodox\" will probably differ depending on who you ask. I should add that pre-sectarian Buddhism is almost definitionally the most \"orthodox\" school of Buddhist thought. The only problem is that, well, it doesn't exist anymore.\n\n1 See, e.g. Rupert Gethin's The Foundations of Buddhism, p. 44: \"it is likely that [it] is generally the case [...] that the traditions [the Pali recension] preserves are [...] the oldest and most authentic available to us\" (elisions/etc because the original sentence was inverted)\n", "Does studying mathematics or science lead to a practitioner of Buddhism acquiring wrong philosophical views and mental afflictions?": "\nIf you are looking for enlightenment you should be concerned of not being attached to these studies, or averse to what you disagree. The same fits to Buddhism itself, you should't become absorbed, or obsessed, to the Dharma.\nAll philosophies are mental phenomena, they aren't either good or bad in themselves. But they can hinder your search for enlightenment if you are too concerned about them.\nMath and science share a side of problem elaboration and solving. So it would contradict Buddhism if you enjoy or think it is meaningful to be worried about all those problems. Over-thinking about anything and having a heavy attitude over theories or facts are opposite to the practice of meditation.\nThe point of meditation is to not being absorbed to mental elaborations. So there is no sense to think all over a sitting session. Then this extends to daily life, there is no sense to have a sharp and clear mind when meditating and daydream in the rest of the time.\nFor short, the point isn't what phenomena you engage, but it's how you engage to phenomena. If you can elaborate on any philosophy in a detached way it wouldn't be a problem at all. So the practice would be to think while being present and aware. (yes, this one is quite paradoxical)\n", "five precepts - Is killing vermin and insects justifiable?": "\nThe beauty of the precepts is that they are impossible for ordinary human beings to fully observe.  The precept against killing is an example of this. My body's immune system kills all lifeforms that it doesn't recognize.  I step on and crush innumerable microorganisms.  But the first precept asks us to minimize the amount of harm we do in the world.  In the teachings of Thich Nhat Hanh, the precepts are trainings, not commandments.\n", "iconography - Why should we worship statues of Lord Buddha?": "\nI am not sure we should worship statues itself as that would be some sort of idolatry. Buddhists worship Buddha, and statue or other image is just symbol, something that bring into our memory good qualities of Buddha. It's mindfulness of Buddha. Statue is a symbol, and symbol is communication which states about its subject, Buddha in our case. Thus, showing respect before statue should be directed to Buddha as Jewel, and not to statue. Mindfulness and respect to the Saint and Teacher is good action.\nBtw, Buddha is not disappeared, he stated that he will remain in his Teaching (Dharma).\n", "Are there any differences in karma?": "\nThe difference will always be the mental state of the person performing the action. Giving is dependent on one's state of mind while giving; the amount is intrinsically inconsequential (though obviously a poor person will feel more strongly about giving $1000 than giving $1). As Sakka, king of the devas of Tavatimsa says in the Vimanavatthu:\n\n\"Natthi citte pasannamhi, appikā nāma dakkhiṇā;\nTathāgate vā sambuddhe, atha vā tassa sāvake\"ti. (vi. va. 804);\nThere is not, when the mind is confident, such a thing as a small gift,\nIn regards to a Tathagata, fully enlightened Buddha or, furthermore, his disciples.\n\nGiving to the Buddha is considered to be of greater merit, not because of the benefit to the Buddha, but because of the ability to inspire faith and confidence in the giver.\nAs for killing, the mental state involved in killing large animals is generally more intense; also the sense of the weight of the act is greater, so the mind will be more strongly affected by it. Killing virtuous people, parents, etc. is even worse, because it sets one squarely against virtue.\nBut there is no hard and fast rule here either; if you obsess over killing a single mosquito buzzing over you at night, you may cultivate more unwholesomeness than a single act of killing a larger animal.\nFurthermore, karma isn't a single act of killing; it may be cultivated every moment; every thought concerning a moral or immoral act is karmically potent, so it's imprecise to ask if x or y is good or bad, better or worse, since karma is only a single thought moment at a time, and thus the potency depends upon the nature of the individual mind states.\n", "What is the role of karma in rebirth?": "\n\nIn reincarnation, an individual's karma results in a better or worse\n  next life for their soul. But in rebirth, there is no soul. So why\n  should we care about our karma regarding our rebirth?\n\nThere is no Soul, but still there is consciousness. All suffering we are experiencing now  (in this life) is caused by past unwholesome deeds. So why cause suffering for future life? Yes, that person will not know about us, but still his consciousness will be in our stream of consciousness, related to ours, and even though we will not know why, we will suffer (or enjoy fruits of wholesome deeds).\nDifferent argument. Basically, consciousness in our current life is as changing as between the lives. So, from this point of view, there is no difference when to suffer (or enjoy) - in the future of this or next life. If you don't want to suffer in this life why would you cause suffering in the next?\n", "rebirth - What is it that is re-incarnated ?": "\nThere is neither not self nor self.\nThe five aggregates; form, sensation, perception, mind formations and consciousness; disperse at death.\nConsciousness is life-force. By itself it is without physical form, all types of mental habits, thoughts, ideas, prejudices, compulsions, decisions, familiarity and judgement as to whether an object is pleasant, unpleasant or neutral.\nThe stream of consciousness passes from one life to another; during this process it is not entirely the same nor entirely different. With the cessation of consciousness samsara ceases.\n", "laws - Buddhist teachings on nation building & politics": "\nThe clearest example of this that I can think of is in the Mahaparinibbana Sutta (DN 16) where the Buddha was asked (obliquely) by the brahman Vassakara on behalf of King Ajatasattu whether he had a chance at killing off an enemy nation. The Buddha replied with the seven \"Conditions of a Nation's Welfare\":\n\nAt that time the Venerable Ananda was standing behind the Blessed One, fanning him, and the Blessed One addressed the Venerable Ananda thus: \"What have you heard, Ananda: do the Vajjis have frequent gatherings, and are their meetings well attended?\"\n\"I have heard, Lord, that this is so.\"\n\"So long, Ananda, as this is the case, the growth of the Vajjis is to be expected, not their decline.\n\"What have you heard, Ananda: do the Vajjis assemble and disperse peacefully and attend to their affairs in concord?\"\n\"I have heard, Lord, that they do.\"\n\"So long, Ananda, as this is the case, the growth of the Vajjis is to be expected, not their decline.\n\"What have you heard, Ananda: do the Vajjis neither enact new decrees nor abolish existing ones, but proceed in accordance with their ancient constitutions?\"\n\"I have heard, Lord, that they do.\"\n\"So long, Ananda, as this is the case, the growth of the Vajjis is to\nbe expected, not their decline.\n\"What have you heard, Ananda: do the Vajjis show respect, honor,\nesteem, and veneration towards their elders and think it worthwhile to\nlisten to them?\"\n\"I have heard, Lord, that they do.\"\n\"So long, Ananda, as this is the case, the growth of the Vajjis is to\nbe expected, not their decline.\n\"What have you heard, Ananda: do the Vajjis refrain from abducting\nwomen and maidens of good families and from detaining them?\"\n\"I have heard, Lord, that they refrain from doing so.\"\n\"So long, Ananda, as this is the case, the growth of the Vajjis is to\nbe expected, not their decline.\n\"What have you heard, Ananda: do the Vajjis show respect, honor,\nesteem, and veneration towards their shrines, both those within the\ncity and those outside it, and do not deprive them of the due\nofferings as given and made to them formerly?\"\n\"I have heard, Lord, that they do venerate their shrines, and that\nthey do not deprive them of their offerings.\"\n\"So long, Ananda, as this is the case, the growth of the Vajjis is to\nbe expected, not their decline.\n\"What have you heard, Ananda: do the Vajjis duly protect and guard the\narahats, so that those who have not come to the realm yet might do so,\nand those who have already come might live there in peace?\"\n\"I have heard, Lord, that they do.\"\n\"So long, Ananda, as this is the case, the growth of the Vajjis is to\nbe expected, not their decline.\"\n\nhttp://www.accesstoinsight.org/tipitaka/dn/dn.16.1-6.vaji.html\nBesides being one of the few examples of the Buddha offering advice on how to run a nation (he was the one who taught the Vajjis these conditions), it also shows how the Buddha never did take sides in political struggle; rather than chastising Ajatasattu, he just taught the dhamma as he always did.\n", "bon - Syllables and Prayers During Guru Yoga": "\nJust the prayer and syllables in question, not the surrounding prayers and other elements of the practice (e.g., the refuge prayer), but this is the prayer that I was thinking of (བླ་མའི་རྣལ་འབྱོར, called the \"lamai naljor prayer\", also transliterated as \"lamé naljor\", or translated as \"Guru Yoga prayer\"):\n\nསྤྱི་གཙུག་བདེ་བ་ཆེན་པོའི་ཕོ་བྲང་དུ།\n  དྲིན་ཆེན་རྩ་བའི་བླ་མ་ལ་གསོལ་བ་འདེབས།\n  སངས་རྒྱས་སེམས་སུ་སྟོན་པ་རིན་པོ་ཆེ།\n  རང་ངོ་རང་གིས་ཤེས་པར་བྱིན་གྱིས་རློབས།\n\nTransliterated:\n\nChi tsuk dé wa chen pö po drang du\n  Drin chen tsa wé la ma la söl wa dep\n  Sang gyé sem su tön pa rin po ché\n  Rang ngo rang gi shé par jin gyi lop\n\nIt has been translated as:\n\nOn the crown of my head, in a palace of great bliss\n  Benevolent root lama, I pray to you.\n  Precious one that reveals that my own mind is Buddha,\n  Bless me to recognize my own true nature.\n\nI have also seen it translated a little more poetically:\n\nFrom the crown of my head, palace of great bliss,\n  I pray to you, benevolent root lama.\n  O precious one, grant me the blessings\n  To recognize my own true nature as a Buddha.\n\nThere is a version of this practice found in Opening the Door to Bön by Latri Khenpo Geshe Nyima Dakpa Rinpoche, in the 5th preliminary practice, \"Connecting With the Teacher\", which provides a virtually identical prayer with a slightly different transliteration and another translation.\nIt also includes a lot of the surrounding details, visualizations, and prayers. This version of the practice is subtly different from the one that I learned, but the bones are very similar if not identical. \nThe three syllables are:\n\nAH – White, Forehead\nOM – Red, Throat\nHUNG – Dark Blue, Mind\n\nThese are Bön-specific seed syllables and other branches sometimes use variations. \nI don't own the book and so can't speak to its contents in any great detail, but Dilgo Khyentse Rinpoche has written a book called Guru Yoga: According To The Preliminary Practice Of Longchen Nyingtik would seem to cover the practice from a different angle. \n", "philosophy - Relationship between Buddhism, Hinduism and Yoga?": "\nHinduism & Yoga aren't 2 different things. They are the same. \nYoga is one of the 6 main Darshanas of Hinduism. I.e it provides it's own path for liberation. Other Darshanas(Advaita, etc) too use Yoga as a valid means but not the only valid means. \nCan't really say Buddhism is modern. It evolved along with Yoga both of which can be traced to around 4th century BCE. \nBoth Hindu Darshanas & Buddhism evolved influencing each other. For example Advaita borrowed some of it's elements from Nagarjuna. Tibetan Buddhism incorporated Tantra which is considered 'Hindu'. \nTibetan Buddhism has it's own version of Yoga called Trul khor.\nHence to answer your question, they all belong to the same family, the Dharmic family and have influenced each other.\n", "hinduism - What Buddhist texts describe the doings of syncretized Hindu deities?": "\nMalalasekera's Dictionary of Pali Proper Names is a great place to find this sort of information; for instance, the entry on Sakka has a whole list of sources for info on the entity, both canonical and commentarial. \nOn the other hand, I can't think of any other divine beings that have been expropriated in the same way as Indra; in fact I'm not sure expropriation is the proper term, since Indra just means \"chief\", and so it could just be the Buddha using the Hindu name to describe Sakka.\nEdit: Yama shows up in the Devaduta Sutta (MN 130)\n", "nirvana - Nibbāna in The Progress of Insight": "\nThis passage is according to the abhidhamma treatment of the attainment of nibbana. The two to three mind moments (yes, that's what it means) are called anulomañāṇa (\"anuloma~naa.na\") - knowledge of conformity, the twelfth stage of knowledge.\nThe Visuddhimagga (XXII.128) describes this according to the abhidhamma:\n\n128. As he repeats, develops and cultivates that equanimity about\nformations, his faith becomes more resolute, his energy better\nexerted, his mindfulness better established, his mind better\nconcentrated, while his equanimity about formations grows more\nrefined.\n129. He thinks, “Now the path will arise.” Equanimity about\nformations, after comprehending formations as impermanent, or as\npainful, or as not-self, sinks into the life-continuum. Next to the\nlife-continuum, mind-door adverting arises making formations its\nobject as impermanent or as painful or as not-self according to the\nway taken by equanimity about formations. Then next to the functional\n[adverting] consciousness that arose displacing the life-continuum,\nthe first impulsion consciousness arises making formations its object\nin the same way, maintaining the continuity of consciousness. This\nis called the “preliminary work.” Next to that a second impulsion\nconsciousness arises making formations its object in the same way.\nThis is called the “access.” Next to that a third impulsion\nconsciousness also arises making formations its object in the same\nway. This is called “conformity.”\n(Path of Purification)\n\nThe next thought moment arising after these three takes nibbaana as an object.\nEDIT: In plain terms:\nThrough the gradual understanding that all formations are impermanent, suffering, and non-self, the meditator attains an absolute certainty of one or another of the three characteristics and this leads to a release based either:\n\nsignlessness - based on impermanence, that there is no telling what will happen in advance; e.g. the rising and falling of the abdomen suddenly speeds up;\ndesirelessness - based on suffering, that there is no benefit to clinging to any formation; e.g. the rising and falling of the abdomen suddenly feels unbearable;\nemptiness - based on non-self, that all formations are void of self and there is no relationship of ownership or control in regards to all formations; e.g. the rising and falling of the abdomen appears to proceed automatically without interference from the meditator.\n\nThis realization lasts two to three thought moments, during which the mind realizes the truth of suffering and discards the truth of the cause.\nThe next thought moment is an experience of cessation, where there is no arising of sense experience (including mental sense experience). This is the realization of path consciousness (the noble truth of the path) because it has the power to destroy fetters and therefore lead to freedom from suffering. It takes nibbāna as an object.\n", "personal practice - Hamstring issues when in a five-point-meditation posture": "\nMaybe the desire to adhere to a particular meditation posture is the problem. If someone got it into their head that to meditate properly, one needed to hold a headstand position, then there's sure to be lots of discomfort to get in the way of the meditation.\nThe purpose of the posture is to reduce bad mental qualities that get in the way of meditation, things like back pain from slumping and not sitting up straight; things like lethargy that comes from lying down.\nYet you need some kind of relaxation to prevent giving the mind food for discursive thought. You can't really meditate while driving because there's too much to be responsible for, not enough room for the mind to calm down.\nSo how comfortable do you need to be before you can settle down? Is it a distracting thought or a legitimate injury you're doing to yourself? If your legs hurt when you sit down, then just stretch them out and go back to the breath. Yet if you find there's a constant, never-ending stream of uncomfortable things that you need to keep \"fixing\", then that points to a mental discursiveness that you need to stop following.\nThe Buddha gives ways of dealing with Distractive Thoughts. If all else fails, press your tongue to the roof of your mouth and batter through your mind's urge to \"fix\" parts of your posture.\n(Re: closing the question, I think there are perfectly Buddhist ways to answer a question like this--these are distractive thoughts, although one needs to discern the difference between a mere thought and an potential injury which is yours to prevent. I've read stories of people injuring their knees because their teacher told them to keep sitting in tight postures, ignoring their pain.)\n", "ordination - How to help non-Buddhists understand a young person's desire to be ordained as a monk?": "\nSelling Points\nAccording to the Buddha's teaching in the Samaññaphala Sutta (DN 2), there are a whole host of benefits to the life of a samana (i.e. a monk). In brief:\n\nFreedom from requirement to engage in secular society (social engagements, civic duties, etc.)\nFreedom from requirement to engage in secular employment (living as a mendicant means no need for money, etc.)\nA blissful state in the here and now (through a moral code, sense restraint, and tranquility meditation)\nWisdom and understanding about reality (through insight meditation)\nSupernatural mental abilities (astral travel, reading minds, remembering past lives, etc.)\nFreedom from mental defilements of greed, anger, and delusion (through the attainment of nirvana)\n\nI think that about sums it up better than I ever could :)\nResources\nNormally a monastery would be the best source; often for Westerners intending to traverse the globe to ordain, that isn't as easy as it should be. \nThe Internet has some resources on monkhood for lay people, at least in the Theravada tradition. Here's a couple:\nhttp://www.accesstoinsight.org/lib/authors/ariyesako/layguide.html\nhttp://www.buddhanet.net/e-learning/buddhistworld/layguide.htm\nComing To Terms\nFor my parents, actually practicing the teachings themselves helped somewhat; once they understood the benefit of meditation, they were better able to accept what I was doing. Of course, it was only once I'd ordained and they saw how it wasn't really a brainwashing cult that they really opened up and actually appreciate it.\n", "ordination - Can someone explain about children monks?": "\nIn Thailand, male novices (called nen or samanera) are a fairly common sight.  Very often they have taken vows only temporarily.  They may do it during the phansa (rainy season) period, during summer holidays from March to May, or just for a few days in order to make merit when a parent or grandparent has passed away.  The latter motivation is in a sense repayment of a debt owed to family members for being under their care as a young child.  According to Thai wikipedia, novices should be no younger than 8.  A temple website states that they follow only 10 precepts.  A Thai friend of mine told me that one motivation on the part of parents is that since the boys learn the basics of meditation practice, they are more mature and exhibit fewer behavioral problems when they come out.  I recall reading something like this in a biography of one well-known Thai monk – it might have been Buddhadasa bhikkhu.  \nRegarding language, my friend said that some of the special monastic vocabulary (like chan for ‘to eat') is used when speaking to novices as well as monks, but that the overall politeness level is less formal (e.g. novices are not addressed as ‘venerable’.) \nIn Burma I have seen young girls (samanerī or the Burmese equivalent) in pinkish robes out on alms rounds, perhaps later in the morning than monks.  You wouldn’t see that in Thailand though.\nDonald Swearer discusses additional motivations for ordaining as a teenager in his book ‘The Buddhist World of Southeast Asia’ (1995), p. 48:\n\nIn Thailand one of the principle reasons for being ordained is to acquire an education.  Among poorer families often children cannot afford to attend school.  Ordination as a novice provides for their material needs as well as a basic education.  Indeed, if a boy is bright and highly motivated he may complete secondary school as a novice or monk, graduate from a monastic college, and then earn an advanced degree from a university in another country, such as India.  After teaching in a monastery school for several years or serving as an administrator in a larger provincial monastery he will probably disrobe and take a responsible and respected secular job.  Although such exploitation of the monastic educational structure siphons off able leadership, it has become standard practice and bears little or no social stigma.\n\nI have known several university teachers who followed this career path - they were all from the relatively poor northeastern region of Thailand. \nSwearer goes on to suggest that in an earlier era, ordaining at the age of puberty was a kind of rite of passage that all males went though.  Monks in fact lead rather comfortable lives and for a child from a poor family, being a monk would mean raising one’s economic and social status.  Given the traditional link between education and the sangha, it should be no surprise that males ordain at a young age and that this is encouraged by local cultural norms.  In comtemporary Thai society the link has been weakened with the advent of universal secular education, but elsewhere in Southeast Asia (Cambodia, Laos and Burma) it is likely still quite strong.\n", "five precepts - How concerned should Buddhists be with the actions of others?": "\nI am going to quote Jack Kornfield's Living Dharma, specifically the interview portion with Achaan Chaa, excerpt from the question of \"If putting everything together in our bowls is important, why don't you as a teacher do it yourself?\" (page 42 to 43 of my edition):\n\nWisdom is for yourself to watch and develop. Take from the teacher what is good. Be aware of your own practice. If I am resting while you must sit up does this make you angry? If I call the color blue red or say that male is female, don't follow me blindly.\n[…] If you watch others at most ten percent of the time and watch yourself ninety percent, this is proper practice. […]\nLooking outside the self is comparing, discriminating. You will not find happiness that way. Nor will you find peace if you spend your time looking for the perfect man or the perfect teacher. The Buddha taught us to look at the Dharma, the truth, not to look at other people.\n\nSo I would say that, based on this, the lesson here is to remain focused on your own intentions and actions, but to strive to fully notice your own reactions to what happens. If someone else kills the insect and you benefit, how does that make you feel? How do you respond to it?\nI would argue that goes even if you have encouraged them not to do it.\n", "theravada - What does it mean to 'advert' to the factors of jhana after emerging from jhana?": "\nIn this context \"advert\" would mean to recall a cue that produces the desired effect.\nFor example in second jhana, to produce rapture and happiness without the use of applied/sustained thought, one may turn attention to the muscles of the face, temples, neck, shoulders, diaphragm, chest -- and recall the sensations they experience when feeling happy and joyful.\nIn first jhana, it would be recalling a particular idea (e.g. the happy fact that one is now separated from unskillful mental qualities due to having realized the Path).\nP.S. I would not take \"after emerging\" literally. \"After emerging\" aka \"post-meditation\" generally means one's day-to-day practice outside of formal meditation.\n", "holidays - Days of Worship - Buddhism Stack Exchang": "\nThere are Uposatha days, wherein one makes increased effort at following precepts (either being more conscientious of the five precepts or temporarily adopting the eight).\nI gather that there is often more deliberate meditation or study as well on these days, in addition to precept following:\n\nIt is usual for lay people to go to the local monastery and to spend all day and night there. In different monasteries, of course, the way they spend their time will not be the same and much depends on which aspect of the Dhamma is stressed there: study or practice. Where there is more study, they will hear as many as three or four discourses on Dhamma delivered by senior bhikkhus and they will have books to read and perhaps classes on Abhidhamma to attend. But they are quite free to plan their own time with meditation, discussion of Dhamma with the bhikkhus and so on. In a meditation monastery lay people will get less instruction and that will be about the Practice of Dhamma, while most of their time will be spent mindfully employed — walking and seated meditation with some time given to helping the bhikkhus with their daily duties. So the whole of this day and night (and enthusiastic lay people restrict their sleep) is given over to Dhamma.\nLay Buddhist Practice\n\nThen there are other various holidays and festivals. I'm not sure if any of the other holidays involve increased practice or not. Some seem like they would just involve paying respect to the Buddha (Vesak) or monks (Kathina Ceremony).\n", "philosophy - What are \"Supernatural mental abilities\" in relation to Buddhism?": "\nThe question is slightly broad and asks about several different facets.  I'm going to focus on \"Do monks or others actively practice them?\"  The answer to this is \"yes, some do.\"\nThere are a variety of beliefs and practices in a wide array of different Buddhist traditions which could be considered to be \"Supernatural\" in some way, shape, or form. They could also be considered wholly \"natural\" depending on your point of view of the mechanics behind what is happening. \nThere are practices such as tummo which have received some amount of study that allow for increasing the core body temperature.  This may or may not count as \"supernatural\" but it would certainly seem that way to an outside observer with no experience in the practice. \nThere is a belief among some practitioners of certain sects that there is a literal rainbow body phenomena wherein the body releases light and, sometimes, shrinks (my source on this is a conversation with a monk, if someone knows of something written down I'd be interested).  It is believed that this can be attained through the practice of dzogchen.\nInformation on belief in various forms of an \"energy body\" or \"subtle body\" are everywhere in various Buddhist traditions. \nThere's a practice called dream yoga which includes something that could very well be considered \"astral travel,\" though it is notoriously difficult to take a classification system derived from one system and apply it to another, so whether you count it as \"astral,\" \"illusory,\" or \"supernatural\" or just something related to what others call that may be tricky. These practices certainly have been used historically for divination (as described by Tenzin Wangyal Rinpoche), among other purposes. \nThis isn't even getting into the phenomena of emanations and other such beliefs.\nBasically: There are certainly beliefs and practices, engaged in by both monks and non-monks, that can be interpreted this way.\n", "arhats - Is it possible to recognize a person who has achieved Arhatship?": "\nThe Buddha gave some specific advice about this. In the Canki Sutta (MN 95):\n\nHow is truth discovered? Here a bhikkhu lives near some village or town. Then a householder or his son goes to him in order to test him in three kinds of ideas, in ideas provocative of greed, of hate, and of delusion, wondering, \"Are there in this venerable one any such ideas, whereby his mind being obsessed he might not knowing, say 'I know,' unseeing, say 'I see,' or to get others to do likewise, which would be long for their harm and suffering?\" While thus testing him he comes to find that there are no such ideas in him, and he finds that, \"The bodily and verbal behavior of that venerable one are not those of one affected by lust or hate or delusion. But the True Idea that this venerable one teaches is profound, hard to see and discover; yet it is the most peaceful and superior of all, out of reach of logical ratiocination, subtle, for the wise to experience; such a True Idea cannot be taught by one affected by lust or hate or delusion.\"\nhttp://www.accesstoinsight.org/tipitaka/mn/mn.095x.nymo.html\n\nIn the Vimamsaka Sutta (MN 47) he even provides means of testing a Buddha:\n\nBhikkhus, by the bhikkhu who could examine the thought processes of another the Thus Gone One should be examined on two things. On things cognisable by eye consciousness and ear consciousness. Are defiled things cognisable by eye and ear consciousness evident in the Thus Gone One or are they not? When examining he knows. These defiled things cognisable by eye and ear consciousness (*1) are not evident in the Thus Gone One. Then he should make a further examination: Are mixed things cognisable by eye and ear consciousness evident in the Thus Gone One or are they not? When examining he knows. These mixed things cognisable by eye and ear consciousness (*2) are not evident in the Thus Gone One. Then he should make a further examination: Are pure things cognisable by eye and ear consciousness evident in the Thus Gone One or are they not? When examining he knows. The pure things cognisable by eye and ear consciousness (*3) are evident in the Thus Gone One.\nhttp://www.dhammaweb.net/Tipitaka/read.php?id=81\n\nFinally, in the Thana Sutta (AN 4.192):\n\n\"It's through living together that a person's virtue may be known, and then only after a long period, not a short period; by one who is attentive, not by one who is inattentive; by one who is discerning, not by one who is not discerning.\n\"It's through dealing with a person that his purity may be known, and then only after a long period, not a short period; by one who is attentive, not by one who is inattentive; by one who is discerning, not by one who is not discerning.\n\"It's through adversity that a person's endurance may be known, and then only after a long period, not a short period; by one who is attentive, not by one who is inattentive; by one who is discerning, not by one who is not discerning.\n\"It's through discussion that a person's discernment may be known, and then only after a long period, not a short period; by one who is attentive, not by one who is inattentive; by one who is discerning, not by one who is not discerning.\nhttp://www.accesstoinsight.org/tipitaka/an/an04/an04.192.than.html\n\nThere's a story Mahasi Sayadaw told about how when asked by his attendant whether he was enlightened, an arahant himself said, \"It's difficult to know whether one is enlightened. Even a monk attending on an arahant wouldn't know it.\" Or something like that; it was an oblique means of telling his student that he was enlightened. Can't find the story, sorry.\nThe point is, it is difficult to tell whether someone else is enlightened. It is much easier to tell whether someone is unenlightened, because if they get angry, greedy or deluded, you can be sure they are not enlightened.\n", "karma - Can environmental degradation be used as a justification for the culling of an invasive alien species?": "\nThis is a complex question to which there is no right answer.  \nKarma is created by our intention.  The intention with which we engage in an action.  You can look at your intention.  Are you engaging in it for your own convenience or a well considered belief that it will ease suffering?  \nDo you know enough to make a decision about the situation?  Will the suffering of foxes you kill be less than the suffering of the native animals?  Do you know that the environment should be restored or is that just your own attachment to how things should be?\nWhen I consider situations like this and the questions that arise it becomes clear the world we live in is messy and there are situations for which there is not a right answer.  Purity within samsara is not possible.  What I can do is work to purify negative karma, accumulate good karma, and develop wisdom.\nUltimately, killing is killing and most of us have ignorance of self-grasping.  Killing invasive foxes with self-grasping ignorance creates its own karma.  Very strong conviction that it was the best course of action would be required before I took on such karma.\n", "The Seven Factors of Enlightenment": "\nI like to teach them as linear, but it's not really that simple. The Buddha said (SN 46.53) that when the mind is agitated you should cultivate the last three (tranquility, concentration and equanimity), and when the mind is sluggish, the second through fourth(investigation of dhammas, effort and rapture):\n\n\"At such times, monks, as the mind is sluggish, that is the wrong time to cultivate the enlightenment-factor[265] of tranquillity, the enlightenment-factor of concentration, the enlightenment-factor of equanimity. What is the reason? A sluggish mind is hard to arouse by these factors.\n...\n\"Monks, when the mind is agitated, that is the wrong time to cultivate the enlightenment-factors of investigation-of-states, of energy, of rapture. Why? An agitated mind is hard to calm through these factors.\n\nMindfulness, the Buddha notes, is to be always cultivated:\n\n\"But as for mindfulness, monks, I declare that it is always useful.\"\n\nhttp://www.accesstoinsight.org/lib/authors/walshe/wheel318.html#passage-58\n", "mahayana - What is meant by Namu Amida Butsu and also Nam-myoho-renge-kyo?": "\nMy answer is from the Shin perspective, I'll let someone else answer for Nichiren. Indeed you're right in saying that there are \"two\" meanings of Namu-Amida-Butsu - and that for the person of faith, it has a special meaning. However, in Shin, Namu-Amida-Butsu is not a mantra. It is understood within an entirely different framework from that of Esoteric mantras. For a person without the mind of faith (jp.: shinjin), \"Namu-Amida-Butsu\" is an effort of calling to Amida for salvation. As you probably already know, the Original Vow of Amida is that people who will sincerely and joyfully entrust themselves to Amida and call upon his Name, they will be saved and will be reborn into the Pure Land. So for a person without shinjin (which means having no doubt whatsoever about Amida's Vow), \"Namu-Amida-Butsu\" might still be a practice like others in Buddhism, an effort of self-power. For such a person, calling Namu-Amida-Butsu is a willingness to rely on the Other-Power of Amida (on his practice of saving sentient beings). But from the perspective of a person of shinjin, a true person of faith, chanting or reciting \"Namu-Amida-Butsu\" thinking that this is what will get you to the Pure Land is still caught within the logic of calculating mind, calculating merit (\"the more you say it, the more chance you will have to be reborn in the Pure Land\"). This mind that \"does religious deeds\" is the very mind of self-attachment! For a person of shinjin - for Shinran - this logic has to be absolutely abandoned. \"Namu-Amida-Butsu\" is then understood entirely differently: not as something we do, not as our own practice, but as an embodiment of Amida's practice. Another way to put it, once one totally abandons the idea that it's possible to \"save yourself\" through enough effort, one totally relies on Other-Power and so there is nothing to practice anymore on our part. There's just an absolute passivity of \"deep listening to the Dharma\". One realizes that Amida already accomplished all practices so there's nothing to do on our part except to listen to this truth and to rely on it fully. This reliance is true faith, the diamondlike mind, and \"Namu-Amida-Butsu\" is just the verbal expression thereof. It's the \"linguistic embodiment\" of our already-having-been-saved by Amida. One is then only a witness of this salvation event, not someone who is practicing to achieve one's own salvation. To practice anything after the salvation-event is to not understand that event. Practising anything after having been saved by Amida would be like looking for a job after you've already won $10 million in the lottery, to give a mundane example.\nI realize I didn't do a good job at explaining this here ... it's hard to do it in this format, but I hope that at least it became clear that the Pure Land Way of Master Shinran has nothing to do with Esoteric Buddhism or Mantrayana / the Way of Mantras. It's a wholly different paradigm.\n", "hinduism - Does Buddhism have a concept of avatars?": "\nBecause Buddhism denies the notion of \"self\" it does not have a concept of Avatar, as someone literally being a reincarnation of e.g. Ananda (Buddha's favorite student).\nTibetan Buddhism does have a notion of Tulku though, which is similar. Tulku is a new person that inherits the life stories and responsibilities of a previous person. This is done through teaching this person to deliberately identify with their predecessor, to learn predecessor's history, and to carry on his or her work.\nBecause the new person's life is so heavily influenced and inspired by the predecessor, we can say that the new person is an embodiment of the abstract energy of the previous one.\n", "meditation mindfulness - How can I know that I am clear of thoughts while I am meditating?": "\nThere are multiple kinds of mental phenomena, not all of which can be classified as thoughts.\nFirst and the crudest kind, are visualizations, cravings, and replays. This is when we mentally leave here and now, and are experiencing what basically is a (short or long) daydream about the subject our mind is concerned or agitated about.\nThe second kind are mental chatter. This is when we think in words, silently saying them in our head. If you look carefully you will notice how the muscles of the tongue and lips are slightly engaged as you \"pronounce\" your inner speeches.\nThe third kind is conceptual thinking. This is when we mentally follow a chain of logical relationships between objects or concepts. These are still thoughts.\nThe fourth kind is labeling. This is when we mentally recognize phenomena we experience and identify them with a category or attribute that makes them distinct, given the context.\nThe fifth kind is registering. This is when we make a mental note of experience without labeling it to any category. For the purposes of this answer, these are the borderline between thoughts and non-conceptual experiences.\nThe sixth kind is non-conceptual perception. This is when we experience (see, hear, smell) or feel (a bodily sensation or emotion), without labeling, acknowledging or noting it in any way. Famous technique used by Zen masters to awaken one to this level is to make a sudden noise in the middle of long meditation session.\nThe seventh kind is perception of energy. This is when we feel chakras and meridians.\nThe eighth kind is samadhi. This can't be described in words and must be experienced to be understood.\nWhen we say \"my thinking has stopped\", we usually mean levels 1-4, while levels 6-8 can still function. This said, it is not like in meditation our goal is to stop thinking. Rather, it is to open ourselves to levels 6-8. As we get better at this, thinking can go on \"in the background\" without affecting our meditation.\n", "Does the concept of evil spirits occur in Buddhism?": "\nIt's not always as clear as 'good' or 'evil'. Angry, vengeful spirits also exist in forms of Buddhism. Sometimes also seen as protectors, they can be a source of controversy.\nMore common is one's own belief in (or, more practically, fear of) something that is indefinitely, and irreparably, sinister or evil. We subscribe to all sorts of interesting notions as children, some things tend to persist. Ultimately, it's what your mind manages to trick you into into feeling; there are plenty of Christians that don't believe that demons exist so it really does depend on the individual.\nSo, yes to the concept (with emphasis on what neubau mentions about indigenous spirits), but belief is a little more complicated; belief coupled with a healthy dose of ambivalence can be quite common.\nFor children, I think the boogeyman is rather universal :)\n", "ethics - Should Buddhist teachers get rich?": "\nI don't think there is a definite answer to this question. Bear in mind that Buddha did not give any commandments in form of 'do' and 'do not'. He rather gave guidelines and various methods that are suited for various types of people.\nThe fact that one style goes against your preferences, does not mean that someone else cannot benefit from that. To practise Buddhism one should try not to judge others and focus on his own development.\nIt should be clearly said, however, that generosity is the first Paramita (liberating action or perfection). Through practising the 6 Paramitas, one can break the cycle of samsara and offering goods to the Dharma teacher is though to be a great act of generosity and it creates lots of merit in practitioner's mind. Bearing that in mind, I can think of the following reasons why there is a lot of wealth around some teachers:\n\na teacher has a very generous and rich sponsor who made promises to always provide for his teacher\na city where the teacher lives is not the safest one and the Sangha (community of practitioners) donated money so that the teacher stays in a safe environment. They also want the teacher to be healthy and have a long life, so they will always cook the best food for him and will call for the best (usually most expensive) doctors.\nexpensive cars means that they are reliable and won't break a lot so that the teachers can travel safely to spread the teachings. Same for expensive computers and phones.\nit is also an act of generosity to give others opportunity to pay money towards the Buddhist teachings. It is better if people pay hundreds of dollars for the teachings rather than in a casino.\n\nThe problem arises when the teacher abuses generosity of his students but we are not the ones to judge them. If they use Dharma to get rich, be sure there will be some karmic consequences. \nPersonally, I am not attracted to teachers who charge a lot for teachings. I trusted a teacher who is low-profile so I can relax and donate as much money as I want and can afford. Other people, however, prefer developing with their teacher in a palace and if it works for them, we can only be happy that the Dharma spreads.\n"}