{"remodeling - How do I install a new, non load bearing wall in my basement?": "\nYou shouldn't have to do anything too special, but here are a few tips from my experience:\n\nUse a treated board for the bottom of the wall where it touches the concrete.  This will help to prevent rotting from any moisture that may seep up from the concreate.\nBuild the whole wall on the ground just a bit shorter than the lowest joist/beam so you can easily raise it into place without it getting stuck.\nAt the bottom secure it with cement nails/ramset/tapcon screws to the cement floor.  \nAt the top, if the wall is perpendicular to the joists, you can shim between the bottom of the beams and the top of the wall and nail through those to attach it to the joists/beams.  \nIf the wall runs parallel to the beams/joists you can either put scraps between the beams and nail to those or you can attach a scrap of 2x4 flatwise to the wall and up against a stud, attach it to the cement wall, then nail through the stud and into the side of the scrap.  Do that for every other stud or so.\n\n", "caulking - What kind of caulk should I use around my bathtub?": "\nI just caulked my shower last night. I used GE Silicone II caulk from Home Depot. I read up on this a little before picking out what kind I needed. From what I can tell, silicone caulk is good for bathrooms because:\n\nIt's permanently waterproof\nIt doesn't crack or shrink\n\nAnother factor which may play into your choice of caulk could be whether or not it's paintable, but the most important factor for a bathroom is going to be waterproof/mold proof. \n", "Is fiberglass mesh tape a good choice for drywall?": "\nI've found that it works OK, but it's more difficult to get the surface smooth than paper tape -- as the mud dries, it shrinks, so the mesh starts to show through.  Obviously this is not a problem if you're going to be doing some heavy texturing afterwards.\n", "Are there ways to determine if a wall is load bearing?": "\nWithout looking at blueprints, all you can do is make an educated guess. Possible methods include:\n\nIf it's an exterior wall it's almost always load bearing.\nIf the joists are not continuous over the wall (they are cut short and meet on top of the wall) it is definitely load bearing.\nIf there is a load bearing wall or beam directly above or below this wall, it is likely load bearing.\nCheck the direction of the joists (as you mention). If a joist is running perpendicular to the wall, or happens to fall directly above/below the wall, it can be load bearing.\nIf there's a single top plate, the wall most likely isn't load bearing, unless the wall uses deeper studs than 2x4 (such as 2x6).\nExpose the wall over a doorway or pass-through. If it's a solid 2x6 or greater turned vertically going from the jack stud on one side to the other, there's a good chance the wall is load bearing. \nIf there are only cripple studs on a flat 2x4 to give you something to attach the drywall, it likely isn't load bearing.\nLook for signs that the wall was added after the house was built, newer wood materials, drywall or finished flooring that extend over/under the wall, etc. If the wall was added, then it isn't load bearing.\nCalculate the span from the known load bearing walls on either side of the wall you are removing, look at the type, size, and spacing of joists above the wall, and calculate if the joists can support the load above the wall without the wall being in place. If the joists can't support the load without the wall, then by definition, it's load bearing.\nWhen removing the wall, cut the studs with a sawzall. If the blade begins to bind in the middle of the stud, then there's load coming down from the ceiling through that wall and there's a good chance it was load bearing. Stop what you were doing and sister a stud to the one you were cutting.\nIf, after you remove the wall, your home collapses, it was load bearing.\n\n", "repair - How do I safely replace a worn out electrical outlet?": "\nIf you plan on doing much electrical work around the house, get a multi-meter. It's just a little box with black and red probes on the end. Safe enough to stick in an outlet to see if it's live or not.\nOutlets are mostly idiot proof. Turn off the breaker, pull it out of the box, see where the old wires are attached and move them one by one to the new outlet. Probably the old outlet already has a ground wire, in which case you're done. If it doesn't, it's probably time to call a pro.\nOnce you have it hooked up and the power is back on, you can use the multimeter to test. There is a hot side and a neutral side to the outlet. Ground behaves the same as neutral as far as the multimeter is concerned. You should be able to stick one prob in the hot side and the other into ground or neutral and get around 110 on the multimeter (+/- 2-3 volts).\n", "How do I repair hairline cracks in stucco?": "\nIf it were my house I'd get painting! Paint is intended to seal hairline cracks of this kind. Depending on your locality you may find that it's feasible to spray a paint finish over stucco, which can be by far the easiest and cheapest way to do it. \n", "Where can I find a bathroom fan that will fit in a 5\" cylindrical space?": "\nI lived in a condo built in the early 50's with a super cool looking chrome bathroom exhaust fan.  The original motor finally died after 54 years of service... so I went looking for a replacement fan/light unit.\nUnfortunately I was unsuccessful as well since the original fan housing is not the \"standard\" (read: newer) bathroom exhaust fan size.\nAnyway, I was able to find a replacement motor for the exhaust fan assembly and it worked beautifully.  If the motor has any nameplate data on it - odds are you can probably find an equivalent replacement.\nI bought mine from this place Replacement Bath Vent Fan Motors - just remember it doesn't necessarily have to say \"bath vent fan motor\" in order to work, so long as the motor nameplate data (volts, amps, HP) are similar.\nGood luck!\n", "How do I repair a small leak in a steam radiator? Could this be a big problem?": "\nI haven't had very good luck with repairing steam radiator patches from the outside (sample size: 2). Steam under pressure is very good at finding microscopic holes between patch and substrate, and enlarging them.\nWhat I have done successfully is an inside patch with epoxy, using a wire brush and steel wool to prep the surface. Getting at the leak may be a challenge, particularly with a radiator that has more than 4 sections you may need to break the sections apart (if you do, this is an excellent time to get the exterior sandblasted and painted).\nSimplest and most cost-effective solution is probably to find an architectural salvage shop and replace the radiator (they might take your old radiator as a partial trade).\n", "How do I remove wallpaper from drywall?": "\nIt depends :)\nIt really depends on how old the wallpaper is, if there are multiple wallpapers glued over each other and how much glue was used.\nIf the wallpaper is not too old, and was put on in a proper way, usually, a steamer works very well. It has the advantage that it loosens the glue without making the wallpaper to fragile to pull it off. \nI usually try to stay away from chemicals, because they always have some danger for health associated.\n", "What do I need to do to add stools to my vinyl windows?": "\nRemoving the sheetrock will lower the finished stool height a bit which will help maintain a more even reveal on the window, and  make it look less like the stool was added on.  Cut around the edges first with a utility knife to minimize damage to the surrounding jambs & wall below and then just pry it up.  \nIf you really want to keep the same reveal as the old sheetrock, you could build up your new stool out of 1/2\" thick stock (assuming the sheetrock was 1/2\").  Make one piece that is the size and shape of the entire stool, then thicken it where it projects out from the wall by laminating another 1/2\" thick piece underneath.\n", "How can I hang something on an exterior wall with vinyl siding?": "\nThe siding needs to remain free to expand and contract.  So cutting at least a slot , then hanging something through that would work, but would be unsightly, and would leak water through the hole.  So I think that finding some kind of gasket or trim piece (such as is found where your vents protrude through siding) and trimming with J-channel all around it would look better and would be less prone to leaks.\n", "How can I fill a void in a concrete seawall?": "\nAlmost all cementitious products cure better, stronger and harder with a steady presence of [fresh] water.  As far as placing the product, whichever you choose, in the presence of water, that will depend on specifics that you have not listed.  I will say that when large construction companies are pouring underwater footings, say for bridges, they will have the form in place and filled with a heavier than water gel that gets displaced by the concrete as it is poured in/injected.  If the water is intermittent or tidal you can use a simple fast setting concrete, or a normal concrete with an accelerant additive.  If it is saltwater you can use additives suited to saltwater.  Your local concrete store will be able to direct you in the right direction as far as additives go.  Be careful about what kind of reinforcement you use - many types of reinforcement are very susceptible to sulfates in the water and will cause spalling if placed too close to the outer edge of the concrete.\nWith regard to your initial description, I would say that most concrete pours end up with a void.  As long as no water is penetrating through the void in your wall you likely have no concerns in re.: future erosion.  Even if water were coming through this void the concrete has likely formed a crystalline structure that is resistant to \"erosion,\" however if water is coming through then there are many cementitious products available for purchase that will solve this problem.  I've used Xypex and at least one other for weeping foundation walls.  Insofar as patching the void is concerned I've had good luck with a product called Thoropatch.\nBest of luck in your endeavor, even if I'm not sure what said endeavor is...\nPaul\n", "How to drain a baseboard radiator system for a repair? How to refill the system?": "\nWhy do you need to solder in the new pipe? \nThere are pushfit and compression fittings designed for fix leaks. \nAssuming the leak is very small you could also use leak stop patty that you just form round the pipe\n(Once you move away from solder, you may not need to drain the system if the leak is small enough.)\n", "electrical - Should old knob and tube wiring be replaced?": "\nThe advice my family once got from an electrician on this question was that if you have low amperage service and NEVER touch it, you're probably okay.  If you have regular electrical service or touch the circuits at all, remove ALL of it. His basic theory was that if you keep the wires cool, and they haven't caused you trouble yet, it's unlikely to cause a problem. Granted that advice was about 15 years ago and none of that wiring is improving with age.\nOnce you touch the lines at all, rip it all out.  It's very likely that you will introduce a problem between the coating and the wire. The house we were dealing with went another 10 years before we needed to rewire one of the old circuits.  Once that happened we rewired the entire house all at once.\nIf you're concerned at all, turn off the affected circuits, and get rid of it. Better safe than sorry on this one.\n", "drywall - How do I find studs when stud finders won't work?": "\nDo you have any high powered magnets? like the rare earth neodymium magnets? If so you can probably rub one around the wall until it attaches to one of the nails in the studs. Or you can try thumping on the wall, a stud will sound a lot less hollow versus empty drywall. That's how I've searched around in the past.\n", "What do I have to do to prepare my garage floor for paint?": "\nThis post from the The Garage Journal forum has an excellent write-up on garage flooring products on the market.\nFind more posts on the subject, including testimonies and how-tos, here.\n", "tools - What is the difference between a framing hammer and a claw hammer?": "\nAs others have said, a framing hammer is a specialty claw hammer. \nSo what makes it different?  First, weight.  A framing hammer is typically 20-32 oz, compared with 10-16 oz for a \"normal\" household claw hammer.  That helps it pound large nails in only a few blows.  Related to that is the much longer handle on a framing hammer.\nSecond is the face of the head: it's waffled to prevent slipping off the nail head, helping prevent bent nails.  A regular claw hammer will sometimes have a textured face but not nearly as pronounced, and the face may also be smooth.  A regular claw hammer often also has a domed face to allow a skilled hand to sink a nail below the surface with minimal surface damage: that's a feature you won't see on a framing hammer.\nThird, the claw is straight since it is optimized for prying boards apart.  A regular claw hammer is optimized for pulling nails.\nIf you're only building a garage, I'd recommend using your regular hammer rather than buying a framing hammer. (Or best of all, just go rent a nail gun!).  For inexperienced carpenters, the time spent hammering will probably not be what slows you down.  Also, the framing hammer is tiring enough that after a couple hours you may actually be faster with a smaller, regular claw hammer.\nIf you do get a framing hammer I recommend a lighter one.  You'll work faster when you use it, you won't lose much power over a heavier hammer, and you'll feel much better on the second day.  In 2010 if you hammer enough that a 32oz hammer makes a difference versus a 24oz hammer, you have a nail gun anyhow.\n", "bathroom - How do I remove dried paint from ceramic tiles and the bathtub?": "\nA straight razor blade shouldn't cause any trouble on your ceramic tile (assuming it has a smooth finish) or an enameled tub, but a fiberglass tub you're right to worry about.\nDepending on the number of stains you're trying to remove you may find that heating the surface a bit by filling the tub with hot water then draining again will weaken their hold on the tub enough that you may be able to remove them with gentle scraping with a putty knife (being careful not to dig into the tub's surface).\n", "How do I remove the white residue on fresh tile grout?": "\nThis is typical.  It's called \"grout haze\", and you might have to wipe it off a couple of times before it won't reappear.\nYou just need a clean, damp rag, and some scrubbing.  If you didn't take it off immediately, it can set up, so you might need to check your local hardware store for 'grout haze remover' if water and elbow grease isn't doing it for you.\nWell, if it had been on the tile, it'd have been typical, but as Jeff pointed out, you said it was on the grout itself.  I've never done colored grouts, so I have no idea if it's typical or not ... and you wouldn't want to scrub at the grout to remove the haze, particulary when the grout's fresh (which is when you want to remove it from the tile).\nLooking around on the internet, I found mention that leaving water-based grout sealer to evaporate could do it.  They recommended re-sealing, and wiping off any excess, but others mentioned it took a lot of elbow grease and solvents.  On another site, it was mentioned it could be too much water in the grout, and suggested vinegar or a stronger acid to clean, then resealing; a few people mentioned getting grout dye to cover it up, but you have to strip any grout sealer first.\n", "plumbing - Why does my toilet's seal wear out so fast?": "\nUse two of the wax seals stacked on top of one another. It takes more squishing to set the toilet down, but the seal is a lot more resilient to shifting.\nMy plumber gave me this tip, and it seems to have worked the two times I used it.\n", "What are my options for asphalt driveway repair and/or sealing?": "\nDepending on the size of the cracks an asphalt sealant should close things up and protect the driveway. If the cracks are large you might have to get some asphalt patch and then seal it. your local home improvement store should have asphalt sealant and may have asphalt patch available.\nAsphalt sealant is pretty messy stuff though, best to wear throw away clothes and boots.\n", "caulking - Is there a trick to applying caulk using a caulk-gun?": "\nI've found that if you push the tip of the caulk gun forward along the line rather than drag it behind you can often make a very neat bead of caulk that needs little or no smoothing afterwards.\n", "How can I paint over a ceiling after there's been a leak?": "\nStains will usually come right through a new coat of paint.  \nDid you prime it first?  In my experience I've found that a good oil (or even better, shellac) based primer works best for keeping stains from bleeding through the paint.\n", "What are my lighting options for a pole-barn garage?": "\nI'd probably try for a mix of natural light, fluorescent, and point lights.\nThe natural light will be the most economical, but obviously fails at night.\nThe fluorescent lighting should give you enough light for most working conditions.\nAnd the point lights should help for when you need to do detail work or get under the hood of your cars. You can find point lights on articulated arms, that way you can just grab and move the light to wherever you need it. Mounting an arm or two on each pole would probably be enough.\n", "What is a good method to seal a baseboard to stop an existing draft?": "\nIf the gap isn't too big, regular caulk will seal the gap between it and the wall.  If you're using it at the top of the baseboard and can get it in the same color as the baseboard, you might not even have to paint it.\n", "How can I repair a Palruf roof?": "\nI've never dealt with the stuff, but I'd say if it's near the ridge line, remove whatever you have as a ridge cap, place the patch on top of the hole large enough to tuck under the ridge cap, and then replace the ridge cap.\nIf it's lower down, I think I'd patch it from the inside, and use silicone or some other sealant from above.\nAs for adhesives, my normal stand-by for this sort of thing (waterproof, gluing sheets together) is DAP contact cement, but the two pieces might not mate together well enough for that.  You could probably use a mastic, such as the roof cement they sell in caulk-gun tubes for dealing with flashing, although, it tends to be pretty ugly, so you might want to just use it to afix it, and then use silicone around the edges.  (I don't know if silicone would hold well enough for this on its own)\n", "What are the tools that every Do-it-Yourselfer must own?": "\nA cordless drill\nNo doubt about it. I bought a DeWalt 14.4V three years ago, and it's been invaluable to me.\nalt text http://www.homedepot.com/catalog/productImages/300/34/34c4b1f5-f4c7-465c-b9bb-f0a9ba2cd2ef_300.jpg\n", "lawn - Does liquid aerification work?": "\nLiquid aerification doesn't really sound like a good idea to me, but I quite honestly know nothing about it.\nWhat I'd do: Rent an aerator, spread compost and/or some good fertilizer, and water the yard. Repeat at least once a year. If you don't have any grass growing currently, bring in some compost and mix it in with the existing soil with a tiller (or something bigger).\n", "energy efficiency - Which water heater types do you recommend?": "\nWhen most people think of a water heating system, they think of a tank (40-75 gal. on average) with a heating source.  However, a robust water heating system probably shouldn't be so simple.  How you want to configure things depends on what your exact situation is, and what features you want maximized.  Some examples:\n2 tank, parallel\nThis kind of setup gives you the storage capacity of both tanks (say, 2 x 40gal = 80gal).  But it also costs twice as much to keep running.  I can't imagine why you would do this over the next idea, but I'm sure someone has a reason.\n2 tank, serial\nThis gives you a lot of versatility in water availability and cost.  In low demand situations, turn the first tank down or off.  Storing the water will let it come up to room temperature, usually reducing the heating requirements in the second tank.  Set tank 2 for your desired temperature.  When demand increases (say, relatives visit for a week) turn the first tank up to boost the inflow temperature.  Ultimately, both tanks at the desired output temperature will give you slightly more hot water than the capacity of both tanks combined; due to heating as water flows.\nTankless\nAs mentioned by others, a simple tankless heater has hidden drawbacks in demand-based activation and flow restrictions.  However, the do not heat any water unless on, so their standby energy cost is nil.  Installation can be tricky: they require costly ventilation and exhaust systems which can make them not cost-effective over their projected lifespan.  And they are difficult to tie into hot water recycling systems, if you're looking for instant-hot water at the tap.\nTank + Tankless\nYou're getting into the area of boilers, and options for combining things do very different things.  A pre-warm tank can improve the flow rate of a tankless heater, by reducing the required temperature rise.  A post-heat tank can alleviate the demand-based problems, but adds the cost of continual heating and complexity in cycling cooling water from the tank.\nOther\nAs I mentioned there are thousands of potential ways to combine systems.  Gas is cheaper than electric.  Tankless doesn't have standby costs.  Tanks smooth out warm water flow.  You have to determine your situation, and what works best.\nSuggestion\nIt may be against the TOS to talk brands, if so someone remove this or let me know.  Since we're building a house this summer I've been looking into this problem, and our contractor pointed out the Eternal brand of tankless water heaters.  They have a 2 gallon internal tank that they keep warm, which supposedly fixes the problems of demand-based activation and still costs very little for standby heat.  They integrate well with recirculation systems, and can even be combined in multi-unit setups if demand exceeds one unit.  I've not yet played with it (still building) but the concept looks great on paper.  Oh, and they have less expensive exhaust requirements as well.\n", "technique - How can I pour a concrete pad with a circular hole in it?": "\nMetal landscape edging (the kind that's held in with stakes) should work fairly well. You could either just leave it there or cover it in plastic and remove it after the concrete sets (personally, I'd leave it).\n", "How do I sound-proof a bathroom?": "\nAdd a second layer of drywall with Green Glue for sound isolation; not shilling, just heard very good things about it and plan to use it to soundproof a den. \n", "Should I use a subfloor for a finished basement's floor?": "\nI just recently finished my basement project.  I spent a lot of time scouring the web and grilling friends and co-workers about their basements to gather information to try to make an informed decision on this very subject.  \nHere are the options I considered:\n\nCarpet tiles directly over concrete\nPROS\n\ncheap\n\nCONS\n\ncold feet\nhard, unforgiving floors\nPotential for condensation/mildew, even if floor is mostly dry\n\nVERDICT\n\nI couldn't find a tile with a padding thick enough to make the floor even close to comfortable in a midwestern US winter\n\n\nTraditional carpet and pad directly over concrete\nPROS\n\nPretty cheap\nMany choices of carpet and padding thicknesses available\n\nCONS\n\nFloor is still much harder than wood subfloor\nEven thick padding can still leave the floor a bit chilly\nPotential for condensation/mildew, even if floor is mostly dry\n\nVERDICT\n\nThick padding can help the floor feel less cold, and less hard, but it's no match for wood, especially if you have a kid's playroom or a workout room in the basement\nIt seems like asking for moisture/mildew trouble to not allow air circulation between concrete and carpet\n\n\nRigid foam insulation under 5/16\" plywood subfloor\nPROS\n\nCheap\nGood R-value to provide insulation from cold\nFeels almost as warm and soft as a regular subfloor\n\nCONS\n\nOpinions vary about how long the foam will last before breaking down\nInstallation instructions vary wildly (some anchor directly to floor, others anchor through wood bracing, etc.)\nOpinions vary about how much air circulation the foam would allow\n\nVERDICT\n\nAlthough it doesn't seem like a terrible idea, there just wasn't enough information about this approach to make me feel comfortable trying it\n\n\nDRIcore-style subfloor tiles\nPROS\n\nDimpled underside allows excellent air circulation over concrete\nFeels almost as warm and soft as a regular subfloor\nMost come in 2'x2' tiles so there are no 4'x8' sheets to lug around\nEasy install, much like a \"floating\" hardwood floor\nNothing anchored into the concrete\n\nCONS\n\nBy far the most expensive option\nEach 4 sq foot panel is about $5.50 [as of 2016]\nUSD\n\nVERDICT\n\nI had a fairly large amount of floor to cover, and this was just too expensive.  It would have approached 20% of the total budget for the project.\n\n\nDimpled underlayment under 5/16\" plywood subfloor\nUPDATED March 2019\nThe Platon underlayment I used years ago seems to be hard to find these days. Home Depot currently offers what appears to be a similar underlayment product called DMX 1-STEP, and others may be available from other manufacturers.\nPROS\n\nDimpled underside allows excellent air circulation over concrete\nFeels almost as warm and soft as a regular subfloor\nMuch cheaper than the DRIcore tiles, because the Platon is purchased separately in large rolls\n\nCONS\n\nMore difficult to install than probably any other option\n4'x8' plywood subfloor is no fun to lug around\nRequires the subfloor to be anchored to the concrete\n\nVERDICT\n\nAlthough it required more manual labor, the cost was less than 10% of what it would have cost to use the DRIcore tiles\nI still got it done in just a few days, with some help moving the plywood\nI used a hammer drill and Tapcon concrete screws to secure the floor\nMy basement floor is as warm and soft as any other floor in my house, and it didn't cost an arm and a leg\n\n", "How can I remove rust stains from enamel sink?": "\nNot sure about \"Sure fire\" but a product called CLR (Calcium, Lime, Rust remover) is a good start. \n", "What is the best way to adjust pocket doors stuck on carpet?": "\nPocket doors can usually be adjusted by turning/twisting an adjustment screw at the top (sometimes a wheel at the bottom depending on the door). The door should allow for this adjustment somewhere without removing anything.\n", "bathroom - How to have a free-standing bathtub resurfaced": "\nBest thing you can do is ask for references.  Call some people who had their tub refinished several years ago and see how it's holding up.\nI've had this done a few times and it's a bit of a black art.  They have to be really meticulous with their prep work or the new finish won't last.\nAlso, you need to be careful what you clean it with after they refinish it!  Abrasive cleaners will destroy the finish.\n"}